<?php  return array (
  'resourceClass' => 'TicketsSection',
  'resource' => 
  array (
    'id' => 17,
    'type' => 'document',
    'contentType' => 'text/html',
    'pagetitle' => 'Отзывы о хороших гинекологах',
    'longtitle' => '',
    'description' => '',
    'alias' => 'otzyivyi-o-xoroshix-ginekologax',
    'link_attributes' => '',
    'published' => 1,
    'pub_date' => 0,
    'unpub_date' => 0,
    'parent' => 28,
    'isfolder' => 1,
    'introtext' => '',
    'content' => '<p>Найти женского врача, профессионала в своём деле, это уже счастье, поэтому при положительном результате лечения хороший гинеколог и отзывы получает положительные. Пациенты оставляют комментарии и пожелания, даже не задумываясь, окрылённые выздоровлением, они стараются помочь своим обращением другим больным. Поэтому отзывы о враче гинекологе важны и в большей степени они указывают на положительную расположенность пациентов. Конечно, скажете вы, отзыв может написать сам врач, этот миф мы развеем. Существует множество форумов и порталов, о которых ваш доктор может просто не знать, да и удалить негативный о нём пост под силу только администратору. </p>

<p>А вот недоброжелатели, завидущие хорошему гинекологу, отзывы, о котором читают, часто помещают негативные, нечем не подтверждённые посты. Да и непрофессиональных врачей, «купивших» диплом, в наше время тоже хватает. Поэтому важность отзывов о врачах гинекологах совсем не преувеличена, и из общей их массы выделяются основные моменты, по которым можно судить о конкретном враче гинекологе. Человек, которому действительно помогли, не будет таиться, он оставит свои координаты, что позволит связаться с ним и уточнить выложенную ним информацию. </p>

<h2>Отзывы о врачах гинекологах мужчинах</h2>

<p>Я слышала прекрасные отзывы о враче гинекологе Кравченко Павле Борисовиче сначала от сестры, потом от сотрудницы. Решила к нему обратиться по причине того, что при регулярном ежегодном медицинском обследовании у меня обнаружилась плохая цитология. К участковому врачу я идти не захотела, на то были свои причины. Записалась на приём к Павлу Борисовичу, оказалось, он принимает амбулаторно. Это для меня было довольно удобно. При осмотре в клинике у меня взяли мазки и анализы на вирус папилломы человека. Параллельно оказалось, что на шейке матки присутствует небольшая эрозия, которую заморозили, и через неделю я уже была в полном ажуре. Спустя несколько дней пришли анализы, вируса папилломы человека обнаружено не было, я вздохнула с облегчением. Теперь состою на учёте по патологии шейки матки, проверяюсь раз в три месяца. Вот сегодня опять была на приёме у Павла Борисовича, хороший гинеколог, отзыв оставлю о нём положительный. </p>

<p>Предварительно читала отзывы о враче гинекологе Пахомове Александре Николаевиче, не нашла ни одного отрицательного. Пишу инкогнито, так как к нему пришлось обратиться, чтобы сделать медицинский аборт, на то были свои причины. Проведённой операцией я довольна, всё прошло, без каких-либо последствий. Был назначен приём антибиотиков во избежание заражения. Советую всем этого специалиста, он настоящий асс в своём деле. В клинике общалась с другими пациентками, они полностью согласны со мной. </p>

<p>Хоть Скляров Виталий Николаевич и молодой специалист, но довольно хороший гинеколог и отзыв о нём у меня положительный. Пишу впервые, после года знакомства. Дело в том, что Виталий Николаевич вёл меня всю беременность. Он вместе со мной переживал за моего будущего ребёночка. Давал различные диеты, при которых я не должна была поправиться, а ребёнок получал все необходимые вещества. Страшный токсикоз, низкий гемоглобин и приросшую плаценту мы пережили. Теперь я могу вздохнуть спокойно и написать о моём спасителе положительный отзыв. Притом Виталий Николаевич ведёт «Школу молодых мам» и является УЗИ специалистом. Поэтому хороший отзыв о враче гинекологе Склярове и мои рекомендации о нём, как о специалисте, я с радостью оставляю. </p>

<p>Хочу оставить отзывы о враче гинекологе Запорожцеве Дмитрии Анатольевиче, который успешно произвел мне лапароскопическую операцию. Оперативное вмешательство было просто необходимо, врач сделал всё от него зависящее, за что я очень ему благодарна. Уже поправилась, после операции прошло полтора месяца, гуляя по интернету, нашла отзывы о гинекологах, решила оставить свой пост. Уж очень я благодарна Дмитрию Анатольевичу. </p>

<p>Проявление эндометриоза у меня было обнаружено при УЗИ исследовании. После месячных он составлял 10-ку вместо единицы. Высоцкий Максим Макарович, хороший гинеколог, отзыв, о котором я хочу оставить, помог мне избавиться от данной проблемы. Была произведена полная чистка, затем назначено лечение с помощью недостающих гормонов. Сейчас всё нормализовалось, эндометрия в норме, я счастлива. Советую данного специалиста всем женщинам, у которых проблемы, подобные моим. </p>

<h2>Отзывы о врачах гинекологах женщинах</h2>

<p>Онищук Марина Анатольевна толковый врач гинеколог и просто хороший человек. Хочу поблагодарить её за сдержанность и терпение, а также за помощь в лечении принеприятнейшего заболевания, называть его не стану. Её большой стаж работы позволяет с лёгкостью ставить правильные диагнозы уже при первом осмотре. Так было и со мной, анализы только подтвердили то, что сказала врач. В итоге мне был назначен курс лечения, который помог избавиться от противного недуга. </p>

<p>Вполне могу заявить, что Назарова Наталья Александровна хороший гинеколог, отзывы о ней я нашла в интернете на форуме и теперь их могу полностью подтвердить. Благодаря ей мне была сделана чистка наросшего слоя эндометрия, из-за которого я не могла забеременеть. После этого врач мне назначила гормональное лечение и уже через полгода я увидела на тесте две заветные полоски. Следует сказать, что ребёночка мы ждали 5 долгих лет. Теперь я полностью счастлива и выражаю свою благодарность Назаровой Наталье Александровне. </p>

<p>Бойко Марину Александровну можно назвать молодым, но очень хорошим гинекологом, отзыв о ней я хочу оставить утвердительно положительный. Это как раз тот случай, когда профессионал находится на своём месте. Я быстро избавилась от эрозии, которая у меня появилась поле рождения ребёнка, получила рекомендации по контрацепции. Отдельное спасибо за приветливость и простоту в общении, это есть не у каждого врача-гинеколога. Хотя я знакома с Мариной Александровной недавно, всего лишь месяц, могу отозваться о ней как о профессионале и просто хорошей женщине. </p>

<p>Обратилась к Хестановой Азе Борисовне по рекомендации подруги. Беспокоящие меня причины заключались в невозможности забеременеть на протяжении двух лет. Предварительно уже обращалась к трём специалистам, но результата положительного не было. Азе Борисовне удалось восстановить причину моего недуга, оказался «Ановуляторный цикл», который в моём возрасте крайне редок. А всё оказалось довольно просто, переезд в другой город, смена климата, привели к таким пагубным последствиям. Доктору удалось восстановить мой месячный цикл, теперь я жду ребёнка. Считаю Азу Борисовну хорошим гинекологом, отзыв оставляю положительный. </p>

<p>Мурзина Елена Валерьевна хоть и сравнительно молодой специалист, но довольно профессиональный гинеколог. Обратилась к ней с проблемой, рассказала о её симптоматике. При первичном осмотре она сразу выявила у меня вульвит. При этом не поменяла ко мне отношения и не стала копошиться в моей душе. Просто назначила лечение, сказала, что нужно делать. Рассказала и про защищённый секс, сделав это неназойливо, как бы, между прочим. Болезнь я вылечила, поэтому благодарна Елене Валерьевне. Таких людей добрых, как она, и при этом хороших гинекологов нужно ещё поискать. </p>

<p>Я с уверенностью могу сказать, что Вздорова Клавдия Юрьевна хороший генеколог, отзыв от меня ей только положительный. Все заключения УЗИ, которые она делала, являются качественными, если патология была найдена, то ей уже никуда не деться. Операцию мне сделал другой специалист, с более с узкой специализацией, а вот на учёт по беременности я стала к Клавдии Юрьевне. Почему-то, после того, как первый ребёнок замер в утробе, я больше участковым врачам не доверяю. Сейчас 38 неделя, скоро роды. Теперь с уверенностью могу написать отзыв, уже не боясь сглазить. </p>

<p>Прокопенко Татьяна Марковна, вот моя надежда на счастливую семейную жизнь. Именно так я могу назвать этого прекрасного человека и опытного врача гинеколога. Вы просто не представляете, как можно 10 лет хотеть ребёнка и не иметь возможности забеременеть. Именно Татьяна Марковна помогла мне осуществить мою мечту, теперь мы с мужем полностью счастливы. Всего через два года после знакомства с этим доктором я не только смогла забеременеть, но и выносить, и родить. Диагноз свой уточнять не стану, да и вряд ли это кому-то поможет, а вот хороший отзыв о враче гинекологе Прокопенко Татьяне Марковне я с радостью оставлю. </p>

<p>Хочу оставить положительный отзыв о враче гинекологе Хестановой Азе Борисовне. Обратившись к ней с кучей анализов, я пожаловалась на периодические кровянистые выделения, которые не связаны с менструальным циклом. Врач детально изучила все исследования, затем произвела осмотр, после которого с уверенностью сказала, что у меня крупных размеров эрозия на шейке матки. Аза Борисовна направила меня в кабинет шейки матки, где мне произвели заморозку. В результате я здорова, ничего больше не волнует, сейчас беременна вторым ребёнком, наблюдаюсь у своего гинеколога, Азы Борисовны. </p>

<p>Отзывы о враче гинекологе Назаровой Наталье Александровне я нашла, шерстя интернет сайты. Вбила её имя в поиск, прочла дополнительные сведения, записалась на приём. Каково было моё удивление от радушного приёма и дружеского общения, которого не встретишь в нашей участковой клинике. Хоть приём был и платным, мне этих денег не жалко, тем более что в городской клинике также приходится платить. Каких-то отклонений в женском здоровье у меня выявлено не было. Планирую посещать Наталью Александровну часто, так как в скором будущем мы с мужем хотим родить здорового малыша. </p>
',
    'richtext' => 1,
    'template' => 7,
    'menuindex' => 1,
    'searchable' => 1,
    'cacheable' => 1,
    'createdby' => 3,
    'createdon' => 1460564550,
    'editedby' => 5,
    'editedon' => 1505789492,
    'deleted' => 0,
    'deletedon' => 0,
    'deletedby' => 0,
    'publishedon' => 1460477940,
    'publishedby' => 3,
    'menutitle' => '',
    'donthit' => 0,
    'privateweb' => 0,
    'privatemgr' => 0,
    'content_dispo' => 0,
    'hidemenu' => 0,
    'class_key' => 'TicketsSection',
    'context_key' => 'web',
    'content_type' => 1,
    'uri' => 'otzyivyi-o-xoroshix-ginekologax.html',
    'uri_override' => 0,
    'hide_children_in_tree' => 0,
    'show_in_tree' => 1,
    'properties' => '{"tickets":{"template":"6","uri":"%id-%alias%ext","show_in_tree":false,"hidemenu":"0","disable_jevix":false,"process_tags":false},"ratings":{"ticket":"10","comment":"1","view":"0.1","vote_ticket":"1","vote_comment":"0.2","star_ticket":"3","star_comment":"0.6"},"ms2gallery":{"media_source":"3"}}',
    'comments' => 0,
    'views' => 0,
    'votes' => 0,
    'tickets' => 0,
    'meta_title' => 
    array (
      0 => 'meta_title',
      1 => 'Хорошие гинекологи и отзывы о них',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'meta_keywords' => 
    array (
      0 => 'meta_keywords',
      1 => 'хороший врач гинеколог отзывы',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'meta_description' => 
    array (
      0 => 'meta_description',
      1 => 'Отзывы о враче гинекологе важны и в большей степени они указывают на расположенность пациентов. Отзывы помогают найти лучшего специалиста.',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'img' => 
    array (
      0 => 'img',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'videos' => 
    array (
      0 => 'videos',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    '_content' => '[[!bannersInitialize]]
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="utf-8" />
    <title>Хорошие гинекологи и отзывы о них</title>
    <base href="https://otzivi-ginekolog.ru/" />
    <link href="/favicon.ico" rel="icon" type="image/x-icon" />
    <meta name="keywords" content="хороший врач гинеколог отзывы" />
    <meta name="description" content="Отзывы о враче гинекологе важны и в большей степени они указывают на расположенность пациентов. Отзывы помогают найти лучшего специалиста." />
    <meta name=\'yandex-verification\' content=\'75360eb96691232a\' />
    <meta name="yandex-verification" content="2caee598de1cfdef" />
    <meta name="yandex-verification" content="07abc805260318c1" />
	<meta name="google-site-verification" content="PHwVe-JRbCnOhttxe4IWIdt3ZpOLezqR-QpXcWCLGlk" />
	<meta name="google-site-verification" content="av6LHNns4n8A8X8ISgtMiQCHjaXLmgz8nD3audlK9c4" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    [[!CanonicalUrl]]


</head>
<body>

<div class="wrapper">

    <div class="preloader">
    <style>
        .preloader {
            position: fixed;
            z-index: 10000;
            width: 100%;
            height: 100%;
            background: #fff;
            top: 0;
            left: 0;
            opacity: 1;
            visibility: visible;
            transition: opacity ease 0.8s, visibility ease 0.8s;
            
        }
    </style>
</div>
<header class="header">
    <div class="container">
        <div class="top">
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                <div class="row">
                    <div class="logo">
                        
                            <a href="/"><div class="logo-img"><img src="assets/template/images/otzivi-ginekologi-logo.png" alt="Фото: Отзывы о хороших гинекологах"></div></a>
                        
                    </div>
                </div>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-6 col-xs-12">
                <a class="fancybox free_choice_link free_choice_link_header btn_pg" href="#free_choice">Бесплатный подбор гинеколога</a>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                

<div class="login">
    <a class="fancybox" href="#popup_form">Получить бесплатную консультацию</a>
</div>

            </div>
        </div>
        <div class="col-xs-12">
            <div class="row">
                <nav class="menu-top">
                    <span><i class="fa fa-bars"></i></span>
                    <ul class=""><li class="first"><a href="blog.html" >Статьи</a></li><li><a href="video.html" >Видео</a></li><li class="active"><a href="otzyivyi.html" >Отзывы</a><ul class=""><li class="first"><a href="otzyivyi-pro-ginekologov-moskvyi.html" >Отзывы про гинекологов Москвы</a></li><li class="active"><a href="otzyivyi-o-xoroshix-ginekologax.html" >Отзывы о хороших гинекологах</a></li><li><a href="otzyivyi-o-vrachax-akusherax.html" >Отзывы о врачах акушерах</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-endokrinologax.html" >Отзывы о врачах гинекологах-эндокринологах</a></li><li><a href="otzyivyi-o-vrachax-ultrazvukovoj-diagnostiki.html" >Отзывы о врачах ультразвуковой диагностики</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-reproduktologax.html" >Отзывы о врачах гинекологах-репродуктологах</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-endoskopistax.html" >Отзывы о врачах гинекологах-эндоскопистах</a></li><li class="last"><a href="otzyivyi-o-vrachax-onkologax.html" >Отзывы о врачах онкологах</a></li></ul></li><li class="last"><a href="obratnaya-svyaz.html" >Обратная связь</a></li></ul>
                </nav>
            </div>
        </div>
                
    </div>
</header><!-- .header-->

    <div class="middle">

        <div class="container">
            <div class="row">
                <main class="content">
                    <div class="row">
                    <!--<div class="flash_banner horizontal_main img" style="text-align:center;margin-bottom:20px;">
    <div class="horizontal" >
        <div id="banner_horizontal">
            <a href="http://altravita-ivf.ru" target="_blank"><img src="/assets/template/images/468x60.gif" alt="http://altravita-ivf.ru" width="468" height="60"/></a>
        </div>
    </div>
    <div class="vertical">
        <div id="banner_vertical">
            <a title="http://altravita-ivf.ru" href="http://altravita-ivf.ru"><img src="/assets/template/images/240x400.gif" alt="http://altravita-ivf.ru" width="240" height="400"/></a>
        </div>
    </div>
</div>

<script type="text/javascript">//<![CDATA[
   var flashvars = {};
   var params = {
                 wmode: "transparent",
                 quality: "high",
                 scale:"noscale",
                 menu:"none"
                };
   var attributes = {};
   
   swfobject.embedSWF("/assets/template/images/468x60.swf", "banner_horizontal", "468", "60", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);
   swfobject.embedSWF("/assets/template/images/240x400.swf", "banner_vertical", "240", "400", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);

           //]]>
</script> -->
                        <div class="col-lg-9 col-md-9 col-sm-9 col-xs-12">
                            <div class="breadcrumbs"><a href="/">Главная</a> / <a href="otzyivyi.html">Отзывы</a> / <span>Отзывы о хороших гинекологах</span></div>
                            <div class="news main-content title text_edit">
                                <div class="row">
                                    <div class="col-md-9 col-sm-8"><h1 class="page__title">Отзывы о хороших гинекологах[[!get]]</h1></div>
                                    <div class="col-md-3 col-sm-4 col-sm-push-0 col-xs-8 col-xs-push-2">
                                        <a class="btn_pg top scroll_to" href="#comment-new-link">Добавить отзыв</a>
                                    </div>
                                    <br>
                                    <br>
                    					
                                </div>
                               <div class="blog_list new-topics">
                                	
                                    
                                    
                                    <div id="seo_content">
                                        [[!pdoPage@pagination?
                                            &element=`getTickets`
                                            &showUnpublished=`1`
                                            &tpl=`ticket_item_new`
                                            &includeContent=`1`
                                            &limit=`12`
                                            &includeTVs=`is_published,publishdate,publishon`
                                            &tvFilters=`is_published==1`
                                            &sortbyTV=`publishon`
                                            &sortdirTV=`DESC`
                                        ]]
                                    </div>
                                    
                                    [[!+page.nav]]
                                    [[!loginUserForAddTicket?]]
                                    [[!TicketFormCustom?
                                        &requiredFields=`pagetitle,email,content`
                                        &allowedFields=`pagetitle,email,content,published`
                                        &redirectUnpublished=`17`
                                        &tplFormCreate=`tpl.Tickets.form.create.custom`
                                        &allowFiles=`0`
                                    ]]
                                    
                        			[[!hideOnPagination? &out=`<div class="text_edit">
                    					<p>Найти женского врача, профессионала в своём деле, это уже счастье, поэтому при положительном результате лечения хороший гинеколог и отзывы получает положительные. Пациенты оставляют комментарии и пожелания, даже не задумываясь, окрылённые выздоровлением, они стараются помочь своим обращением другим больным. Поэтому отзывы о враче гинекологе важны и в большей степени они указывают на положительную расположенность пациентов. Конечно, скажете вы, отзыв может написать сам врач, этот миф мы развеем. Существует множество форумов и порталов, о которых ваш доктор может просто не знать, да и удалить негативный о нём пост под силу только администратору. </p>

<p>А вот недоброжелатели, завидущие хорошему гинекологу, отзывы, о котором читают, часто помещают негативные, нечем не подтверждённые посты. Да и непрофессиональных врачей, «купивших» диплом, в наше время тоже хватает. Поэтому важность отзывов о врачах гинекологах совсем не преувеличена, и из общей их массы выделяются основные моменты, по которым можно судить о конкретном враче гинекологе. Человек, которому действительно помогли, не будет таиться, он оставит свои координаты, что позволит связаться с ним и уточнить выложенную ним информацию. </p>

<h2>Отзывы о врачах гинекологах мужчинах</h2>

<p>Я слышала прекрасные отзывы о враче гинекологе Кравченко Павле Борисовиче сначала от сестры, потом от сотрудницы. Решила к нему обратиться по причине того, что при регулярном ежегодном медицинском обследовании у меня обнаружилась плохая цитология. К участковому врачу я идти не захотела, на то были свои причины. Записалась на приём к Павлу Борисовичу, оказалось, он принимает амбулаторно. Это для меня было довольно удобно. При осмотре в клинике у меня взяли мазки и анализы на вирус папилломы человека. Параллельно оказалось, что на шейке матки присутствует небольшая эрозия, которую заморозили, и через неделю я уже была в полном ажуре. Спустя несколько дней пришли анализы, вируса папилломы человека обнаружено не было, я вздохнула с облегчением. Теперь состою на учёте по патологии шейки матки, проверяюсь раз в три месяца. Вот сегодня опять была на приёме у Павла Борисовича, хороший гинеколог, отзыв оставлю о нём положительный. </p>

<p>Предварительно читала отзывы о враче гинекологе Пахомове Александре Николаевиче, не нашла ни одного отрицательного. Пишу инкогнито, так как к нему пришлось обратиться, чтобы сделать медицинский аборт, на то были свои причины. Проведённой операцией я довольна, всё прошло, без каких-либо последствий. Был назначен приём антибиотиков во избежание заражения. Советую всем этого специалиста, он настоящий асс в своём деле. В клинике общалась с другими пациентками, они полностью согласны со мной. </p>

<p>Хоть Скляров Виталий Николаевич и молодой специалист, но довольно хороший гинеколог и отзыв о нём у меня положительный. Пишу впервые, после года знакомства. Дело в том, что Виталий Николаевич вёл меня всю беременность. Он вместе со мной переживал за моего будущего ребёночка. Давал различные диеты, при которых я не должна была поправиться, а ребёнок получал все необходимые вещества. Страшный токсикоз, низкий гемоглобин и приросшую плаценту мы пережили. Теперь я могу вздохнуть спокойно и написать о моём спасителе положительный отзыв. Притом Виталий Николаевич ведёт «Школу молодых мам» и является УЗИ специалистом. Поэтому хороший отзыв о враче гинекологе Склярове и мои рекомендации о нём, как о специалисте, я с радостью оставляю. </p>

<p>Хочу оставить отзывы о враче гинекологе Запорожцеве Дмитрии Анатольевиче, который успешно произвел мне лапароскопическую операцию. Оперативное вмешательство было просто необходимо, врач сделал всё от него зависящее, за что я очень ему благодарна. Уже поправилась, после операции прошло полтора месяца, гуляя по интернету, нашла отзывы о гинекологах, решила оставить свой пост. Уж очень я благодарна Дмитрию Анатольевичу. </p>

<p>Проявление эндометриоза у меня было обнаружено при УЗИ исследовании. После месячных он составлял 10-ку вместо единицы. Высоцкий Максим Макарович, хороший гинеколог, отзыв, о котором я хочу оставить, помог мне избавиться от данной проблемы. Была произведена полная чистка, затем назначено лечение с помощью недостающих гормонов. Сейчас всё нормализовалось, эндометрия в норме, я счастлива. Советую данного специалиста всем женщинам, у которых проблемы, подобные моим. </p>

<h2>Отзывы о врачах гинекологах женщинах</h2>

<p>Онищук Марина Анатольевна толковый врач гинеколог и просто хороший человек. Хочу поблагодарить её за сдержанность и терпение, а также за помощь в лечении принеприятнейшего заболевания, называть его не стану. Её большой стаж работы позволяет с лёгкостью ставить правильные диагнозы уже при первом осмотре. Так было и со мной, анализы только подтвердили то, что сказала врач. В итоге мне был назначен курс лечения, который помог избавиться от противного недуга. </p>

<p>Вполне могу заявить, что Назарова Наталья Александровна хороший гинеколог, отзывы о ней я нашла в интернете на форуме и теперь их могу полностью подтвердить. Благодаря ей мне была сделана чистка наросшего слоя эндометрия, из-за которого я не могла забеременеть. После этого врач мне назначила гормональное лечение и уже через полгода я увидела на тесте две заветные полоски. Следует сказать, что ребёночка мы ждали 5 долгих лет. Теперь я полностью счастлива и выражаю свою благодарность Назаровой Наталье Александровне. </p>

<p>Бойко Марину Александровну можно назвать молодым, но очень хорошим гинекологом, отзыв о ней я хочу оставить утвердительно положительный. Это как раз тот случай, когда профессионал находится на своём месте. Я быстро избавилась от эрозии, которая у меня появилась поле рождения ребёнка, получила рекомендации по контрацепции. Отдельное спасибо за приветливость и простоту в общении, это есть не у каждого врача-гинеколога. Хотя я знакома с Мариной Александровной недавно, всего лишь месяц, могу отозваться о ней как о профессионале и просто хорошей женщине. </p>

<p>Обратилась к Хестановой Азе Борисовне по рекомендации подруги. Беспокоящие меня причины заключались в невозможности забеременеть на протяжении двух лет. Предварительно уже обращалась к трём специалистам, но результата положительного не было. Азе Борисовне удалось восстановить причину моего недуга, оказался «Ановуляторный цикл», который в моём возрасте крайне редок. А всё оказалось довольно просто, переезд в другой город, смена климата, привели к таким пагубным последствиям. Доктору удалось восстановить мой месячный цикл, теперь я жду ребёнка. Считаю Азу Борисовну хорошим гинекологом, отзыв оставляю положительный. </p>

<p>Мурзина Елена Валерьевна хоть и сравнительно молодой специалист, но довольно профессиональный гинеколог. Обратилась к ней с проблемой, рассказала о её симптоматике. При первичном осмотре она сразу выявила у меня вульвит. При этом не поменяла ко мне отношения и не стала копошиться в моей душе. Просто назначила лечение, сказала, что нужно делать. Рассказала и про защищённый секс, сделав это неназойливо, как бы, между прочим. Болезнь я вылечила, поэтому благодарна Елене Валерьевне. Таких людей добрых, как она, и при этом хороших гинекологов нужно ещё поискать. </p>

<p>Я с уверенностью могу сказать, что Вздорова Клавдия Юрьевна хороший генеколог, отзыв от меня ей только положительный. Все заключения УЗИ, которые она делала, являются качественными, если патология была найдена, то ей уже никуда не деться. Операцию мне сделал другой специалист, с более с узкой специализацией, а вот на учёт по беременности я стала к Клавдии Юрьевне. Почему-то, после того, как первый ребёнок замер в утробе, я больше участковым врачам не доверяю. Сейчас 38 неделя, скоро роды. Теперь с уверенностью могу написать отзыв, уже не боясь сглазить. </p>

<p>Прокопенко Татьяна Марковна, вот моя надежда на счастливую семейную жизнь. Именно так я могу назвать этого прекрасного человека и опытного врача гинеколога. Вы просто не представляете, как можно 10 лет хотеть ребёнка и не иметь возможности забеременеть. Именно Татьяна Марковна помогла мне осуществить мою мечту, теперь мы с мужем полностью счастливы. Всего через два года после знакомства с этим доктором я не только смогла забеременеть, но и выносить, и родить. Диагноз свой уточнять не стану, да и вряд ли это кому-то поможет, а вот хороший отзыв о враче гинекологе Прокопенко Татьяне Марковне я с радостью оставлю. </p>

<p>Хочу оставить положительный отзыв о враче гинекологе Хестановой Азе Борисовне. Обратившись к ней с кучей анализов, я пожаловалась на периодические кровянистые выделения, которые не связаны с менструальным циклом. Врач детально изучила все исследования, затем произвела осмотр, после которого с уверенностью сказала, что у меня крупных размеров эрозия на шейке матки. Аза Борисовна направила меня в кабинет шейки матки, где мне произвели заморозку. В результате я здорова, ничего больше не волнует, сейчас беременна вторым ребёнком, наблюдаюсь у своего гинеколога, Азы Борисовны. </p>

<p>Отзывы о враче гинекологе Назаровой Наталье Александровне я нашла, шерстя интернет сайты. Вбила её имя в поиск, прочла дополнительные сведения, записалась на приём. Каково было моё удивление от радушного приёма и дружеского общения, которого не встретишь в нашей участковой клинике. Хоть приём был и платным, мне этих денег не жалко, тем более что в городской клинике также приходится платить. Каких-то отклонений в женском здоровье у меня выявлено не было. Планирую посещать Наталью Александровну часто, так как в скором будущем мы с мужем хотим родить здорового малыша. </p>

                        			</div>`]]
                                    <div class="content-block">
    <div class="main-form">
    <h4>Нужна помощь в выборе гинеколога?</h4>
    <p>Оставьте телефон, мы перезвоним и бесплатно подберем гинеколога, имеющего опыт лечения именно вашей проблемы</p>
        <form id="main-form" method="post" action="assets/template/php/submit.php" data-id="review_form_choice" class="sendLead">
            <div class="row">
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input name="name" type="text" placeholder="Имя:" />
                </div>
                
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                </div>
                <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
                    <textarea placeholder="Ваше сообщение:" name="message"></textarea>
                    <input name="type" type="hidden" value="Бесплатная консультация специалиста" />
                    <input type="text" name="lastname" value="" />
                    <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                    <button class="btn-all" type="submit" form="main-form">Отправить</button>
                </div>
            </div>
        </form>
    </div>
</div>
                                    
                                </div>
                            </div>

                        </div>
                        <div class="col-lg-3 col-md-3 col-sm-3 col-xs-12">
                            <aside class="left-sidebar">
    
    
    
    [[!*id:is=`1`:then=`
        [[!+show_banner_on_main:is=`1`:then=`<div class="avb_240" data-alt="Отзывы о хороших гинекологах"></div>

`]]
    `:else=`
        [[!+show_banner_on_article:is=`1`:then=`<div class="avb_240" data-alt="Отзывы о хороших гинекологах"></div>

`]]
    `]]
    
    
    <div class="sidebar-block">
    <h4><a href="video.html">Видео<i class="fa fa-plus-square"></i></a></h4>
    <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
        <div class="row">
            <div class="item-video">
    <div class="lazyYT" data-youtube-id="4qGnkcJeVYk" data-ratio="16:9">Смотреть всем беременным! Главные мифы о родах. От врача акушера-гинеколога с 30-ти летним стажем.</div>
</div>
        </div>
    </div>
</div>
    <div class="content-block">
        <h4><a href="blog.html">Разделы отзывов</a></h4>
        <div class="wrap-content-block">
            <article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-xoroshix-ginekologax.html">
        <h5>Отзывы о хороших гинекологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-pro-ginekologov-moskvyi.html">
        <h5>Отзывы про гинекологов Москвы</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-akusherax.html">
        <h5>Отзывы о врачах акушерах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-endokrinologax.html">
        <h5>Отзывы о врачах гинекологах-эндокринологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ultrazvukovoj-diagnostiki.html">
        <h5>Отзывы о врачах ультразвуковой диагностики</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-reproduktologax.html">
        <h5>Отзывы о врачах гинекологах-репродуктологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-endoskopistax.html">
        <h5>Отзывы о врачах гинекологах-эндоскопистах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-onkologax.html">
        <h5>Отзывы о врачах онкологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
        </div>

        <h4 id="blog_h4"><a href="blog.html">Последние в блоге</a></h4>
        <div class="wrap-content-block">
            <article class="main-blog" style="    margin-bottom: 15px;">
    <a href="vrach-akusher-ginekolog.html">
        <h5>Врач акушер гинеколог</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-xoroshij-li-ginekolog.html">
        <h5>Отзывы: хороший ли гинеколог</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="detskij-ginekolog-otzyivyi.html">
        <h5>Детский гинеколог: отзывы</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-ob-akusherax-ginekologax.html">
        <h5>Отзывы об акушерах гинекологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="konsultacziya-ginekologa-onlajn.html">
        <h5>Консультация гинеколога онлайн</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
        </div>
    </div>
</aside><!-- .left-sidebar -->
                        </div>
                        
                    </div>

                    <div class="clearfix"></div>
                </main><!-- .content -->
            </div>
        </div>

    </div><!-- .middle-->

</div><!-- .wrapper -->

<footer class="footer">
    <div class="container">
        <div class="row">
            <div class="wrap-footer clearfix">
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12">
                    <div class="row">
                        <nav class="menu-footer">
                            <ul class=""><li class="first"><a href="blog.html" >Статьи</a></li><li><a href="video.html" >Видео</a></li><li class="active"><a href="otzyivyi.html" >Отзывы</a></li><li><a href="obratnaya-svyaz.html" >Обратная связь</a></li><li class="last"><a href="polzovatelskoe-soglashenie.html" >Пользовательское соглашение</a></li></ul>
                        </nav>
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4">
                    <div class="metriks-links">
                        <!-- Yandex.Metrika informer - -><a href="https://metrika.yandex.ru/stat/?id=32824167&amp;from=informer" target="_blank" rel="nofollow"><img src="https://informer.yandex.ru/informer/32824167/3_1_FFFFFFFF_EFEFEFFF_0_pageviews" style="width:88px; height:31px; border:0;" alt="Яндекс.Метрика" title="Яндекс.Метрика: данные за сегодня (просмотры, визиты и уникальные посетители)" onclick="try{Ya.Metrika.informer({i:this,id:32824167,lang:\'ru\'});return false}catch(e){}" /></a><!-- /Yandex.Metrika informer --><!-- Yandex.Metrika counter --><script type="text/javascript">    (function (d, w, c) {        (w[c] = w[c] || []).push(function() {            try {                w.yaCounter32824167 = new Ya.Metrika({                    id:32824167,                    clickmap:true,                    trackLinks:true,                    accurateTrackBounce:true,                    webvisor:true                });            } catch(e) { }        });        var n = d.getElementsByTagName("script")[0],            s = d.createElement("script"),            f = function () { n.parentNode.insertBefore(s, n); };        s.type = "text/javascript";        s.async = true;        s.src = "https://mc.yandex.ru/metrika/watch.js";        if (w.opera == "[object Opera]") {            d.addEventListener("DOMContentLoaded", f, false);        } else { f(); }    })(document, window, "yandex_metrika_callbacks");</script><noscript><div><img src="https://mc.yandex.ru/watch/32824167" style="position:absolute; left:-9999px;" alt="" /></div></noscript><!-- /Yandex.Metrika counter -->
                        <script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'//www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-68331533-24\', \'auto\');
  ga(\'send\', \'pageview\');

</script>
                        <!--LiveInternet counter--><script type="text/javascript"><!--
document.write("<a href=\'//www.liveinternet.ru/click\' "+
"target=_blank><img src=\'//counter.yadro.ru/hit?t13.6;r"+
escape(document.referrer)+((typeof(screen)=="undefined")?"":
";s"+screen.width+"*"+screen.height+"*"+(screen.colorDepth?
screen.colorDepth:screen.pixelDepth))+";u"+escape(document.URL)+
";"+Math.random()+
"\' alt=\'\' title=\'LiveInternet: показано число просмотров за 24"+
" часа, посетителей за 24 часа и за сегодня\' "+
"border=\'0\' width=\'88\' height=\'31\'><\\/a>")
//--></script><!--/LiveInternet-->
                        <!-- begin of Top100 code --><script id="top100Counter" type="text/javascript" src="https://counter.rambler.ru/top100.jcn?3136113"></script><noscript><a href="https://top100.rambler.ru/navi/3136113/"><img src="https://counter.rambler.ru/top100.cnt?3136113" alt="Rambler\'s Top100" border="0" /></a></noscript><!-- end of Top100 code -->
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12 pull-right">
                    <div class="row">
                        <div class="copy">
                            <span>Все права защищены, 2019 &copy; Отзывы про врачей гинекологов</span>
                        </div>
                    </div>
                </div>
                <div class="col-xs-12">
                    <a href="obratnaya-svyaz.html" class="btn_blue_variant  btn-all button-wide button-wide_footer ">Задать вопрос</a>
                </div>
            </div>
        </div>
    </div>
</footer><!-- .footer -->
<a href="#" class="scrollup">Наверх</a>
<style>
    .preloader {
        opacity: 0;
        visibility: hidden;
    }
</style>


    
    <link rel="stylesheet" href="/assets/components/minifyx/cache/styles_263a873631.min.css" type="text/css" />
    

<script type="text/javascript" src="/assets/components/minifyx/cache/scripts_e57501fd6c.min.js"></script>
<div class="hidden">
    <div id="success">
      <h2>
      Ваша заявка принята!
      <br>
      Мы скоро с Вами свяжемся.
      </h2>
    </div>
    <div id="loading">
      <div id="load"></div>
    </div>
</div>
<div class="hidden">
    <div class="priem_form center" id="free_choice">
        <div>
            <h3>Бесплатный подбор<br/>гинеколога</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_choice" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на бесплатный подбор гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить вопрос</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>
<div class="hidden">
    <div class="priem_form center" id="free_consultation">
        <div>
            <h3>Нужна консультация</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_consultation" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на консультацию у гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут и уточним детали</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>
<div class="hidden">
    <div class="priem_form center" id="new_theme">
        <div>
            <h3>Новый отзыв</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_new_theme" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Новый отзыв" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="theme" placeholder="Тема вашего сообщения *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="">
                            <textarea class="b_input required" placeholder="Опишите свой опыт, задайте вопрос *" name="message" data-type="unknown"></textarea>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Ваше имя *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>
<div class="hidden">
    <div class="main-form" id="popup_form">
        <h4>Получить бесплатную консультацию специалиста</h4>
        <form method="post" action="assets/template/php/submit.php" data-id="form_popup_form" class="sendLead">
            <input name="name" type="text" placeholder="Имя:" />
            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
            <textarea placeholder="Ваше сообщение:" name="message"></textarea>
            <input name="type" type="hidden" value="Заявка на бесплатную консультацию" />
            <input type="text" name="lastname" value="" />
            <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
            <button class="btn-all" type="submit">Отправить</button>
        </form>
    </div>
</div>



</body>
</html>',
    '_isForward' => false,
    '_sjscripts' => 
    array (
      0 => '<script type="text/javascript">TicketsConfig={"ctx":"web","jsUrl":"\\/assets\\/components\\/tickets\\/js\\/web\\/","cssUrl":"\\/assets\\/components\\/tickets\\/css\\/web\\/","actionUrl":"\\/assets\\/components\\/tickets\\/action.php","close_all_message":"\\u0437\\u0430\\u043a\\u0440\\u044b\\u0442\\u044c \\u0432\\u0441\\u0435","tpanel":0,"enable_editor":1}</script>',
      1 => '<script type="text/javascript">TicketsConfig.editor={ticket: {onTab: {keepDefault:false, replaceWith:"	"}
		,markupSet: [
			{name:"Bold", className: "btn-bold", key:"B", openWith:"<b>", closeWith:"</b>" }
			,{name:"Italic", className: "btn-italic", key:"I", openWith:"<i>", closeWith:"</i>"  }
			,{name:"Underline", className: "btn-underline", key:"U", openWith:"<u>", closeWith:"</u>" }
			,{name:"Stroke through", className: "btn-stroke", key:"S", openWith:"<s>", closeWith:"</s>" }
			,{separator:"---------------" }
			,{name:"Bulleted List", className: "btn-bulleted", openWith:"	<li>", closeWith:"</li>", multiline:true, openBlockWith:"<ul>\\n", closeBlockWith:"\\n</ul>"}
			,{name:"Numeric List", className: "btn-numeric", openWith:"	<li>", closeWith:"</li>", multiline:true, openBlockWith:"<ol>\\n", closeBlockWith:"\\n</ol>"}
			,{separator:"---------------" }
			,{name:"Quote", className: "btn-quote", openWith:"<blockquote>", closeWith:"</blockquote>"}
			,{name:"Code", className: "btn-code", openWith:"<code>", closeWith:"</code>"}
			,{name:"Link", className: "btn-link", openWith:"<a href=\\"[![Link:!:http://]!]\\">", closeWith:"</a>" }
			,{name:"Picture", className: "btn-picture", replaceWith:"<img src=\\"[![Source:!:http://]!]\\" />" }
			,{separator:"---------------" }
			,{name:"Cut", className: "btn-cut", openWith:"<cut/>" }
		]},comment: {onTab: {keepDefault:false, replaceWith:"	"}
		,markupSet: [
			{name:"Bold", className: "btn-bold", key:"B", openWith:"<b>", closeWith:"</b>" }
			,{name:"Italic", className: "btn-italic", key:"I", openWith:"<i>", closeWith:"</i>"  }
			,{name:"Underline", className: "btn-underline", key:"U", openWith:"<u>", closeWith:"</u>" }
			,{name:"Stroke through", className: "btn-stroke", key:"S", openWith:"<s>", closeWith:"</s>" }
			,{separator:"---------------" }
			,{name:"Quote", className: "btn-quote", openWith:"<blockquote>", closeWith:"</blockquote>"}
			,{name:"Code", className: "btn-code", openWith:"<code>", closeWith:"</code>"}
			,{name:"Link", className: "btn-link", openWith:"<a href=\\"[![Link:!:http://]!]\\">", closeWith:"</a>" }
			,{name:"Picture", className: "btn-picture", replaceWith:"<img src=\\"[![Source:!:http://]!]\\" />" }
		]}}</script>',
      2 => '<link rel="stylesheet" href="/assets/components/tickets/js/web/editor/editor.css" type="text/css" />',
      3 => '<link rel="stylesheet" href="/assets/components/tickets/css/web/default.css" type="text/css" />',
    ),
    '_jscripts' => 
    array (
      0 => '<script type="text/javascript" src="/assets/components/tickets/js/web/editor/jquery.markitup.js"></script>',
      1 => '<script type="text/javascript" src="assets/template/js/tickets_custom.js"></script>',
    ),
    '_loadedjscripts' => 
    array (
      '<script type="text/javascript">TicketsConfig={"ctx":"web","jsUrl":"\\/assets\\/components\\/tickets\\/js\\/web\\/","cssUrl":"\\/assets\\/components\\/tickets\\/css\\/web\\/","actionUrl":"\\/assets\\/components\\/tickets\\/action.php","close_all_message":"\\u0437\\u0430\\u043a\\u0440\\u044b\\u0442\\u044c \\u0432\\u0441\\u0435","tpanel":0,"enable_editor":1}</script>' => true,
      '<script type="text/javascript">TicketsConfig.editor={ticket: {onTab: {keepDefault:false, replaceWith:"	"}
		,markupSet: [
			{name:"Bold", className: "btn-bold", key:"B", openWith:"<b>", closeWith:"</b>" }
			,{name:"Italic", className: "btn-italic", key:"I", openWith:"<i>", closeWith:"</i>"  }
			,{name:"Underline", className: "btn-underline", key:"U", openWith:"<u>", closeWith:"</u>" }
			,{name:"Stroke through", className: "btn-stroke", key:"S", openWith:"<s>", closeWith:"</s>" }
			,{separator:"---------------" }
			,{name:"Bulleted List", className: "btn-bulleted", openWith:"	<li>", closeWith:"</li>", multiline:true, openBlockWith:"<ul>\\n", closeBlockWith:"\\n</ul>"}
			,{name:"Numeric List", className: "btn-numeric", openWith:"	<li>", closeWith:"</li>", multiline:true, openBlockWith:"<ol>\\n", closeBlockWith:"\\n</ol>"}
			,{separator:"---------------" }
			,{name:"Quote", className: "btn-quote", openWith:"<blockquote>", closeWith:"</blockquote>"}
			,{name:"Code", className: "btn-code", openWith:"<code>", closeWith:"</code>"}
			,{name:"Link", className: "btn-link", openWith:"<a href=\\"[![Link:!:http://]!]\\">", closeWith:"</a>" }
			,{name:"Picture", className: "btn-picture", replaceWith:"<img src=\\"[![Source:!:http://]!]\\" />" }
			,{separator:"---------------" }
			,{name:"Cut", className: "btn-cut", openWith:"<cut/>" }
		]},comment: {onTab: {keepDefault:false, replaceWith:"	"}
		,markupSet: [
			{name:"Bold", className: "btn-bold", key:"B", openWith:"<b>", closeWith:"</b>" }
			,{name:"Italic", className: "btn-italic", key:"I", openWith:"<i>", closeWith:"</i>"  }
			,{name:"Underline", className: "btn-underline", key:"U", openWith:"<u>", closeWith:"</u>" }
			,{name:"Stroke through", className: "btn-stroke", key:"S", openWith:"<s>", closeWith:"</s>" }
			,{separator:"---------------" }
			,{name:"Quote", className: "btn-quote", openWith:"<blockquote>", closeWith:"</blockquote>"}
			,{name:"Code", className: "btn-code", openWith:"<code>", closeWith:"</code>"}
			,{name:"Link", className: "btn-link", openWith:"<a href=\\"[![Link:!:http://]!]\\">", closeWith:"</a>" }
			,{name:"Picture", className: "btn-picture", replaceWith:"<img src=\\"[![Source:!:http://]!]\\" />" }
		]}}</script>' => true,
      '/assets/components/tickets/js/web/editor/jquery.markitup.js' => true,
      '/assets/components/tickets/js/web/editor/editor.css' => true,
      '/assets/components/tickets/css/web/default.css' => true,
      'assets/template/js/tickets_custom.js' => true,
    ),
  ),
  'contentType' => 
  array (
    'id' => 1,
    'name' => 'HTML',
    'description' => 'HTML content',
    'mime_type' => 'text/html',
    'file_extensions' => '.html',
    'headers' => NULL,
    'binary' => 0,
  ),
  'policyCache' => 
  array (
  ),
  'elementCache' => 
  array (
    '[[$HEAD]]' => '[[!bannersInitialize]]
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="utf-8" />
    <title>Хорошие гинекологи и отзывы о них</title>
    <base href="https://otzivi-ginekolog.ru/" />
    <link href="/favicon.ico" rel="icon" type="image/x-icon" />
    <meta name="keywords" content="хороший врач гинеколог отзывы" />
    <meta name="description" content="Отзывы о враче гинекологе важны и в большей степени они указывают на расположенность пациентов. Отзывы помогают найти лучшего специалиста." />
    <meta name=\'yandex-verification\' content=\'75360eb96691232a\' />
    <meta name="yandex-verification" content="2caee598de1cfdef" />
    <meta name="yandex-verification" content="07abc805260318c1" />
	<meta name="google-site-verification" content="PHwVe-JRbCnOhttxe4IWIdt3ZpOLezqR-QpXcWCLGlk" />
	<meta name="google-site-verification" content="av6LHNns4n8A8X8ISgtMiQCHjaXLmgz8nD3audlK9c4" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    [[!CanonicalUrl]]


</head>',
    '[[$popup_reg]]' => '

<div class="login">
    <a class="fancybox" href="#popup_form">Получить бесплатную консультацию</a>
</div>
',
    '[[pdoMenu?
                        &level = `1`
                        &parents = `0`
                        &resources=`-270`
                        &where=`{"parent:IN": [0, 28]}`
                    ]]' => '<ul class=""><li class="first"><a href="blog.html" >Статьи</a></li><li><a href="video.html" >Видео</a></li><li class="active"><a href="otzyivyi.html" >Отзывы</a><ul class=""><li class="first"><a href="otzyivyi-pro-ginekologov-moskvyi.html" >Отзывы про гинекологов Москвы</a></li><li class="active"><a href="otzyivyi-o-xoroshix-ginekologax.html" >Отзывы о хороших гинекологах</a></li><li><a href="otzyivyi-o-vrachax-akusherax.html" >Отзывы о врачах акушерах</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-endokrinologax.html" >Отзывы о врачах гинекологах-эндокринологах</a></li><li><a href="otzyivyi-o-vrachax-ultrazvukovoj-diagnostiki.html" >Отзывы о врачах ультразвуковой диагностики</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-reproduktologax.html" >Отзывы о врачах гинекологах-репродуктологах</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-endoskopistax.html" >Отзывы о врачах гинекологах-эндоскопистах</a></li><li class="last"><a href="otzyivyi-o-vrachax-onkologax.html" >Отзывы о врачах онкологах</a></li></ul></li><li class="last"><a href="obratnaya-svyaz.html" >Обратная связь</a></li></ul>',
    '[[$HEADER]]' => '<div class="preloader">
    <style>
        .preloader {
            position: fixed;
            z-index: 10000;
            width: 100%;
            height: 100%;
            background: #fff;
            top: 0;
            left: 0;
            opacity: 1;
            visibility: visible;
            transition: opacity ease 0.8s, visibility ease 0.8s;
            
        }
    </style>
</div>
<header class="header">
    <div class="container">
        <div class="top">
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                <div class="row">
                    <div class="logo">
                        
                            <a href="/"><div class="logo-img"><img src="assets/template/images/otzivi-ginekologi-logo.png" alt="Фото: Отзывы о хороших гинекологах"></div></a>
                        
                    </div>
                </div>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-6 col-xs-12">
                <a class="fancybox free_choice_link free_choice_link_header btn_pg" href="#free_choice">Бесплатный подбор гинеколога</a>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                

<div class="login">
    <a class="fancybox" href="#popup_form">Получить бесплатную консультацию</a>
</div>

            </div>
        </div>
        <div class="col-xs-12">
            <div class="row">
                <nav class="menu-top">
                    <span><i class="fa fa-bars"></i></span>
                    <ul class=""><li class="first"><a href="blog.html" >Статьи</a></li><li><a href="video.html" >Видео</a></li><li class="active"><a href="otzyivyi.html" >Отзывы</a><ul class=""><li class="first"><a href="otzyivyi-pro-ginekologov-moskvyi.html" >Отзывы про гинекологов Москвы</a></li><li class="active"><a href="otzyivyi-o-xoroshix-ginekologax.html" >Отзывы о хороших гинекологах</a></li><li><a href="otzyivyi-o-vrachax-akusherax.html" >Отзывы о врачах акушерах</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-endokrinologax.html" >Отзывы о врачах гинекологах-эндокринологах</a></li><li><a href="otzyivyi-o-vrachax-ultrazvukovoj-diagnostiki.html" >Отзывы о врачах ультразвуковой диагностики</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-reproduktologax.html" >Отзывы о врачах гинекологах-репродуктологах</a></li><li><a href="otzyivyi-o-vrachax-ginekologax-endoskopistax.html" >Отзывы о врачах гинекологах-эндоскопистах</a></li><li class="last"><a href="otzyivyi-o-vrachax-onkologax.html" >Отзывы о врачах онкологах</a></li></ul></li><li class="last"><a href="obratnaya-svyaz.html" >Обратная связь</a></li></ul>
                </nav>
            </div>
        </div>
                
    </div>
</header><!-- .header-->',
    '[[$promo_flash_banner]]' => '<!--<div class="flash_banner horizontal_main img" style="text-align:center;margin-bottom:20px;">
    <div class="horizontal" >
        <div id="banner_horizontal">
            <a href="http://altravita-ivf.ru" target="_blank"><img src="/assets/template/images/468x60.gif" alt="http://altravita-ivf.ru" width="468" height="60"/></a>
        </div>
    </div>
    <div class="vertical">
        <div id="banner_vertical">
            <a title="http://altravita-ivf.ru" href="http://altravita-ivf.ru"><img src="/assets/template/images/240x400.gif" alt="http://altravita-ivf.ru" width="240" height="400"/></a>
        </div>
    </div>
</div>

<script type="text/javascript">//<![CDATA[
   var flashvars = {};
   var params = {
                 wmode: "transparent",
                 quality: "high",
                 scale:"noscale",
                 menu:"none"
                };
   var attributes = {};
   
   swfobject.embedSWF("/assets/template/images/468x60.swf", "banner_horizontal", "468", "60", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);
   swfobject.embedSWF("/assets/template/images/240x400.swf", "banner_vertical", "240", "400", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);

           //]]>
</script> -->',
    '[[pdoCrumbs? 
    &outputSeparator=` / `
    &showHome=`1`
    &tplWrapper=`@INLINE <div class="breadcrumbs">[[+output]]</div>`
    &tpl=`@INLINE <a href="[[+link]]">[[+menutitle]]</a>`
    &tplCurrent=`@INLINE <span>[[+menutitle]]</span>`
]]' => '<div class="breadcrumbs"><a href="/">Главная</a> / <a href="otzyivyi.html">Отзывы</a> / <span>Отзывы о хороших гинекологах</span></div>',
    '[[$BREADCRUMBS]]' => '<div class="breadcrumbs"><a href="/">Главная</a> / <a href="otzyivyi.html">Отзывы</a> / <span>Отзывы о хороших гинекологах</span></div>',
    '[[$review_form_choice]]' => '<div class="content-block">
    <div class="main-form">
    <h4>Нужна помощь в выборе гинеколога?</h4>
    <p>Оставьте телефон, мы перезвоним и бесплатно подберем гинеколога, имеющего опыт лечения именно вашей проблемы</p>
        <form id="main-form" method="post" action="assets/template/php/submit.php" data-id="review_form_choice" class="sendLead">
            <div class="row">
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input name="name" type="text" placeholder="Имя:" />
                </div>
                
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                </div>
                <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
                    <textarea placeholder="Ваше сообщение:" name="message"></textarea>
                    <input name="type" type="hidden" value="Бесплатная консультация специалиста" />
                    <input type="text" name="lastname" value="" />
                    <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                    <button class="btn-all" type="submit" form="main-form">Отправить</button>
                </div>
            </div>
        </form>
    </div>
</div>',
    '[[$banner_altravita_free_v]]' => '<div class="avb_240" data-alt="Отзывы о хороших гинекологах"></div>

',
    '[[getImageList?
                &docid = `6`
                &tvname = `videos`
                &tpl = `video_tpl`
                &limit = `1`
            ]]' => '<div class="item-video">
    <div class="lazyYT" data-youtube-id="4qGnkcJeVYk" data-ratio="16:9">Смотреть всем беременным! Главные мифы о родах. От врача акушера-гинеколога с 30-ти летним стажем.</div>
</div>',
    '[[$promo_video_main]]' => '<div class="sidebar-block">
    <h4><a href="video.html">Видео<i class="fa fa-plus-square"></i></a></h4>
    <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
        <div class="row">
            <div class="item-video">
    <div class="lazyYT" data-youtube-id="4qGnkcJeVYk" data-ratio="16:9">Смотреть всем беременным! Главные мифы о родах. От врача акушера-гинеколога с 30-ти летним стажем.</div>
</div>
        </div>
    </div>
</div>',
    '[[getTicketsSections?
                &parents = `28`
                &limit = `0`
                &tpl = `main_blog_tpl`
            ]]' => '<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-xoroshix-ginekologax.html">
        <h5>Отзывы о хороших гинекологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-pro-ginekologov-moskvyi.html">
        <h5>Отзывы про гинекологов Москвы</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-akusherax.html">
        <h5>Отзывы о врачах акушерах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-endokrinologax.html">
        <h5>Отзывы о врачах гинекологах-эндокринологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ultrazvukovoj-diagnostiki.html">
        <h5>Отзывы о врачах ультразвуковой диагностики</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-reproduktologax.html">
        <h5>Отзывы о врачах гинекологах-репродуктологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-endoskopistax.html">
        <h5>Отзывы о врачах гинекологах-эндоскопистах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-onkologax.html">
        <h5>Отзывы о врачах онкологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>',
    '[[pdoResources?
                &parents = `5`
                &limit = `5`
                &tpl = `main_blog_tpl`
            ]]' => '<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="vrach-akusher-ginekolog.html">
        <h5>Врач акушер гинеколог</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-xoroshij-li-ginekolog.html">
        <h5>Отзывы: хороший ли гинеколог</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="detskij-ginekolog-otzyivyi.html">
        <h5>Детский гинеколог: отзывы</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-ob-akusherax-ginekologax.html">
        <h5>Отзывы об акушерах гинекологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="konsultacziya-ginekologa-onlajn.html">
        <h5>Консультация гинеколога онлайн</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>',
    '[[$SIDEBAR]]' => '<aside class="left-sidebar">
    
    
    
    [[!*id:is=`1`:then=`
        [[!+show_banner_on_main:is=`1`:then=`<div class="avb_240" data-alt="Отзывы о хороших гинекологах"></div>

`]]
    `:else=`
        [[!+show_banner_on_article:is=`1`:then=`<div class="avb_240" data-alt="Отзывы о хороших гинекологах"></div>

`]]
    `]]
    
    
    <div class="sidebar-block">
    <h4><a href="video.html">Видео<i class="fa fa-plus-square"></i></a></h4>
    <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
        <div class="row">
            <div class="item-video">
    <div class="lazyYT" data-youtube-id="4qGnkcJeVYk" data-ratio="16:9">Смотреть всем беременным! Главные мифы о родах. От врача акушера-гинеколога с 30-ти летним стажем.</div>
</div>
        </div>
    </div>
</div>
    <div class="content-block">
        <h4><a href="blog.html">Разделы отзывов</a></h4>
        <div class="wrap-content-block">
            <article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-xoroshix-ginekologax.html">
        <h5>Отзывы о хороших гинекологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-pro-ginekologov-moskvyi.html">
        <h5>Отзывы про гинекологов Москвы</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-akusherax.html">
        <h5>Отзывы о врачах акушерах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-endokrinologax.html">
        <h5>Отзывы о врачах гинекологах-эндокринологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ultrazvukovoj-diagnostiki.html">
        <h5>Отзывы о врачах ультразвуковой диагностики</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-reproduktologax.html">
        <h5>Отзывы о врачах гинекологах-репродуктологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-ginekologax-endoskopistax.html">
        <h5>Отзывы о врачах гинекологах-эндоскопистах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-o-vrachax-onkologax.html">
        <h5>Отзывы о врачах онкологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
        </div>

        <h4 id="blog_h4"><a href="blog.html">Последние в блоге</a></h4>
        <div class="wrap-content-block">
            <article class="main-blog" style="    margin-bottom: 15px;">
    <a href="vrach-akusher-ginekolog.html">
        <h5>Врач акушер гинеколог</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-xoroshij-li-ginekolog.html">
        <h5>Отзывы: хороший ли гинеколог</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="detskij-ginekolog-otzyivyi.html">
        <h5>Детский гинеколог: отзывы</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="otzyivyi-ob-akusherax-ginekologax.html">
        <h5>Отзывы об акушерах гинекологах</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
<article class="main-blog" style="    margin-bottom: 15px;">
    <a href="konsultacziya-ginekologa-onlajn.html">
        <h5>Консультация гинеколога онлайн</h5>
        <span class="main-blog-readmore">Подробнее...</span>
    </a>
</article>
        </div>
    </div>
</aside><!-- .left-sidebar -->',
    '[[pdoMenu?
                                &parents = `0`
                                &level = `1`
                            ]]' => '<ul class=""><li class="first"><a href="blog.html" >Статьи</a></li><li><a href="video.html" >Видео</a></li><li class="active"><a href="otzyivyi.html" >Отзывы</a></li><li><a href="obratnaya-svyaz.html" >Обратная связь</a></li><li class="last"><a href="polzovatelskoe-soglashenie.html" >Пользовательское соглашение</a></li></ul>',
    '[[MinifyX? 
        &cssSources=`
            assets/template/css/bootstrap.css,
            assets/template/css/font-awesome.css,
            assets/template/css/lazyYT.css,
            assets/template/fonts/OpenSans.css,
            assets/template/js/owlcarousel/assets/owl.carousel.css,
            assets/template/js/fancybox/jquery.fancybox.css,
            assets/template/css/other-style.css,
            assets/template/auth/register.css,
            assets/banners_altravita_new/style.css,
            assets/template/css/style.css,
            assets/template/css/reviews_css.css,
            assets/components/tickets/css/web/lib/jquery.jgrowl.css
        ` 
        &jsSources=`
            assets/template/js/jquery-1.11.1.min.js,
            assets/template/js/fancybox/jquery.fancybox.js,
            assets/template/js/lazyload.min.js,
            assets/template/js/lazyYT.js,
            assets/template/js/owlcarousel/owl.carousel.js,
            assets/template/js/form.js,
            assets/template/auth/authorization.js,
            assets/template/js/script.js,
            assets/template/js/reviews_js.js
        ` 
        &minifyJs=`1` 
        &minifyCss=`1`
    ]]' => '',
    '[[$review_form_popup_choice]]' => '<div class="hidden">
    <div class="priem_form center" id="free_choice">
        <div>
            <h3>Бесплатный подбор<br/>гинеколога</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_choice" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на бесплатный подбор гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить вопрос</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
    '[[$review_form_popup_consultation]]' => '<div class="hidden">
    <div class="priem_form center" id="free_consultation">
        <div>
            <h3>Нужна консультация</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_consultation" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на консультацию у гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут и уточним детали</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
    '[[$review_form_popup_new_theme]]' => '<div class="hidden">
    <div class="priem_form center" id="new_theme">
        <div>
            <h3>Новый отзыв</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_new_theme" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Новый отзыв" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="theme" placeholder="Тема вашего сообщения *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="">
                            <textarea class="b_input required" placeholder="Опишите свой опыт, задайте вопрос *" name="message" data-type="unknown"></textarea>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Ваше имя *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
    '[[$form_popup_form]]' => '<div class="hidden">
    <div class="main-form" id="popup_form">
        <h4>Получить бесплатную консультацию специалиста</h4>
        <form method="post" action="assets/template/php/submit.php" data-id="form_popup_form" class="sendLead">
            <input name="name" type="text" placeholder="Имя:" />
            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
            <textarea placeholder="Ваше сообщение:" name="message"></textarea>
            <input name="type" type="hidden" value="Заявка на бесплатную консультацию" />
            <input type="text" name="lastname" value="" />
            <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
            <button class="btn-all" type="submit">Отправить</button>
        </form>
    </div>
</div>',
    '[[$FOOTER]]' => '<footer class="footer">
    <div class="container">
        <div class="row">
            <div class="wrap-footer clearfix">
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12">
                    <div class="row">
                        <nav class="menu-footer">
                            <ul class=""><li class="first"><a href="blog.html" >Статьи</a></li><li><a href="video.html" >Видео</a></li><li class="active"><a href="otzyivyi.html" >Отзывы</a></li><li><a href="obratnaya-svyaz.html" >Обратная связь</a></li><li class="last"><a href="polzovatelskoe-soglashenie.html" >Пользовательское соглашение</a></li></ul>
                        </nav>
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4">
                    <div class="metriks-links">
                        <!-- Yandex.Metrika informer - -><a href="https://metrika.yandex.ru/stat/?id=32824167&amp;from=informer" target="_blank" rel="nofollow"><img src="https://informer.yandex.ru/informer/32824167/3_1_FFFFFFFF_EFEFEFFF_0_pageviews" style="width:88px; height:31px; border:0;" alt="Яндекс.Метрика" title="Яндекс.Метрика: данные за сегодня (просмотры, визиты и уникальные посетители)" onclick="try{Ya.Metrika.informer({i:this,id:32824167,lang:\'ru\'});return false}catch(e){}" /></a><!-- /Yandex.Metrika informer --><!-- Yandex.Metrika counter --><script type="text/javascript">    (function (d, w, c) {        (w[c] = w[c] || []).push(function() {            try {                w.yaCounter32824167 = new Ya.Metrika({                    id:32824167,                    clickmap:true,                    trackLinks:true,                    accurateTrackBounce:true,                    webvisor:true                });            } catch(e) { }        });        var n = d.getElementsByTagName("script")[0],            s = d.createElement("script"),            f = function () { n.parentNode.insertBefore(s, n); };        s.type = "text/javascript";        s.async = true;        s.src = "https://mc.yandex.ru/metrika/watch.js";        if (w.opera == "[object Opera]") {            d.addEventListener("DOMContentLoaded", f, false);        } else { f(); }    })(document, window, "yandex_metrika_callbacks");</script><noscript><div><img src="https://mc.yandex.ru/watch/32824167" style="position:absolute; left:-9999px;" alt="" /></div></noscript><!-- /Yandex.Metrika counter -->
                        <script>
  (function(i,s,o,g,r,a,m){i[\'GoogleAnalyticsObject\']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,\'script\',\'//www.google-analytics.com/analytics.js\',\'ga\');

  ga(\'create\', \'UA-68331533-24\', \'auto\');
  ga(\'send\', \'pageview\');

</script>
                        <!--LiveInternet counter--><script type="text/javascript"><!--
document.write("<a href=\'//www.liveinternet.ru/click\' "+
"target=_blank><img src=\'//counter.yadro.ru/hit?t13.6;r"+
escape(document.referrer)+((typeof(screen)=="undefined")?"":
";s"+screen.width+"*"+screen.height+"*"+(screen.colorDepth?
screen.colorDepth:screen.pixelDepth))+";u"+escape(document.URL)+
";"+Math.random()+
"\' alt=\'\' title=\'LiveInternet: показано число просмотров за 24"+
" часа, посетителей за 24 часа и за сегодня\' "+
"border=\'0\' width=\'88\' height=\'31\'><\\/a>")
//--></script><!--/LiveInternet-->
                        <!-- begin of Top100 code --><script id="top100Counter" type="text/javascript" src="https://counter.rambler.ru/top100.jcn?3136113"></script><noscript><a href="https://top100.rambler.ru/navi/3136113/"><img src="https://counter.rambler.ru/top100.cnt?3136113" alt="Rambler\'s Top100" border="0" /></a></noscript><!-- end of Top100 code -->
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12 pull-right">
                    <div class="row">
                        <div class="copy">
                            <span>Все права защищены, 2019 &copy; Отзывы про врачей гинекологов</span>
                        </div>
                    </div>
                </div>
                <div class="col-xs-12">
                    <a href="obratnaya-svyaz.html" class="btn_blue_variant  btn-all button-wide button-wide_footer ">Задать вопрос</a>
                </div>
            </div>
        </div>
    </div>
</footer><!-- .footer -->
<a href="#" class="scrollup">Наверх</a>
<style>
    .preloader {
        opacity: 0;
        visibility: hidden;
    }
</style>


    
    <link rel="stylesheet" href="/assets/components/minifyx/cache/styles_263a873631.min.css" type="text/css" />
    

<script type="text/javascript" src="/assets/components/minifyx/cache/scripts_e57501fd6c.min.js"></script>
<div class="hidden">
    <div id="success">
      <h2>
      Ваша заявка принята!
      <br>
      Мы скоро с Вами свяжемся.
      </h2>
    </div>
    <div id="loading">
      <div id="load"></div>
    </div>
</div>
<div class="hidden">
    <div class="priem_form center" id="free_choice">
        <div>
            <h3>Бесплатный подбор<br/>гинеколога</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_choice" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на бесплатный подбор гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить вопрос</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>
<div class="hidden">
    <div class="priem_form center" id="free_consultation">
        <div>
            <h3>Нужна консультация</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_consultation" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на консультацию у гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут и уточним детали</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>
<div class="hidden">
    <div class="priem_form center" id="new_theme">
        <div>
            <h3>Новый отзыв</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_new_theme" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Новый отзыв" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="theme" placeholder="Тема вашего сообщения *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="">
                            <textarea class="b_input required" placeholder="Опишите свой опыт, задайте вопрос *" name="message" data-type="unknown"></textarea>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Ваше имя *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>
<div class="hidden">
    <div class="main-form" id="popup_form">
        <h4>Получить бесплатную консультацию специалиста</h4>
        <form method="post" action="assets/template/php/submit.php" data-id="form_popup_form" class="sendLead">
            <input name="name" type="text" placeholder="Имя:" />
            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
            <textarea placeholder="Ваше сообщение:" name="message"></textarea>
            <input name="type" type="hidden" value="Заявка на бесплатную консультацию" />
            <input type="text" name="lastname" value="" />
            <span class="form_confid">Нажимая на кнопку, вы <a href="/polzovatelskoe-soglashenie.html" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
            <button class="btn-all" type="submit">Отправить</button>
        </form>
    </div>
</div>

',
    '[[getTickets?tpl=`ticket_item_new`&limit=`12`&offset=`0`&depth=`10`&parents=``&resources=``&sortby=`createdon`&sortdir=`DESC`&includeContent=`1`&toPlaceholder=``&includeTVs=`is_published,publishdate,publishon`&where=``&tvPrefix=``&outputSeparator=`
`&showLog=``&fastMode=``&showUnpublished=`1`&showDeleted=``&showHidden=`1`&user=``&tplWrapper=``&plPrefix=``&maxLimit=`100`&page=`1`&pageVarKey=`page`&totalVar=`page.total`&pageLimit=`5`&element=`getTickets`&pageNavVar=`page.nav`&pageCountVar=`pageCount`&pageLinkScheme=``&tplPage=`@INLINE <li><a href="[[+href]]">[[+pageNo]]</a></li>`&tplPageWrapper=`@INLINE <div class="pagination"><ul class="pagination">[[+first]][[+prev]][[+pages]][[+next]][[+last]]</ul></div>`&tplPageActive=`@INLINE <li class="active"><a href="[[+href]]">[[+pageNo]]</a></li>`&tplPageFirst=`@INLINE <li class="control"><a href="[[+href]]">[[%pdopage_first]]</a></li>`&tplPageLast=`@INLINE <li class="control"><a href="[[+href]]">[[%pdopage_last]]</a></li>`&tplPagePrev=`@INLINE <li class="control"><a href="[[+href]]">&laquo;</a></li>`&tplPageNext=`@INLINE <li class="control"><a href="[[+href]]">&raquo;</a></li>`&tplPageSkip=`@INLINE <li class="disabled"><span>...</span></li>`&tplPageFirstEmpty=`@INLINE <li class="disabled"><span>[[%pdopage_first]]</span></li>`&tplPageLastEmpty=`@INLINE <li class="disabled"><span>[[%pdopage_last]]</span></li>`&tplPagePrevEmpty=`@INLINE <li class="disabled"><span>&laquo;</span></li>`&tplPageNextEmpty=`@INLINE <li class="disabled"><span>&raquo;</span></li>`&cache=``&cacheTime=`3600`&cacheAnonymous=``&ajax=``&ajaxMode=``&ajaxElemWrapper=`#pdopage`&ajaxElemRows=`#pdopage .rows`&ajaxElemPagination=`#pdopage .pagination`&ajaxElemLink=`#pdopage .pagination a`&ajaxElemMore=`#pdopage .btn-more`&ajaxTplMore=`@INLINE <button class="btn btn-default btn-more">[[%pdopage_more]]</button>`&ajaxHistory=``&setMeta=`1`&strictMode=`1`&tvFilters=`is_published==1`&sortbyTV=`publishon`&sortdirTV=`DESC`&request=`32de60a8dd3c9e7c7721b9ed147a7906`]]' => '<div class="review-block" id="ticket-1130" data-id="1130">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Ульяна</span>
			<span class="ticket-comment-createdon">26 мая 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			С клиникой Я Здорова знакома не первый год, впервые туда попала на УЗИ и с тех пор ей не изменюя, врачи хорошие, мед. персонал внимательный, уютное светлое помещение. Да что криить душой там я нашла своего замечательного гинеколога, но есть и серьезный минус, лабаратория клиники работает ужасно, постоянно задерживают получение результатов анализов, да и далеко не все исследования там можно сделать.
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1129" data-id="1129">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Алла</span>
			<span class="ticket-comment-createdon">24 мая 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			Забеременеть с мужем очень долго пытались, но что-то не получалось и решились на серьезные вещи. Обследования прошли и я, и супруг. На данный момент у меня уже упал АМГ до критического уровня. Обратились, в вашу клинику и врач сказал, что эко можно делать сразу. Теперь мы ждем первые результаты и надеемся, что скоро все будет хорошо
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1128" data-id="1128">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Ирина Ивановна</span>
			<span class="ticket-comment-createdon">26 апреля 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			С желанием завести ребенка нужно пройти всех враче, ведь мало ли что у вас там может быть, и не разочаровываться в процессе. Так у нас и получилось, что при попытках зачатия у нас не получалось прям ничего и позже врач сказал, что у нас бесплодие. С проблемой решили не мириться и все равно завести ребенка. Выбрали клинику я мама и теперь надеемся что сможем помочьн ам с нашими проблемами
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1127" data-id="1127">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Светлана</span>
			<span class="ticket-comment-createdon">24 марта 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			Обратилась в клинику АРТ-ЭКО по совету знакомой. Гинеколог оказался квалифицированный, внимательный, добрый врач. Была на приеме, доктор очень ответственно подошла к моей проблеме, получила ответы на все свои вопросы. Я полностью ей доверилась. И в конце моего лечения проблема была решена. Чего не могу сказать о других врачах, с которыми я общалась в этой клинике.
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1126" data-id="1126">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Кристина</span>
			<span class="ticket-comment-createdon">24 марта 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			Если возникают какие-то проблемы, решайте их сразу пожалуйста После простуды я решила, что у меня все хорошо и я прост полечусь своими средствами и все нормально будет. Спустя месяц у меня воспаление яичников и сейчас я занята тем, что ищу себе клинику которая смогла бы мне помочь с лечением этой вещи. Решила обратиться в клинику я здорова из-за неплохих отзывов. Надеюсь лечение пройдет нормально
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1124" data-id="1124">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Арина</span>
			<span class="ticket-comment-createdon">05 марта 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			Хочу вам рассказать, что есливы видите, что у вас проблемы решайте их как можно быстрее, прежде всего идите на сайты, на которых можно узнать рейтинг и все вот это вот врача, чтобы понимать к какому специалисту вы попадаете. Это может сэкономить много денег и времени, что в наше время стоит огромных вещей и нервов. Ндеемся на вас
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1125" data-id="1125">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Оля</span>
			<span class="ticket-comment-createdon">01 марта 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			Год назад обратилась в клинику МАМА к гинекологу с нерегулярными месячными да и получается что не могла высчитать овуляцию. Доктор меня выслушала и назначила лечение в основном это гомеопатия была и гормональные препараты. Со временем цикл наладился, и я смогла без проблем забеременеть. Теперь я только своему гинекологу доверяю. Доктором я довольна. Клиника светлая и приятно в ней находиться, не чувствуется давления что находишься в медучреждении. Иногда сталкиваюсь с очередями, но это не то чтобы сильная проблема.
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1123" data-id="1123">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Виолетта</span>
			<span class="ticket-comment-createdon">04 февраля 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			В клинику Я Здорова попала буквально случайно, нужно было срочно пройти короткое обследование, так как были некоторые проблемы которые очень тревожили. Врач немного создает вид отстраненного человека, особо не заинтересованна в общение с врачом.
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1122" data-id="1122">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Кира и Алексей</span>
			<span class="ticket-comment-createdon">27 января 2019г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			С мужем пытаемся забеременеть уже порядочный срок, но никак не получается Обследования прошли и я, и супруг. На данный момент у меня уже упал АМГ до критического уровня. Обратились, в вашу клинику и врач сказал, что эко можно делать сразу. Теперь осталось дождаться срока и будем надеяться на первую попытку!
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1007" data-id="1007">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Майя</span>
			<span class="ticket-comment-createdon">29 декабря 2018г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			В последнее время мучилась из-за неприятных ощущений во влагалище. Был зуд, жжение и странные выделения. Испугавшись, стала искать хорошего гинеколога, чтобы получить необходимое лечение. Решила, по совету подружки, обратиться в клинику АльтраВита. Слава Богу, что никаких серьезных болячек у меня не нашли. Врач попалась отличная, помогла мне быстро справиться с проблемой.
		</div>
	</div>
</div>
<div class="review-block" id="ticket-1020" data-id="1020">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Арина</span>
			<span class="ticket-comment-createdon">26 декабря 2018г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			Так случилась, что заболела и пришлось искать нормального врача . В государственную клинику идти не захотела. Хотелось найти нормального специалиста гинеколога эндоскописта. Вот его то я и нашла в интернете и на сайте альтравита отзывы нашла именно то, что мине надо. Врач - профессионал. Клиника оборудована по последним медицинским технологиям. Всем довольна, особенно результатом лечения!
		</div>
	</div>
</div>
<div class="review-block" id="ticket-997" data-id="997">
	<div class="ticket-comment-body[[+guest]][[+bad]]">
		<div class="ticket-comment-header">
			<span class="ticket-comment-author">Оля</span>
			<span class="ticket-comment-createdon">16 декабря 2018г.</span>[[+comment_was_edited]]
		</div>
		<div class="ticket-comment-text review-body">
			Вообще-то мы с мужем планировали найти хорошую суррогатную мать, чтобы мне не пришлось ложиться в клинику и делать ЭКО. Но выбранная нами девушка в последний момент передумала и мы ничего не смогли с этим поделать. Надо бы лучше составлять контракт. После этой неудачи я смирилась с мыслью об ЭКО и мы с мужем обратились в клинику Альтравита, которую нам порекомендовали друзья. Там работают чудесные специалисты, как оказалось!)
		</div>
	</div>
</div>',
  ),
  'sourceCache' => 
  array (
    'modChunk' => 
    array (
      'HEAD' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'HEAD',
          'description' => '',
          'editor_type' => 0,
          'category' => 3,
          'cache_type' => 0,
          'snippet' => '[[!bannersInitialize]]
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="utf-8" />
    <title>[[*meta_title:default=`[[*pagetitle]]`]]</title>
    <base href="[[++site_url]]" />
    <link href="/favicon.ico" rel="icon" type="image/x-icon" />
    <meta name="keywords" content="[[*meta_keywords]]" />
    <meta name="description" content="[[*meta_description]]" />
    <meta name=\'yandex-verification\' content=\'[[++yandex_webmaster]]\' />
    <meta name="yandex-verification" content="2caee598de1cfdef" />
    <meta name="yandex-verification" content="07abc805260318c1" />
	<meta name="google-site-verification" content="[[++google_webmaster]]" />
	<meta name="google-site-verification" content="av6LHNns4n8A8X8ISgtMiQCHjaXLmgz8nD3audlK9c4" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    [[!CanonicalUrl]]


</head>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '[[!bannersInitialize]]
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="utf-8" />
    <title>[[*meta_title:default=`[[*pagetitle]]`]]</title>
    <base href="[[++site_url]]" />
    <link href="/favicon.ico" rel="icon" type="image/x-icon" />
    <meta name="keywords" content="[[*meta_keywords]]" />
    <meta name="description" content="[[*meta_description]]" />
    <meta name=\'yandex-verification\' content=\'[[++yandex_webmaster]]\' />
    <meta name="yandex-verification" content="2caee598de1cfdef" />
    <meta name="yandex-verification" content="07abc805260318c1" />
	<meta name="google-site-verification" content="[[++google_webmaster]]" />
	<meta name="google-site-verification" content="av6LHNns4n8A8X8ISgtMiQCHjaXLmgz8nD3audlK9c4" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    [[!CanonicalUrl]]


</head>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'HEADER' => 
      array (
        'fields' => 
        array (
          'id' => 102,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'HEADER',
          'description' => '',
          'editor_type' => 0,
          'category' => 3,
          'cache_type' => 0,
          'snippet' => '<div class="preloader">
    <style>
        .preloader {
            position: fixed;
            z-index: 10000;
            width: 100%;
            height: 100%;
            background: #fff;
            top: 0;
            left: 0;
            opacity: 1;
            visibility: visible;
            transition: opacity ease 0.8s, visibility ease 0.8s;
            
        }
    </style>
</div>
<header class="header">
    <div class="container">
        <div class="top">
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                <div class="row">
                    <div class="logo">
                        [[*id:is=`[[++site_start]]`:then=`
                            <div class="logo-img"><img src="assets/template/images/otzivi-ginekologi-logo.png" alt="Фото: [[*longtitle:default=`[[*pagetitle]]`]]"></div>
                        `:else=`
                            <a href="/"><div class="logo-img"><img src="assets/template/images/otzivi-ginekologi-logo.png" alt="Фото: [[*longtitle:default=`[[*pagetitle]]`]]"></div></a>
                        `]]
                    </div>
                </div>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-6 col-xs-12">
                <a class="fancybox free_choice_link free_choice_link_header btn_pg" href="#free_choice">Бесплатный подбор гинеколога</a>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                [[$popup_reg]]
            </div>
        </div>
        <div class="col-xs-12">
            <div class="row">
                <nav class="menu-top">
                    <span><i class="fa fa-bars"></i></span>
                    [[pdoMenu?
                        &level = `1`
                        &parents = `0`
                        &resources=`-270`
                        &where=`{"parent:IN": [0, 28]}`
                    ]]
                </nav>
            </div>
        </div>
                
    </div>
</header><!-- .header-->',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="preloader">
    <style>
        .preloader {
            position: fixed;
            z-index: 10000;
            width: 100%;
            height: 100%;
            background: #fff;
            top: 0;
            left: 0;
            opacity: 1;
            visibility: visible;
            transition: opacity ease 0.8s, visibility ease 0.8s;
            
        }
    </style>
</div>
<header class="header">
    <div class="container">
        <div class="top">
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                <div class="row">
                    <div class="logo">
                        [[*id:is=`[[++site_start]]`:then=`
                            <div class="logo-img"><img src="assets/template/images/otzivi-ginekologi-logo.png" alt="Фото: [[*longtitle:default=`[[*pagetitle]]`]]"></div>
                        `:else=`
                            <a href="/"><div class="logo-img"><img src="assets/template/images/otzivi-ginekologi-logo.png" alt="Фото: [[*longtitle:default=`[[*pagetitle]]`]]"></div></a>
                        `]]
                    </div>
                </div>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-6 col-xs-12">
                <a class="fancybox free_choice_link free_choice_link_header btn_pg" href="#free_choice">Бесплатный подбор гинеколога</a>
            </div>
            <div class="col-lg-4 col-md-4 col-sm-3 col-xs-12">
                [[$popup_reg]]
            </div>
        </div>
        <div class="col-xs-12">
            <div class="row">
                <nav class="menu-top">
                    <span><i class="fa fa-bars"></i></span>
                    [[pdoMenu?
                        &level = `1`
                        &parents = `0`
                        &resources=`-270`
                        &where=`{"parent:IN": [0, 28]}`
                    ]]
                </nav>
            </div>
        </div>
                
    </div>
</header><!-- .header-->',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'popup_reg' => 
      array (
        'fields' => 
        array (
          'id' => 88,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'popup_reg',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'cache_type' => 0,
          'snippet' => '[[-!+modx.user.id:is=`0`:then=`
    <div class="login">
        <div class="user-icon"><i class="fa fa-user"></i></div>
        <a class="auth-fancybox" data-tab="1" href="#popup_reg">Вход</a>
        <a class="auth-fancybox" data-tab="2" href="#popup_reg">Регистрация</a>
    </div>
    [[-!officeAuth?
        &tplLogin=`tpl.Office.auth.reg.custom`
        &groups=`Users`
        &loginResourceId=`1`
        &HybridAuth=`1`
        &providers=`Odnoklassniki,Twitter,Facebook,Vkontakte`
    ]]
`:else=`
    [[-!officeProfile?
        tplProfile=`tpl.Office.profile.form.popup`
    ]]
`]]

<div class="login">
    <a class="fancybox" href="#popup_form">Получить бесплатную консультацию</a>
</div>
',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '[[-!+modx.user.id:is=`0`:then=`
    <div class="login">
        <div class="user-icon"><i class="fa fa-user"></i></div>
        <a class="auth-fancybox" data-tab="1" href="#popup_reg">Вход</a>
        <a class="auth-fancybox" data-tab="2" href="#popup_reg">Регистрация</a>
    </div>
    [[-!officeAuth?
        &tplLogin=`tpl.Office.auth.reg.custom`
        &groups=`Users`
        &loginResourceId=`1`
        &HybridAuth=`1`
        &providers=`Odnoklassniki,Twitter,Facebook,Vkontakte`
    ]]
`:else=`
    [[-!officeProfile?
        tplProfile=`tpl.Office.profile.form.popup`
    ]]
`]]

<div class="login">
    <a class="fancybox" href="#popup_form">Получить бесплатную консультацию</a>
</div>
',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'promo_flash_banner' => 
      array (
        'fields' => 
        array (
          'id' => 71,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'promo_flash_banner',
          'description' => '',
          'editor_type' => 0,
          'category' => 4,
          'cache_type' => 0,
          'snippet' => '<!--<div class="flash_banner [[+type]] img" style="text-align:center;margin-bottom:20px;">
    <div class="horizontal" >
        <div id="banner_horizontal">
            <a href="http://altravita-ivf.ru" target="_blank"><img src="/assets/template/images/468x60.gif" alt="http://altravita-ivf.ru" width="468" height="60"/></a>
        </div>
    </div>
    <div class="vertical">
        <div id="banner_vertical">
            <a title="http://altravita-ivf.ru" href="http://altravita-ivf.ru"><img src="/assets/template/images/240x400.gif" alt="http://altravita-ivf.ru" width="240" height="400"/></a>
        </div>
    </div>
</div>

<script type="text/javascript">//<![CDATA[
   var flashvars = {};
   var params = {
                 wmode: "transparent",
                 quality: "high",
                 scale:"noscale",
                 menu:"none"
                };
   var attributes = {};
   
   swfobject.embedSWF("/assets/template/images/468x60.swf", "banner_horizontal", "468", "60", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);
   swfobject.embedSWF("/assets/template/images/240x400.swf", "banner_vertical", "240", "400", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);

           //]]>
</script> -->',
          'locked' => false,
          'properties' => 
          array (
            'type' => 
            array (
              'name' => 'type',
              'desc' => '',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'horizontal_main',
              'lexicon' => NULL,
              'area' => '',
              'desc_trans' => '',
              'area_trans' => '',
            ),
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<!--<div class="flash_banner [[+type]] img" style="text-align:center;margin-bottom:20px;">
    <div class="horizontal" >
        <div id="banner_horizontal">
            <a href="http://altravita-ivf.ru" target="_blank"><img src="/assets/template/images/468x60.gif" alt="http://altravita-ivf.ru" width="468" height="60"/></a>
        </div>
    </div>
    <div class="vertical">
        <div id="banner_vertical">
            <a title="http://altravita-ivf.ru" href="http://altravita-ivf.ru"><img src="/assets/template/images/240x400.gif" alt="http://altravita-ivf.ru" width="240" height="400"/></a>
        </div>
    </div>
</div>

<script type="text/javascript">//<![CDATA[
   var flashvars = {};
   var params = {
                 wmode: "transparent",
                 quality: "high",
                 scale:"noscale",
                 menu:"none"
                };
   var attributes = {};
   
   swfobject.embedSWF("/assets/template/images/468x60.swf", "banner_horizontal", "468", "60", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);
   swfobject.embedSWF("/assets/template/images/240x400.swf", "banner_vertical", "240", "400", "9.0.0", 
   "/template/expressInstall.swf", flashvars, params, attributes);

           //]]>
</script> -->',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'BREADCRUMBS' => 
      array (
        'fields' => 
        array (
          'id' => 36,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'BREADCRUMBS',
          'description' => '',
          'editor_type' => 0,
          'category' => 3,
          'cache_type' => 0,
          'snippet' => '[[pdoCrumbs? 
    &outputSeparator=` / `
    &showHome=`1`
    &tplWrapper=`@INLINE <div class="breadcrumbs">[[+output]]</div>`
    &tpl=`@INLINE <a href="[[+link]]">[[+menutitle]]</a>`
    &tplCurrent=`@INLINE <span>[[+menutitle]]</span>`
]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '[[pdoCrumbs? 
    &outputSeparator=` / `
    &showHome=`1`
    &tplWrapper=`@INLINE <div class="breadcrumbs">[[+output]]</div>`
    &tpl=`@INLINE <a href="[[+link]]">[[+menutitle]]</a>`
    &tplCurrent=`@INLINE <span>[[+menutitle]]</span>`
]]',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'review_form_choice' => 
      array (
        'fields' => 
        array (
          'id' => 106,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'review_form_choice',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'cache_type' => 0,
          'snippet' => '<div class="content-block">
    <div class="main-form">
    <h4>Нужна помощь в выборе гинеколога?</h4>
    <p>Оставьте телефон, мы перезвоним и бесплатно подберем гинеколога, имеющего опыт лечения именно вашей проблемы</p>
        <form id="main-form" method="post" action="assets/template/php/submit.php" data-id="review_form_choice" class="sendLead">
            <div class="row">
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input name="name" type="text" placeholder="Имя:" />
                </div>
                
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                </div>
                <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
                    <textarea placeholder="Ваше сообщение:" name="message"></textarea>
                    <input name="type" type="hidden" value="Бесплатная консультация специалиста" />
                    <input type="text" name="lastname" value="" />
                    <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                    <button class="btn-all" type="submit" form="main-form">Отправить</button>
                </div>
            </div>
        </form>
    </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="content-block">
    <div class="main-form">
    <h4>Нужна помощь в выборе гинеколога?</h4>
    <p>Оставьте телефон, мы перезвоним и бесплатно подберем гинеколога, имеющего опыт лечения именно вашей проблемы</p>
        <form id="main-form" method="post" action="assets/template/php/submit.php" data-id="review_form_choice" class="sendLead">
            <div class="row">
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input name="name" type="text" placeholder="Имя:" />
                </div>
                
                <div class="col-lg-6 col-md-6 col-sm-12 col-xs-12">
                    <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                </div>
                <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
                    <textarea placeholder="Ваше сообщение:" name="message"></textarea>
                    <input name="type" type="hidden" value="Бесплатная консультация специалиста" />
                    <input type="text" name="lastname" value="" />
                    <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                    <button class="btn-all" type="submit" form="main-form">Отправить</button>
                </div>
            </div>
        </form>
    </div>
</div>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
      'SIDEBAR' => 
      array (
        'fields' => 
        array (
          'id' => 35,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'SIDEBAR',
          'description' => '',
          'editor_type' => 0,
          'category' => 3,
          'cache_type' => 0,
          'snippet' => '<aside class="left-sidebar">
    
    [[-!*id:is=`1`:then=`
        [[+show_banner_on_main:is=`1`:then=`[[$banner_altravita_240]]`]]
    `:else=`
        [[+show_banner_on_article:is=`1`:then=`[[$banner_altravita_240]]`]]
    `]]
    
    [[!*id:is=`1`:then=`
        [[!+show_banner_on_main:is=`1`:then=`[[$banner_altravita_free_v]]`]]
    `:else=`
        [[!+show_banner_on_article:is=`1`:then=`[[$banner_altravita_free_v]]`]]
    `]]
    
    [[-*id:is=`4`:then=``:else=`[[-$promo_gallery_main]]`]]
    [[*id:is=`6`:then=``:else=`[[$promo_video_main]]`]]
    <div class="content-block">
        <h4><a href="[[~5]]">Разделы отзывов</a></h4>
        <div class="wrap-content-block">
            [[getTicketsSections?
                &parents = `28`
                &limit = `0`
                &tpl = `main_blog_tpl`
            ]]
        </div>

        <h4 id="blog_h4"><a href="[[~5]]">Последние в блоге</a></h4>
        <div class="wrap-content-block">
            [[pdoResources?
                &parents = `5`
                &limit = `5`
                &tpl = `main_blog_tpl`
            ]]
        </div>
    </div>
</aside><!-- .left-sidebar -->',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<aside class="left-sidebar">
    
    [[-!*id:is=`1`:then=`
        [[+show_banner_on_main:is=`1`:then=`[[$banner_altravita_240]]`]]
    `:else=`
        [[+show_banner_on_article:is=`1`:then=`[[$banner_altravita_240]]`]]
    `]]
    
    [[!*id:is=`1`:then=`
        [[!+show_banner_on_main:is=`1`:then=`[[$banner_altravita_free_v]]`]]
    `:else=`
        [[!+show_banner_on_article:is=`1`:then=`[[$banner_altravita_free_v]]`]]
    `]]
    
    [[-*id:is=`4`:then=``:else=`[[-$promo_gallery_main]]`]]
    [[*id:is=`6`:then=``:else=`[[$promo_video_main]]`]]
    <div class="content-block">
        <h4><a href="[[~5]]">Разделы отзывов</a></h4>
        <div class="wrap-content-block">
            [[getTicketsSections?
                &parents = `28`
                &limit = `0`
                &tpl = `main_blog_tpl`
            ]]
        </div>

        <h4 id="blog_h4"><a href="[[~5]]">Последние в блоге</a></h4>
        <div class="wrap-content-block">
            [[pdoResources?
                &parents = `5`
                &limit = `5`
                &tpl = `main_blog_tpl`
            ]]
        </div>
    </div>
</aside><!-- .left-sidebar -->',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'banner_altravita_free_v' => 
      array (
        'fields' => 
        array (
          'id' => 124,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'banner_altravita_free_v',
          'description' => '',
          'editor_type' => 0,
          'category' => 19,
          'cache_type' => 0,
          'snippet' => '<div class="avb_240" data-alt="[[*longtitle:default=`[[*pagetitle]]`]]"></div>
[[-<div class="banner_altravita_240">
    <a href="[[++banner_altravita_240_link]]"  target="_blank" onclick="yaCounter32824167.reachGoal(\'banner-altra\'); return true;">
        <img class="lazyload" data-src="assets/banners_altravita_new/img/phrases_003_vb.jpg" src="assets/template/images/no_events_image.png" alt="Баннер Альтравита">
    </a>
</div>
]]
[[-<div class="altravita_b_place">
    <div class="static_banner">
        <noindex><a href="https://altravita-ivf.ru/aktsii-i-spetspredlozheniya/besplatnyij-priem-reproduktologa.html?utm_source=145site&utm_medium=banner&utm_campaign=Altravita-otzivi-ginekologi" rel="nofollow" target="_blank"><img src="assets/banners_altravita_new/otzivi-ginekologi_v.jpg" alt="Бесплатный прием врача"></a></noindex>
    </div>
</div>]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="avb_240" data-alt="[[*longtitle:default=`[[*pagetitle]]`]]"></div>
[[-<div class="banner_altravita_240">
    <a href="[[++banner_altravita_240_link]]"  target="_blank" onclick="yaCounter32824167.reachGoal(\'banner-altra\'); return true;">
        <img class="lazyload" data-src="assets/banners_altravita_new/img/phrases_003_vb.jpg" src="assets/template/images/no_events_image.png" alt="Баннер Альтравита">
    </a>
</div>
]]
[[-<div class="altravita_b_place">
    <div class="static_banner">
        <noindex><a href="https://altravita-ivf.ru/aktsii-i-spetspredlozheniya/besplatnyij-priem-reproduktologa.html?utm_source=145site&utm_medium=banner&utm_campaign=Altravita-otzivi-ginekologi" rel="nofollow" target="_blank"><img src="assets/banners_altravita_new/otzivi-ginekologi_v.jpg" alt="Бесплатный прием врача"></a></noindex>
    </div>
</div>]]',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
      'promo_video_main' => 
      array (
        'fields' => 
        array (
          'id' => 29,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'promo_video_main',
          'description' => '',
          'editor_type' => 0,
          'category' => 4,
          'cache_type' => 0,
          'snippet' => '<div class="sidebar-block">
    <h4><a href="[[~6]]">Видео<i class="fa fa-plus-square"></i></a></h4>
    <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
        <div class="row">
            [[getImageList?
                &docid = `6`
                &tvname = `videos`
                &tpl = `video_tpl`
                &limit = `1`
            ]]
        </div>
    </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="sidebar-block">
    <h4><a href="[[~6]]">Видео<i class="fa fa-plus-square"></i></a></h4>
    <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
        <div class="row">
            [[getImageList?
                &docid = `6`
                &tvname = `videos`
                &tpl = `video_tpl`
                &limit = `1`
            ]]
        </div>
    </div>
</div>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'FOOTER' => 
      array (
        'fields' => 
        array (
          'id' => 3,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'FOOTER',
          'description' => '',
          'editor_type' => 0,
          'category' => 3,
          'cache_type' => 0,
          'snippet' => '<footer class="footer">
    <div class="container">
        <div class="row">
            <div class="wrap-footer clearfix">
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12">
                    <div class="row">
                        <nav class="menu-footer">
                            [[pdoMenu?
                                &parents = `0`
                                &level = `1`
                            ]]
                        </nav>
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4">
                    <div class="metriks-links">
                        [[++yandex_metrika]]
                        [[++google_analytics]]
                        [[++live_internet]]
                        [[++rambler_top100]]
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12 pull-right">
                    <div class="row">
                        <div class="copy">
                            <span>Все права защищены, 2019 &copy; [[++site_name]]</span>
                        </div>
                    </div>
                </div>
                <div class="col-xs-12">
                    <a href="[[~43]]" class="btn_blue_variant  btn-all button-wide button-wide_footer ">Задать вопрос</a>
                </div>
            </div>
        </div>
    </div>
</footer><!-- .footer -->
<a href="#" class="scrollup">Наверх</a>
<style>
    .preloader {
        opacity: 0;
        visibility: hidden;
    }
</style>

[[MinifyX? 
        &cssSources=`
            assets/template/css/bootstrap.css,
            assets/template/css/font-awesome.css,
            assets/template/css/lazyYT.css,
            assets/template/fonts/OpenSans.css,
            assets/template/js/owlcarousel/assets/owl.carousel.css,
            assets/template/js/fancybox/jquery.fancybox.css,
            assets/template/css/other-style.css,
            assets/template/auth/register.css,
            assets/banners_altravita_new/style.css,
            assets/template/css/style.css,
            assets/template/css/reviews_css.css,
            assets/components/tickets/css/web/lib/jquery.jgrowl.css
        ` 
        &jsSources=`
            assets/template/js/jquery-1.11.1.min.js,
            assets/template/js/fancybox/jquery.fancybox.js,
            assets/template/js/lazyload.min.js,
            assets/template/js/lazyYT.js,
            assets/template/js/owlcarousel/owl.carousel.js,
            assets/template/js/form.js,
            assets/template/auth/authorization.js,
            assets/template/js/script.js,
            assets/template/js/reviews_js.js
        ` 
        &minifyJs=`1` 
        &minifyCss=`1`
    ]]
    
    [[+MinifyX.css]]
    

[[+MinifyX.javascript]]
<div class="hidden">
    <div id="success">
      <h2>
      Ваша заявка принята!
      <br>
      Мы скоро с Вами свяжемся.
      </h2>
    </div>
    <div id="loading">
      <div id="load"></div>
    </div>
</div>
[[$review_form_popup_choice]]
[[$review_form_popup_consultation]]
[[$review_form_popup_new_theme]]
[[$form_popup_form]]
[[-<script>
    setTimeout(function(){
        $.getScript("//cdn.sendpulse.com/js/push/86510fab72e4c9610925a0c52e4372ce_1.js");
    },2500);
    (window.Image ? (new Image()) : document.createElement(\'img\')).src = \'https://vk.com/rtrg?p=VK-RTRG-132629-bYmI0\';
</script>]]
[[++fb_pixel]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<footer class="footer">
    <div class="container">
        <div class="row">
            <div class="wrap-footer clearfix">
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12">
                    <div class="row">
                        <nav class="menu-footer">
                            [[pdoMenu?
                                &parents = `0`
                                &level = `1`
                            ]]
                        </nav>
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4">
                    <div class="metriks-links">
                        [[++yandex_metrika]]
                        [[++google_analytics]]
                        [[++live_internet]]
                        [[++rambler_top100]]
                    </div>
                </div>
                <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12 pull-right">
                    <div class="row">
                        <div class="copy">
                            <span>Все права защищены, 2019 &copy; [[++site_name]]</span>
                        </div>
                    </div>
                </div>
                <div class="col-xs-12">
                    <a href="[[~43]]" class="btn_blue_variant  btn-all button-wide button-wide_footer ">Задать вопрос</a>
                </div>
            </div>
        </div>
    </div>
</footer><!-- .footer -->
<a href="#" class="scrollup">Наверх</a>
<style>
    .preloader {
        opacity: 0;
        visibility: hidden;
    }
</style>

[[MinifyX? 
        &cssSources=`
            assets/template/css/bootstrap.css,
            assets/template/css/font-awesome.css,
            assets/template/css/lazyYT.css,
            assets/template/fonts/OpenSans.css,
            assets/template/js/owlcarousel/assets/owl.carousel.css,
            assets/template/js/fancybox/jquery.fancybox.css,
            assets/template/css/other-style.css,
            assets/template/auth/register.css,
            assets/banners_altravita_new/style.css,
            assets/template/css/style.css,
            assets/template/css/reviews_css.css,
            assets/components/tickets/css/web/lib/jquery.jgrowl.css
        ` 
        &jsSources=`
            assets/template/js/jquery-1.11.1.min.js,
            assets/template/js/fancybox/jquery.fancybox.js,
            assets/template/js/lazyload.min.js,
            assets/template/js/lazyYT.js,
            assets/template/js/owlcarousel/owl.carousel.js,
            assets/template/js/form.js,
            assets/template/auth/authorization.js,
            assets/template/js/script.js,
            assets/template/js/reviews_js.js
        ` 
        &minifyJs=`1` 
        &minifyCss=`1`
    ]]
    
    [[+MinifyX.css]]
    

[[+MinifyX.javascript]]
<div class="hidden">
    <div id="success">
      <h2>
      Ваша заявка принята!
      <br>
      Мы скоро с Вами свяжемся.
      </h2>
    </div>
    <div id="loading">
      <div id="load"></div>
    </div>
</div>
[[$review_form_popup_choice]]
[[$review_form_popup_consultation]]
[[$review_form_popup_new_theme]]
[[$form_popup_form]]
[[-<script>
    setTimeout(function(){
        $.getScript("//cdn.sendpulse.com/js/push/86510fab72e4c9610925a0c52e4372ce_1.js");
    },2500);
    (window.Image ? (new Image()) : document.createElement(\'img\')).src = \'https://vk.com/rtrg?p=VK-RTRG-132629-bYmI0\';
</script>]]
[[++fb_pixel]]',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'review_form_popup_choice' => 
      array (
        'fields' => 
        array (
          'id' => 107,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'review_form_popup_choice',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'cache_type' => 0,
          'snippet' => '<div class="hidden">
    <div class="priem_form center" id="free_choice">
        <div>
            <h3>Бесплатный подбор<br/>гинеколога</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_choice" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на бесплатный подбор гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить вопрос</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="hidden">
    <div class="priem_form center" id="free_choice">
        <div>
            <h3>Бесплатный подбор<br/>гинеколога</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_choice" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на бесплатный подбор гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить вопрос</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
      'review_form_popup_consultation' => 
      array (
        'fields' => 
        array (
          'id' => 108,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'review_form_popup_consultation',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'cache_type' => 0,
          'snippet' => '<div class="hidden">
    <div class="priem_form center" id="free_consultation">
        <div>
            <h3>Нужна консультация</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_consultation" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на консультацию у гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут и уточним детали</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="hidden">
    <div class="priem_form center" id="free_consultation">
        <div>
            <h3>Нужна консультация</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_consultation" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Заявка на консультацию у гинеколога" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Имя"/>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
                <p>Мы перезвоним вам в течение 15 минут и уточним детали</p>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
      'review_form_popup_new_theme' => 
      array (
        'fields' => 
        array (
          'id' => 109,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'review_form_popup_new_theme',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'cache_type' => 0,
          'snippet' => '<div class="hidden">
    <div class="priem_form center" id="new_theme">
        <div>
            <h3>Новый отзыв</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_new_theme" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Новый отзыв" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="theme" placeholder="Тема вашего сообщения *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="">
                            <textarea class="b_input required" placeholder="Опишите свой опыт, задайте вопрос *" name="message" data-type="unknown"></textarea>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Ваше имя *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="hidden">
    <div class="priem_form center" id="new_theme">
        <div>
            <h3>Новый отзыв</h3>
    	    <form action="assets/template/php/submit.php" data-id="review_form_popup_new_theme" class="sendLead" method="post"> 
                <input type="hidden" name="type" value="Новый отзыв" />
                <input type="text" name="lastname" value="" />
                <div>
                    <div>
                        <div class="b_input">
                            <input type="text" name="theme" placeholder="Тема вашего сообщения *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="">
                            <textarea class="b_input required" placeholder="Опишите свой опыт, задайте вопрос *" name="message" data-type="unknown"></textarea>
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="name" placeholder="Ваше имя *" class="required" data-type="unknown" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <div class="b_input">
                            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
                        </div>
                    </div>
                    <br/>
                    <div>
                        <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
                        <button type="submit" class="btn_blue">Отправить</button>
                    </div>
                </div>
                <div class="clear"></div>
            </form>
        </div>
        <div class="clear"></div>
    </div>
</div>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
      'form_popup_form' => 
      array (
        'fields' => 
        array (
          'id' => 119,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'form_popup_form',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'cache_type' => 0,
          'snippet' => '<div class="hidden">
    <div class="main-form" id="popup_form">
        <h4>Получить бесплатную консультацию специалиста</h4>
        <form method="post" action="assets/template/php/submit.php" data-id="form_popup_form" class="sendLead">
            <input name="name" type="text" placeholder="Имя:" />
            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
            <textarea placeholder="Ваше сообщение:" name="message"></textarea>
            <input name="type" type="hidden" value="Заявка на бесплатную консультацию" />
            <input type="text" name="lastname" value="" />
            <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
            <button class="btn-all" type="submit">Отправить</button>
        </form>
    </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="hidden">
    <div class="main-form" id="popup_form">
        <h4>Получить бесплатную консультацию специалиста</h4>
        <form method="post" action="assets/template/php/submit.php" data-id="form_popup_form" class="sendLead">
            <input name="name" type="text" placeholder="Имя:" />
            <input type="text" name="phone" placeholder="E-mail или телефон:" data-type="contacts" class="required" />
            <textarea placeholder="Ваше сообщение:" name="message"></textarea>
            <input name="type" type="hidden" value="Заявка на бесплатную консультацию" />
            <input type="text" name="lastname" value="" />
            <span class="form_confid">Нажимая на кнопку, вы <a href="/[[~270]]" target="_blank">даете согласие</a> на обработку своих персональных данных</span>
            <button class="btn-all" type="submit">Отправить</button>
        </form>
    </div>
</div>',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modSnippet' => 
    array (
      'pdoMenu' => 
      array (
        'fields' => 
        array (
          'id' => 8,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'pdoMenu',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */

// Convert parameters from Wayfinder if exists
if (isset($startId)) {
    $scriptProperties[\'parents\'] = $startId;
}
if (!empty($includeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $includeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',\' . $v;
        } else {
            $scriptProperties[\'resources\'] = $v;
        }
    }
}
if (!empty($excludeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $excludeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',-\' . $v;
        } else {
            $scriptProperties[\'resources\'] = \'-\' . $v;
        }
    }
}

if (!empty($previewUnpublished) && $modx->hasPermission(\'view_unpublished\')) {
    $scriptProperties[\'showUnpublished\'] = 1;
}

$scriptProperties[\'depth\'] = empty($level) ? 100 : abs($level) - 1;
if (!empty($contexts)) {
    $scriptProperties[\'context\'] = $contexts;
}
if (empty($scriptProperties[\'context\'])) {
    $scriptProperties[\'context\'] = $modx->resource->context_key;
}

// Save original parents specified by user
$specified_parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));

if ($scriptProperties[\'parents\'] === \'\') {
    $scriptProperties[\'parents\'] = $modx->resource->id;
} elseif ($scriptProperties[\'parents\'] === 0 || $scriptProperties[\'parents\'] === \'0\') {
    if ($scriptProperties[\'depth\'] !== \'\' && $scriptProperties[\'depth\'] !== 100) {
        $contexts = array_map(\'trim\', explode(\',\', $scriptProperties[\'context\']));
        $parents = array();
        if (!empty($scriptProperties[\'showDeleted\'])) {
            $pdoFetch = $modx->getService(\'pdoFetch\');
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents,
                    $pdoFetch->getChildIds(\'modResource\', 0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        } else {
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents,
                    $modx->getChildIds(0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        }
        $scriptProperties[\'parents\'] = !empty($parents) ? implode(\',\', $parents) : \'+0\';
        $scriptProperties[\'depth\'] = 0;
    }
    $scriptProperties[\'includeParents\'] = 1;
    $scriptProperties[\'displayStart\'] = 0;
} else {
    $parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));
    $parents_in = $parents_out = array();
    foreach ($parents as $v) {
        if (!is_numeric($v)) {
            continue;
        }
        if ($v[0] == \'-\') {
            $parents_out[] = abs($v);
        } else {
            $parents_in[] = abs($v);
        }
    }

    if (empty($parents_in)) {
        $scriptProperties[\'includeParents\'] = 1;
        $scriptProperties[\'displayStart\'] = 0;
    }
}

if (!empty($displayStart)) {
    $scriptProperties[\'includeParents\'] = 1;
}
if (!empty($ph)) {
    $toPlaceholder = $ph;
}
if (!empty($sortOrder)) {
    $scriptProperties[\'sortdir\'] = $sortOrder;
}
if (!empty($sortBy)) {
    $scriptProperties[\'sortby\'] = $sortBy;
}
if (!empty($permissions)) {
    $scriptProperties[\'checkPermissions\'] = $permissions;
}
if (!empty($cacheResults)) {
    $scriptProperties[\'cache\'] = $cacheResults;
}
if (!empty($ignoreHidden)) {
    $scriptProperties[\'showHidden\'] = $ignoreHidden;
}

$wfTemplates = array(
    \'outerTpl\' => \'tplOuter\',
    \'rowTpl\' => \'tpl\',
    \'parentRowTpl\' => \'tplParentRow\',
    \'parentRowHereTpl\' => \'tplParentRowHere\',
    \'hereTpl\' => \'tplHere\',
    \'innerTpl\' => \'tplInner\',
    \'innerRowTpl\' => \'tplInnerRow\',
    \'innerHereTpl\' => \'tplInnerHere\',
    \'activeParentRowTpl\' => \'tplParentRowActive\',
    \'categoryFoldersTpl\' => \'tplCategoryFolder\',
    \'startItemTpl\' => \'tplStart\',
);
foreach ($wfTemplates as $k => $v) {
    if (isset(${$k})) {
        $scriptProperties[$v] = ${$k};
    }
}
//---

/** @var pdoMenu $pdoMenu */
$fqn = $modx->getOption(\'pdoMenu.class\', null, \'pdotools.pdomenu\', true);
$path = $modx->getOption(\'pdomenu_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoMenu = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoMenu->pdoTools->addTime(\'pdoTools loaded\');

$cache = !empty($cache) || (!$modx->user->id && !empty($cacheAnonymous));
if (empty($scriptProperties[\'cache_key\'])) {
    $scriptProperties[\'cache_key\'] = \'pdomenu/\' . sha1(serialize($scriptProperties));
}

$output = \'\';
$tree = array();
if ($cache) {
    $tree = $pdoMenu->pdoTools->getCache($scriptProperties);
}
if (empty($tree)) {
    $data = $pdoMenu->pdoTools->run();
    $data = $pdoMenu->pdoTools->buildTree($data, \'id\', \'parent\', $specified_parents);
    $tree = array();
    foreach ($data as $k => $v) {
        if (empty($v[\'id\'])) {
            if (!in_array($k, $specified_parents) && !$pdoMenu->checkResource($k)) {
                continue;
            } else {
                $tree = array_merge($tree, $v[\'children\']);
            }
        } else {
            $tree[$k] = $v;
        }
    }
    if ($cache) {
        $pdoMenu->pdoTools->setCache($tree, $scriptProperties);
    }
}
if (!empty($tree)) {
    $output = $pdoMenu->templateTree($tree);
}

if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $output .= \'<pre class="pdoMenuLog">\' . print_r($pdoMenu->pdoTools->getTime(), 1) . \'</pre>\';
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $output);
} else {
    return $output;
}',
          'locked' => false,
          'properties' => 
          array (
            'showLog' => 
            array (
              'name' => 'showLog',
              'desc' => 'pdotools_prop_showLog',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контекте "mgr".',
              'area_trans' => '',
            ),
            'fastMode' => 
            array (
              'name' => 'fastMode',
              'desc' => 'pdotools_prop_fastMode',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Быстрый режим обработки чанков. Все необработанные теги (условия, сниппеты и т.п.) будут вырезаны.',
              'area_trans' => '',
            ),
            'level' => 
            array (
              'name' => 'level',
              'desc' => 'pdotools_prop_level',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Уровень генерируемого меню.',
              'area_trans' => '',
            ),
            'parents' => 
            array (
              'name' => 'parents',
              'desc' => 'pdotools_prop_parents',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список родителей, через запятую, для поиска результатов. По умолчанию выборка ограничена текущим родителем. Если поставить 0 - выборка не ограничивается. Если id родителя начинается с дефиса, он и его потомки исключается из выборки.',
              'area_trans' => '',
            ),
            'displayStart' => 
            array (
              'name' => 'displayStart',
              'desc' => 'pdotools_prop_displayStart',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить показ начальных узлов меню. Полезно при указании более одного "parents".',
              'area_trans' => '',
            ),
            'resources' => 
            array (
              'name' => 'resources',
              'desc' => 'pdotools_prop_resources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ресурсов, через запятую, для вывода в результатах. Если id ресурса начинается с дефиса, этот ресурс исключается из выборки.',
              'area_trans' => '',
            ),
            'templates' => 
            array (
              'name' => 'templates',
              'desc' => 'pdotools_prop_templates',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список шаблонов, через запятую, для фильтрации результатов. Если id шаблона начинается с дефиса, ресурсы с ним исключается из выборки.',
              'area_trans' => '',
            ),
            'context' => 
            array (
              'name' => 'context',
              'desc' => 'pdotools_prop_context',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение выборки по контексту ресурсов.',
              'area_trans' => '',
            ),
            'cache' => 
            array (
              'name' => 'cache',
              'desc' => 'pdotools_prop_cache',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Кэширование результатов работы сниппета.',
              'area_trans' => '',
            ),
            'cacheTime' => 
            array (
              'name' => 'cacheTime',
              'desc' => 'pdotools_prop_cacheTime',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 3600,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Время актуальности кэша в секундах.',
              'area_trans' => '',
            ),
            'cacheAnonymous' => 
            array (
              'name' => 'cacheAnonymous',
              'desc' => 'pdotools_prop_cacheAnonymous',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить кэширование только для неавторизованных посетителей.',
              'area_trans' => '',
            ),
            'plPrefix' => 
            array (
              'name' => 'plPrefix',
              'desc' => 'pdotools_prop_plPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'wf.',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс для выставляемых плейсхолдеров, по умолчанию "wf.".',
              'area_trans' => '',
            ),
            'showHidden' => 
            array (
              'name' => 'showHidden',
              'desc' => 'pdotools_prop_showHidden',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать ресурсы, скрытые в меню.',
              'area_trans' => '',
            ),
            'showUnpublished' => 
            array (
              'name' => 'showUnpublished',
              'desc' => 'pdotools_prop_showUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать неопубликованные ресурсы.',
              'area_trans' => '',
            ),
            'showDeleted' => 
            array (
              'name' => 'showDeleted',
              'desc' => 'pdotools_prop_showDeleted',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать удалённые ресурсы.',
              'area_trans' => '',
            ),
            'previewUnpublished' => 
            array (
              'name' => 'previewUnpublished',
              'desc' => 'pdotools_prop_previewUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить показ неопубликованных документов, если у пользователя есть на это разрешение.',
              'area_trans' => '',
            ),
            'hideSubMenus' => 
            array (
              'name' => 'hideSubMenus',
              'desc' => 'pdotools_prop_hideSubMenus',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Спрятать неактивные ветки меню.',
              'area_trans' => '',
            ),
            'useWeblinkUrl' => 
            array (
              'name' => 'useWeblinkUrl',
              'desc' => 'pdotools_prop_useWeblinkUrl',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Генерировать ссылку с учетом класса ресурса.',
              'area_trans' => '',
            ),
            'sortdir' => 
            array (
              'name' => 'sortdir',
              'desc' => 'pdotools_prop_sortdir',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'ASC',
                  'value' => 'ASC',
                  'name' => 'ASC',
                ),
                1 => 
                array (
                  'text' => 'DESC',
                  'value' => 'DESC',
                  'name' => 'DESC',
                ),
              ),
              'value' => 'ASC',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Направление сортировки: по убыванию или возрастанию.',
              'area_trans' => '',
            ),
            'sortby' => 
            array (
              'name' => 'sortby',
              'desc' => 'pdotools_prop_sortby',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'menuindex',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Любое поле ресурса для сортировки, включая ТВ параметр, если он указан в параметре "includeTVs". Можно указывать JSON строку с массивом нескольких полей. Для случайно сортировки укажите "RAND()"',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'pdotools_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение количества результатов выборки. Можно использовать "0".',
              'area_trans' => '',
            ),
            'offset' => 
            array (
              'name' => 'offset',
              'desc' => 'pdotools_prop_offset',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Пропуск результатов от начала.',
              'area_trans' => '',
            ),
            'rowIdPrefix' => 
            array (
              'name' => 'rowIdPrefix',
              'desc' => 'pdotools_prop_rowIdPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс id="" для выставления идентификатора в чанк.',
              'area_trans' => '',
            ),
            'firstClass' => 
            array (
              'name' => 'firstClass',
              'desc' => 'pdotools_prop_firstClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'first',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс для первого пункта меню.',
              'area_trans' => '',
            ),
            'lastClass' => 
            array (
              'name' => 'lastClass',
              'desc' => 'pdotools_prop_lastClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'last',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс последнего пункта меню.',
              'area_trans' => '',
            ),
            'hereClass' => 
            array (
              'name' => 'hereClass',
              'desc' => 'pdotools_prop_hereClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'active',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс для активного пункта меню.',
              'area_trans' => '',
            ),
            'parentClass' => 
            array (
              'name' => 'parentClass',
              'desc' => 'pdotools_prop_parentClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс категории меню.',
              'area_trans' => '',
            ),
            'rowClass' => 
            array (
              'name' => 'rowClass',
              'desc' => 'pdotools_prop_rowClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс одной строки меню.',
              'area_trans' => '',
            ),
            'outerClass' => 
            array (
              'name' => 'outerClass',
              'desc' => 'pdotools_prop_outerClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс обертки меню.',
              'area_trans' => '',
            ),
            'innerClass' => 
            array (
              'name' => 'innerClass',
              'desc' => 'pdotools_prop_innerClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс внутренних ссылок меню.',
              'area_trans' => '',
            ),
            'levelClass' => 
            array (
              'name' => 'levelClass',
              'desc' => 'pdotools_prop_levelClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс уровня меню. Например, если укажите "level", то будет "level1", "level2" и т.д.',
              'area_trans' => '',
            ),
            'selfClass' => 
            array (
              'name' => 'selfClass',
              'desc' => 'pdotools_prop_selfClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс текущего документа в меню.',
              'area_trans' => '',
            ),
            'webLinkClass' => 
            array (
              'name' => 'webLinkClass',
              'desc' => 'pdotools_prop_webLinkClass',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Класс документа-ссылки.',
              'area_trans' => '',
            ),
            'tplOuter' => 
            array (
              'name' => 'tplOuter',
              'desc' => 'pdotools_prop_tplOuter',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <ul[[+classes]]>[[+wrapper]]</ul>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка всего блока меню.',
              'area_trans' => '',
            ),
            'tpl' => 
            array (
              'name' => 'tpl',
              'desc' => 'pdotools_prop_tpl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li[[+classes]]><a href="[[+link]]" [[+attributes]]>[[+menutitle]]</a>[[+wrapper]]</li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для оформления ресурса. Если не указан, то содержимое полей ресурса будет распечатано на экран.',
              'area_trans' => '',
            ),
            'tplParentRow' => 
            array (
              'name' => 'tplParentRow',
              'desc' => 'pdotools_prop_tplParentRow',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления контейнера с потомками.',
              'area_trans' => '',
            ),
            'tplParentRowHere' => 
            array (
              'name' => 'tplParentRowHere',
              'desc' => 'pdotools_prop_tplParentRowHere',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления текущего контейнера с потомками.',
              'area_trans' => '',
            ),
            'tplHere' => 
            array (
              'name' => 'tplHere',
              'desc' => 'pdotools_prop_tplHere',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк текущего документа',
              'area_trans' => '',
            ),
            'tplInner' => 
            array (
              'name' => 'tplInner',
              'desc' => 'pdotools_prop_tplInner',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка внутренних пунктов меню. Если пуст - будет использовать "tplInner".',
              'area_trans' => '',
            ),
            'tplInnerRow' => 
            array (
              'name' => 'tplInnerRow',
              'desc' => 'pdotools_prop_tplInnerRow',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка активного пункта меню.',
              'area_trans' => '',
            ),
            'tplInnerHere' => 
            array (
              'name' => 'tplInnerHere',
              'desc' => 'pdotools_prop_tplInnerHere',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка активного пункта меню.',
              'area_trans' => '',
            ),
            'tplParentRowActive' => 
            array (
              'name' => 'tplParentRowActive',
              'desc' => 'pdotools_prop_tplParentRowActive',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления активного контейнера с потомками.',
              'area_trans' => '',
            ),
            'tplCategoryFolder' => 
            array (
              'name' => 'tplCategoryFolder',
              'desc' => 'pdotools_prop_tplCategoryFolder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Специальный чанк оформления категории. Категория - это документ с потомками и или нулевым шаблоном, или с атрибутом "rel=\\"category\\"".',
              'area_trans' => '',
            ),
            'tplStart' => 
            array (
              'name' => 'tplStart',
              'desc' => 'pdotools_prop_tplStart',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <h2[[+classes]]>[[+menutitle]]</h2>[[+wrapper]]',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления корневого пункта, при условии, что включен "displayStart".',
              'area_trans' => '',
            ),
            'checkPermissions' => 
            array (
              'name' => 'checkPermissions',
              'desc' => 'pdotools_prop_checkPermissions',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Укажите, какие разрешения нужно проверять у пользователя при выводе документов.',
              'area_trans' => '',
            ),
            'hereId' => 
            array (
              'name' => 'hereId',
              'desc' => 'pdotools_prop_hereId',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Id документа, текущего для генерируемого меню. Нужно указывать только если скрипт сам его неверно определяет, например при выводе меню из чанка другого сниппета.',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'pdotools_prop_where',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Массив дополнительных параметров выборки, закодированный в JSON.',
              'area_trans' => '',
            ),
            'select' => 
            array (
              'name' => 'select',
              'desc' => 'pdotools_prop_select',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список полей для выборки, через запятую. Можно указывать JSON строку с массивом, например {"modResource":"id,pagetitle,content"}.',
              'area_trans' => '',
            ),
            'scheme' => 
            array (
              'name' => 'scheme',
              'desc' => 'pdotools_prop_scheme',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => '',
                  'text' => 'System default',
                  'name' => 'System default',
                ),
                1 => 
                array (
                  'value' => -1,
                  'text' => '-1 (relative to site_url)',
                  'name' => '-1 (relative to site_url)',
                ),
                2 => 
                array (
                  'value' => 'full',
                  'text' => 'full (absolute, prepended with site_url)',
                  'name' => 'full (absolute, prepended with site_url)',
                ),
                3 => 
                array (
                  'value' => 'abs',
                  'text' => 'abs (absolute, prepended with base_url)',
                  'name' => 'abs (absolute, prepended with base_url)',
                ),
                4 => 
                array (
                  'value' => 'http',
                  'text' => 'http (absolute, forced to http scheme)',
                  'name' => 'http (absolute, forced to http scheme)',
                ),
                5 => 
                array (
                  'value' => 'https',
                  'text' => 'https (absolute, forced to https scheme)',
                  'name' => 'https (absolute, forced to https scheme)',
                ),
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Схема формирования ссылок: "uri" для подстановки поля uri документа (очень быстро) или параметр для modX::makeUrl().',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'pdotools_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'countChildren' => 
            array (
              'name' => 'countChildren',
              'desc' => 'pdotools_prop_countChildren',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Вывести точное количество активных потомков документа в плейсхолдер [[+children]].',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/pdotools/elements/snippets/snippet.pdomenu.php',
          'content' => '/** @var array $scriptProperties */

// Convert parameters from Wayfinder if exists
if (isset($startId)) {
    $scriptProperties[\'parents\'] = $startId;
}
if (!empty($includeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $includeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',\' . $v;
        } else {
            $scriptProperties[\'resources\'] = $v;
        }
    }
}
if (!empty($excludeDocs)) {
    $tmp = array_map(\'trim\', explode(\',\', $excludeDocs));
    foreach ($tmp as $v) {
        if (!empty($scriptProperties[\'resources\'])) {
            $scriptProperties[\'resources\'] .= \',-\' . $v;
        } else {
            $scriptProperties[\'resources\'] = \'-\' . $v;
        }
    }
}

if (!empty($previewUnpublished) && $modx->hasPermission(\'view_unpublished\')) {
    $scriptProperties[\'showUnpublished\'] = 1;
}

$scriptProperties[\'depth\'] = empty($level) ? 100 : abs($level) - 1;
if (!empty($contexts)) {
    $scriptProperties[\'context\'] = $contexts;
}
if (empty($scriptProperties[\'context\'])) {
    $scriptProperties[\'context\'] = $modx->resource->context_key;
}

// Save original parents specified by user
$specified_parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));

if ($scriptProperties[\'parents\'] === \'\') {
    $scriptProperties[\'parents\'] = $modx->resource->id;
} elseif ($scriptProperties[\'parents\'] === 0 || $scriptProperties[\'parents\'] === \'0\') {
    if ($scriptProperties[\'depth\'] !== \'\' && $scriptProperties[\'depth\'] !== 100) {
        $contexts = array_map(\'trim\', explode(\',\', $scriptProperties[\'context\']));
        $parents = array();
        if (!empty($scriptProperties[\'showDeleted\'])) {
            $pdoFetch = $modx->getService(\'pdoFetch\');
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents,
                    $pdoFetch->getChildIds(\'modResource\', 0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        } else {
            foreach ($contexts as $ctx) {
                $parents = array_merge($parents,
                    $modx->getChildIds(0, $scriptProperties[\'depth\'], array(\'context\' => $ctx)));
            }
        }
        $scriptProperties[\'parents\'] = !empty($parents) ? implode(\',\', $parents) : \'+0\';
        $scriptProperties[\'depth\'] = 0;
    }
    $scriptProperties[\'includeParents\'] = 1;
    $scriptProperties[\'displayStart\'] = 0;
} else {
    $parents = array_map(\'trim\', explode(\',\', $scriptProperties[\'parents\']));
    $parents_in = $parents_out = array();
    foreach ($parents as $v) {
        if (!is_numeric($v)) {
            continue;
        }
        if ($v[0] == \'-\') {
            $parents_out[] = abs($v);
        } else {
            $parents_in[] = abs($v);
        }
    }

    if (empty($parents_in)) {
        $scriptProperties[\'includeParents\'] = 1;
        $scriptProperties[\'displayStart\'] = 0;
    }
}

if (!empty($displayStart)) {
    $scriptProperties[\'includeParents\'] = 1;
}
if (!empty($ph)) {
    $toPlaceholder = $ph;
}
if (!empty($sortOrder)) {
    $scriptProperties[\'sortdir\'] = $sortOrder;
}
if (!empty($sortBy)) {
    $scriptProperties[\'sortby\'] = $sortBy;
}
if (!empty($permissions)) {
    $scriptProperties[\'checkPermissions\'] = $permissions;
}
if (!empty($cacheResults)) {
    $scriptProperties[\'cache\'] = $cacheResults;
}
if (!empty($ignoreHidden)) {
    $scriptProperties[\'showHidden\'] = $ignoreHidden;
}

$wfTemplates = array(
    \'outerTpl\' => \'tplOuter\',
    \'rowTpl\' => \'tpl\',
    \'parentRowTpl\' => \'tplParentRow\',
    \'parentRowHereTpl\' => \'tplParentRowHere\',
    \'hereTpl\' => \'tplHere\',
    \'innerTpl\' => \'tplInner\',
    \'innerRowTpl\' => \'tplInnerRow\',
    \'innerHereTpl\' => \'tplInnerHere\',
    \'activeParentRowTpl\' => \'tplParentRowActive\',
    \'categoryFoldersTpl\' => \'tplCategoryFolder\',
    \'startItemTpl\' => \'tplStart\',
);
foreach ($wfTemplates as $k => $v) {
    if (isset(${$k})) {
        $scriptProperties[$v] = ${$k};
    }
}
//---

/** @var pdoMenu $pdoMenu */
$fqn = $modx->getOption(\'pdoMenu.class\', null, \'pdotools.pdomenu\', true);
$path = $modx->getOption(\'pdomenu_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoMenu = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoMenu->pdoTools->addTime(\'pdoTools loaded\');

$cache = !empty($cache) || (!$modx->user->id && !empty($cacheAnonymous));
if (empty($scriptProperties[\'cache_key\'])) {
    $scriptProperties[\'cache_key\'] = \'pdomenu/\' . sha1(serialize($scriptProperties));
}

$output = \'\';
$tree = array();
if ($cache) {
    $tree = $pdoMenu->pdoTools->getCache($scriptProperties);
}
if (empty($tree)) {
    $data = $pdoMenu->pdoTools->run();
    $data = $pdoMenu->pdoTools->buildTree($data, \'id\', \'parent\', $specified_parents);
    $tree = array();
    foreach ($data as $k => $v) {
        if (empty($v[\'id\'])) {
            if (!in_array($k, $specified_parents) && !$pdoMenu->checkResource($k)) {
                continue;
            } else {
                $tree = array_merge($tree, $v[\'children\']);
            }
        } else {
            $tree[$k] = $v;
        }
    }
    if ($cache) {
        $pdoMenu->pdoTools->setCache($tree, $scriptProperties);
    }
}
if (!empty($tree)) {
    $output = $pdoMenu->templateTree($tree);
}

if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $output .= \'<pre class="pdoMenuLog">\' . print_r($pdoMenu->pdoTools->getTime(), 1) . \'</pre>\';
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $output);
} else {
    return $output;
}',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'pdoCrumbs' => 
      array (
        'fields' => 
        array (
          'id' => 3,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'pdoCrumbs',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
/** @var pdoFetch $pdoFetch */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
$path = $modx->getOption(\'pdofetch_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoFetch = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');

if (!isset($from) || $from == \'\') {
    $from = 0;
}
if (empty($to)) {
    $to = $modx->resource->id;
}
if (empty($direction)) {
    $direction = \'ltr\';
}
if ($outputSeparator == \'&nbsp;&rarr;&nbsp;\' && $direction == \'rtl\') {
    $outputSeparator = \'&nbsp;&larr;&nbsp;\';
}
if ($limit == \'\') {
    $limit = 10;
}
// For compatibility with BreadCrumb
if (!empty($maxCrumbs)) {
    $limit = $maxCrumbs;
}
if (!empty($containerTpl)) {
    $tplWrapper = $containerTpl;
}
if (!empty($currentCrumbTpl)) {
    $tplCurrent = $currentCrumbTpl;
}
if (!empty($linkCrumbTpl)) {
    $scriptProperties[\'tpl\'] = $linkCrumbTpl;
}
if (!empty($maxCrumbTpl)) {
    $tplMax = $maxCrumbTpl;
}
if (isset($showBreadCrumbsAtHome)) {
    $showAtHome = $showBreadCrumbsAtHome;
}
if (isset($showHomeCrumb)) {
    $showHome = $showHomeCrumb;
}
if (isset($showCurrentCrumb)) {
    $showCurrent = $showCurrentCrumb;
}
// --
$fastMode = !empty($fastMode);
$siteStart = $modx->getOption(\'siteStart\', $scriptProperties, $modx->getOption(\'site_start\'));

if (empty($showAtHome) && $modx->resource->id == $siteStart) {
    return \'\';
}

$class = $modx->getOption(\'class\', $scriptProperties, \'modResource\');
// Start building "Where" expression
$where = array();
if (empty($showUnpublished) && empty($showUnPub)) {
    $where[\'published\'] = 1;
}
if (empty($showHidden)) {
    $where[\'hidemenu\'] = 0;
}
if (empty($showDeleted)) {
    $where[\'deleted\'] = 0;
}
if (!empty($hideContainers) && empty($showContainer)) {
    $where[\'isfolder\'] = 0;
}

$resource = ($to == $modx->resource->id)
    ? $modx->resource
    : $modx->getObject($class, $to);

if (!$resource) {
    $message = \'Could not build breadcrumbs to resource "\' . $to . \'"\';

    return \'\';
}

$parents = $modx->getParentIds($resource->id, $limit, array(\'context\' => $resource->get(\'context_key\')));
if (!empty($showHome)) {
    $parents[] = $siteStart;
}

$ids = array($resource->id);
foreach ($parents as $parent) {
    if (!empty($parent)) {
        $ids[] = $parent;
    }
    if (!empty($from) && $parent == $from) {
        break;
    }
}
$where[\'id:IN\'] = $ids;

if (!empty($exclude)) {
    $where[\'id:NOT IN\'] = array_map(\'trim\', explode(\',\', $exclude));
}

// Fields to select
$resourceColumns = array_keys($modx->getFieldMeta($class));
$select = array($class => implode(\',\', $resourceColumns));

// Add custom parameters
foreach (array(\'where\', \'select\') as $v) {
    if (!empty($scriptProperties[$v])) {
        $tmp = $scriptProperties[$v];
        if (!is_array($tmp)) {
            $tmp = json_decode($tmp, true);
        }
        if (is_array($tmp)) {
            $$v = array_merge($$v, $tmp);
        }
    }
    unset($scriptProperties[$v]);
}
$pdoFetch->addTime(\'Conditions prepared\');

// Default parameters
$default = array(
    \'class\' => $class,
    \'where\' => json_encode($where),
    \'select\' => json_encode($select),
    \'groupby\' => $class . \'.id\',
    \'sortby\' => "find_in_set(`$class`.`id`,\'" . implode(\',\', $ids) . "\')",
    \'sortdir\' => \'\',
    \'return\' => \'data\',
    \'totalVar\' => \'pdocrumbs.total\',
    \'disableConditions\' => true,
);

// Merge all properties and run!
$pdoFetch->addTime(\'Query parameters ready\');
$pdoFetch->setConfig(array_merge($default, $scriptProperties), false);
$rows = $pdoFetch->run();

$output = array();
if (!empty($rows) && is_array($rows)) {
    if (strtolower($direction) == \'ltr\') {
        $rows = array_reverse($rows);
    }

    foreach ($rows as $row) {
        if (!empty($useWeblinkUrl) && $row[\'class_key\'] == \'modWebLink\') {
            $row[\'link\'] = is_numeric(trim($row[\'content\'], \'[]~ \'))
                ? $pdoFetch->makeUrl(intval(trim($row[\'content\'], \'[]~ \')), $row)
                : $row[\'content\'];
        } else {
            $row[\'link\'] = $pdoFetch->makeUrl($row[\'id\'], $row);
        }

        $row = array_merge(
            $scriptProperties,
            $row,
            array(\'idx\' => $pdoFetch->idx++)
        );
        if (empty($row[\'menutitle\'])) {
            $row[\'menutitle\'] = $row[\'pagetitle\'];
        }

        if ($row[\'id\'] == $resource->id && empty($showCurrent)) {
            continue;
        } elseif ($row[\'id\'] == $resource->id && !empty($tplCurrent)) {
            $tpl = $tplCurrent;
        } elseif ($row[\'id\'] == $siteStart && !empty($tplHome)) {
            $tpl = $tplHome;
        } else {
            $tpl = $pdoFetch->defineChunk($row);
        }
        $output[] = empty($tpl)
            ? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
            : $pdoFetch->getChunk($tpl, $row, $fastMode);
    }
}
$pdoFetch->addTime(\'Chunks processed\');

if (count($output) == 1 && !empty($hideSingle)) {
    $pdoFetch->addTime(\'The only result was hidden, because the parameter "hideSingle" activated\');
    $output = array();
}

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="pdoCrumbsLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

if (!empty($toSeparatePlaceholders)) {
    $output[\'log\'] = $log;
    $modx->setPlaceholders($output, $toSeparatePlaceholders);
} else {
    $output = implode($outputSeparator, $output);
    if ($pdoFetch->idx >= $limit && !empty($tplMax) && !empty($output)) {
        $output = ($direction == \'ltr\')
            ? $pdoFetch->getChunk($tplMax, array(), $fastMode) . $output
            : $output . $pdoFetch->getChunk($tplMax, array(), $fastMode);
    }
    $output .= $log;

    if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
        $output = $pdoFetch->getChunk($tplWrapper, array(\'output\' => $output, \'crumbs\' => $output), $fastMode);
    }

    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
}',
          'locked' => false,
          'properties' => 
          array (
            'showLog' => 
            array (
              'name' => 'showLog',
              'desc' => 'pdotools_prop_showLog',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контекте "mgr".',
              'area_trans' => '',
            ),
            'fastMode' => 
            array (
              'name' => 'fastMode',
              'desc' => 'pdotools_prop_fastMode',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Быстрый режим обработки чанков. Все необработанные теги (условия, сниппеты и т.п.) будут вырезаны.',
              'area_trans' => '',
            ),
            'from' => 
            array (
              'name' => 'from',
              'desc' => 'pdotools_prop_from',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Id ресурса, от которого строить хлебные крошки. Обычно это корень сайта, то есть "0".',
              'area_trans' => '',
            ),
            'to' => 
            array (
              'name' => 'to',
              'desc' => 'pdotools_prop_to',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Id ресурса для которого строятся хлебные крошки. По умолчанию это id текущей страницы.',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'pdotools_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 10,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение количества результатов выборки. Можно использовать "0".',
              'area_trans' => '',
            ),
            'exclude' => 
            array (
              'name' => 'exclude',
              'desc' => 'pdotools_prop_exclude',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список id ресурсов, которые нужно исключить из выборки.',
              'area_trans' => '',
            ),
            'outputSeparator' => 
            array (
              'name' => 'outputSeparator',
              'desc' => 'pdotools_prop_outputSeparator',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '
',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Необязательная строка для разделения результатов работы.',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'pdotools_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'includeTVs' => 
            array (
              'name' => 'includeTVs',
              'desc' => 'pdotools_prop_includeTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров для выборки, через запятую. Например: "action,time" дадут плейсхолдеры [[+action]] и [[+time]].',
              'area_trans' => '',
            ),
            'prepareTVs' => 
            array (
              'name' => 'prepareTVs',
              'desc' => 'pdotools_prop_prepareTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '1',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров, которые нужно подготовить перед выводом. По умолчанию, установлено в "1", что означает подготовку всех ТВ, указанных в "&includeTVs=``"',
              'area_trans' => '',
            ),
            'processTVs' => 
            array (
              'name' => 'processTVs',
              'desc' => 'pdotools_prop_processTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров, которые нужно обработать перед выводом. Если установить в "1" - будут обработаны все ТВ, указанные в "&includeTVs=``". По умолчанию параметр пуст.',
              'area_trans' => '',
            ),
            'tvPrefix' => 
            array (
              'name' => 'tvPrefix',
              'desc' => 'pdotools_prop_tvPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tv.',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс для ТВ параметров.',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'pdotools_prop_where',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Массив дополнительных параметров выборки, закодированный в JSON.',
              'area_trans' => '',
            ),
            'showUnpublished' => 
            array (
              'name' => 'showUnpublished',
              'desc' => 'pdotools_prop_showUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать неопубликованные ресурсы.',
              'area_trans' => '',
            ),
            'showDeleted' => 
            array (
              'name' => 'showDeleted',
              'desc' => 'pdotools_prop_showDeleted',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать удалённые ресурсы.',
              'area_trans' => '',
            ),
            'showHidden' => 
            array (
              'name' => 'showHidden',
              'desc' => 'pdotools_prop_showHidden',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать ресурсы, скрытые в меню.',
              'area_trans' => '',
            ),
            'hideContainers' => 
            array (
              'name' => 'hideContainers',
              'desc' => 'pdotools_prop_hideContainers',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Отключает вывод контейнеров, то есть, ресурсов с isfolder = 1.',
              'area_trans' => '',
            ),
            'tpl' => 
            array (
              'name' => 'tpl',
              'desc' => 'pdotools_prop_tpl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li><a href="[[+link]]">[[+menutitle]]</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для оформления ресурса. Если не указан, то содержимое полей ресурса будет распечатано на экран.',
              'area_trans' => '',
            ),
            'tplCurrent' => 
            array (
              'name' => 'tplCurrent',
              'desc' => 'pdotools_prop_tplCurrent',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="active">[[+menutitle]]</li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления текущего документа в навигации.',
              'area_trans' => '',
            ),
            'tplMax' => 
            array (
              'name' => 'tplMax',
              'desc' => 'pdotools_prop_tplMax',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="disabled">&nbsp;...&nbsp;</li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк, который добавляется в начало результатов, если их больше чем "&limit".',
              'area_trans' => '',
            ),
            'tplHome' => 
            array (
              'name' => 'tplHome',
              'desc' => 'pdotools_prop_tplHome',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления ссылки на главную страницу.',
              'area_trans' => '',
            ),
            'tplWrapper' => 
            array (
              'name' => 'tplWrapper',
              'desc' => 'pdotools_prop_tplWrapper',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <ul class="breadcrumb">[[+output]]</ul>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка, для заворачивания всех результатов. Понимает один плейсхолдер: [[+output]]. Не работает вместе с параметром "toSeparatePlaceholders".',
              'area_trans' => '',
            ),
            'wrapIfEmpty' => 
            array (
              'name' => 'wrapIfEmpty',
              'desc' => 'pdotools_prop_wrapIfEmpty',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включает вывод чанка-обертки (tplWrapper) даже если результатов нет.',
              'area_trans' => '',
            ),
            'showCurrent' => 
            array (
              'name' => 'showCurrent',
              'desc' => 'pdotools_prop_showCurrent',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Выводить текущий документ в навигации.',
              'area_trans' => '',
            ),
            'showHome' => 
            array (
              'name' => 'showHome',
              'desc' => 'pdotools_prop_showHome',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Выводить ссылку на главную в начале навигации.',
              'area_trans' => '',
            ),
            'showAtHome' => 
            array (
              'name' => 'showAtHome',
              'desc' => 'pdotools_prop_showAtHome',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать хлебные крошки на главной странице сайта.',
              'area_trans' => '',
            ),
            'hideSingle' => 
            array (
              'name' => 'hideSingle',
              'desc' => 'pdotools_prop_hideSingle',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Не выводить результат, если он один единственный.',
              'area_trans' => '',
            ),
            'direction' => 
            array (
              'name' => 'direction',
              'desc' => 'pdotools_prop_direction',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => 'ltr',
                  'text' => 'Left To Right (ltr)',
                  'name' => 'Left To Right (ltr)',
                ),
                1 => 
                array (
                  'value' => 'rtl',
                  'text' => 'Right To Left (rtl)',
                  'name' => 'Right To Left (rtl)',
                ),
              ),
              'value' => 'ltr',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Направление навигации: слева направо (ltr) или справа налево (rtl), например для Арабского языка.',
              'area_trans' => '',
            ),
            'scheme' => 
            array (
              'name' => 'scheme',
              'desc' => 'pdotools_prop_scheme',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => '',
                  'text' => 'System default',
                  'name' => 'System default',
                ),
                1 => 
                array (
                  'value' => -1,
                  'text' => '-1 (relative to site_url)',
                  'name' => '-1 (relative to site_url)',
                ),
                2 => 
                array (
                  'value' => 'full',
                  'text' => 'full (absolute, prepended with site_url)',
                  'name' => 'full (absolute, prepended with site_url)',
                ),
                3 => 
                array (
                  'value' => 'abs',
                  'text' => 'abs (absolute, prepended with base_url)',
                  'name' => 'abs (absolute, prepended with base_url)',
                ),
                4 => 
                array (
                  'value' => 'http',
                  'text' => 'http (absolute, forced to http scheme)',
                  'name' => 'http (absolute, forced to http scheme)',
                ),
                5 => 
                array (
                  'value' => 'https',
                  'text' => 'https (absolute, forced to https scheme)',
                  'name' => 'https (absolute, forced to https scheme)',
                ),
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Схема формирования ссылок: "uri" для подстановки поля uri документа (очень быстро) или параметр для modX::makeUrl().',
              'area_trans' => '',
            ),
            'useWeblinkUrl' => 
            array (
              'name' => 'useWeblinkUrl',
              'desc' => 'pdotools_prop_useWeblinkUrl',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Генерировать ссылку с учетом класса ресурса.',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/pdotools/elements/snippets/snippet.pdocrumbs.php',
          'content' => '/** @var array $scriptProperties */
/** @var pdoFetch $pdoFetch */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
$path = $modx->getOption(\'pdofetch_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoFetch = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');

if (!isset($from) || $from == \'\') {
    $from = 0;
}
if (empty($to)) {
    $to = $modx->resource->id;
}
if (empty($direction)) {
    $direction = \'ltr\';
}
if ($outputSeparator == \'&nbsp;&rarr;&nbsp;\' && $direction == \'rtl\') {
    $outputSeparator = \'&nbsp;&larr;&nbsp;\';
}
if ($limit == \'\') {
    $limit = 10;
}
// For compatibility with BreadCrumb
if (!empty($maxCrumbs)) {
    $limit = $maxCrumbs;
}
if (!empty($containerTpl)) {
    $tplWrapper = $containerTpl;
}
if (!empty($currentCrumbTpl)) {
    $tplCurrent = $currentCrumbTpl;
}
if (!empty($linkCrumbTpl)) {
    $scriptProperties[\'tpl\'] = $linkCrumbTpl;
}
if (!empty($maxCrumbTpl)) {
    $tplMax = $maxCrumbTpl;
}
if (isset($showBreadCrumbsAtHome)) {
    $showAtHome = $showBreadCrumbsAtHome;
}
if (isset($showHomeCrumb)) {
    $showHome = $showHomeCrumb;
}
if (isset($showCurrentCrumb)) {
    $showCurrent = $showCurrentCrumb;
}
// --
$fastMode = !empty($fastMode);
$siteStart = $modx->getOption(\'siteStart\', $scriptProperties, $modx->getOption(\'site_start\'));

if (empty($showAtHome) && $modx->resource->id == $siteStart) {
    return \'\';
}

$class = $modx->getOption(\'class\', $scriptProperties, \'modResource\');
// Start building "Where" expression
$where = array();
if (empty($showUnpublished) && empty($showUnPub)) {
    $where[\'published\'] = 1;
}
if (empty($showHidden)) {
    $where[\'hidemenu\'] = 0;
}
if (empty($showDeleted)) {
    $where[\'deleted\'] = 0;
}
if (!empty($hideContainers) && empty($showContainer)) {
    $where[\'isfolder\'] = 0;
}

$resource = ($to == $modx->resource->id)
    ? $modx->resource
    : $modx->getObject($class, $to);

if (!$resource) {
    $message = \'Could not build breadcrumbs to resource "\' . $to . \'"\';

    return \'\';
}

$parents = $modx->getParentIds($resource->id, $limit, array(\'context\' => $resource->get(\'context_key\')));
if (!empty($showHome)) {
    $parents[] = $siteStart;
}

$ids = array($resource->id);
foreach ($parents as $parent) {
    if (!empty($parent)) {
        $ids[] = $parent;
    }
    if (!empty($from) && $parent == $from) {
        break;
    }
}
$where[\'id:IN\'] = $ids;

if (!empty($exclude)) {
    $where[\'id:NOT IN\'] = array_map(\'trim\', explode(\',\', $exclude));
}

// Fields to select
$resourceColumns = array_keys($modx->getFieldMeta($class));
$select = array($class => implode(\',\', $resourceColumns));

// Add custom parameters
foreach (array(\'where\', \'select\') as $v) {
    if (!empty($scriptProperties[$v])) {
        $tmp = $scriptProperties[$v];
        if (!is_array($tmp)) {
            $tmp = json_decode($tmp, true);
        }
        if (is_array($tmp)) {
            $$v = array_merge($$v, $tmp);
        }
    }
    unset($scriptProperties[$v]);
}
$pdoFetch->addTime(\'Conditions prepared\');

// Default parameters
$default = array(
    \'class\' => $class,
    \'where\' => json_encode($where),
    \'select\' => json_encode($select),
    \'groupby\' => $class . \'.id\',
    \'sortby\' => "find_in_set(`$class`.`id`,\'" . implode(\',\', $ids) . "\')",
    \'sortdir\' => \'\',
    \'return\' => \'data\',
    \'totalVar\' => \'pdocrumbs.total\',
    \'disableConditions\' => true,
);

// Merge all properties and run!
$pdoFetch->addTime(\'Query parameters ready\');
$pdoFetch->setConfig(array_merge($default, $scriptProperties), false);
$rows = $pdoFetch->run();

$output = array();
if (!empty($rows) && is_array($rows)) {
    if (strtolower($direction) == \'ltr\') {
        $rows = array_reverse($rows);
    }

    foreach ($rows as $row) {
        if (!empty($useWeblinkUrl) && $row[\'class_key\'] == \'modWebLink\') {
            $row[\'link\'] = is_numeric(trim($row[\'content\'], \'[]~ \'))
                ? $pdoFetch->makeUrl(intval(trim($row[\'content\'], \'[]~ \')), $row)
                : $row[\'content\'];
        } else {
            $row[\'link\'] = $pdoFetch->makeUrl($row[\'id\'], $row);
        }

        $row = array_merge(
            $scriptProperties,
            $row,
            array(\'idx\' => $pdoFetch->idx++)
        );
        if (empty($row[\'menutitle\'])) {
            $row[\'menutitle\'] = $row[\'pagetitle\'];
        }

        if ($row[\'id\'] == $resource->id && empty($showCurrent)) {
            continue;
        } elseif ($row[\'id\'] == $resource->id && !empty($tplCurrent)) {
            $tpl = $tplCurrent;
        } elseif ($row[\'id\'] == $siteStart && !empty($tplHome)) {
            $tpl = $tplHome;
        } else {
            $tpl = $pdoFetch->defineChunk($row);
        }
        $output[] = empty($tpl)
            ? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
            : $pdoFetch->getChunk($tpl, $row, $fastMode);
    }
}
$pdoFetch->addTime(\'Chunks processed\');

if (count($output) == 1 && !empty($hideSingle)) {
    $pdoFetch->addTime(\'The only result was hidden, because the parameter "hideSingle" activated\');
    $output = array();
}

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="pdoCrumbsLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

if (!empty($toSeparatePlaceholders)) {
    $output[\'log\'] = $log;
    $modx->setPlaceholders($output, $toSeparatePlaceholders);
} else {
    $output = implode($outputSeparator, $output);
    if ($pdoFetch->idx >= $limit && !empty($tplMax) && !empty($output)) {
        $output = ($direction == \'ltr\')
            ? $pdoFetch->getChunk($tplMax, array(), $fastMode) . $output
            : $output . $pdoFetch->getChunk($tplMax, array(), $fastMode);
    }
    $output .= $log;

    if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
        $output = $pdoFetch->getChunk($tplWrapper, array(\'output\' => $output, \'crumbs\' => $output), $fastMode);
    }

    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
}',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'getImageList' => 
      array (
        'fields' => 
        array (
          'id' => 10,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'getImageList',
          'description' => '',
          'editor_type' => 0,
          'category' => 8,
          'cache_type' => 0,
          'snippet' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$inherit_children_tvname = $modx->getOption(\'inherit_children_tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$emptyTpl = $modx->getOption(\'emptyTpl\', $scriptProperties, \'\'); 
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\', $inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }

        if (empty($outputvalue)) {
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)) {
                foreach ($inheritFrom as $from) {
                    if ($from == \'parents\') {
                        if (!empty($inherit_children_tvname)){
                            //try to get items from optional MIGX-TV for children
                            if ($inh_tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inherit_children_tvname))) {
                                $outputvalue = $inh_tv->processInheritBinding(\'\', $docid);    
                            }
                        }
                        $outputvalue = empty($outputvalue) ? $tv->processInheritBinding(\'\', $docid) : $outputvalue;
                    } else {
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)) {
                        break;
                    }
                }
            }
        }


        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)) {
            $migx->source->initialize();
        }

    }


}

if (empty($outputvalue)) {
    $modx->setPlaceholder($totalVar, 0);
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (empty($o) && !empty($emptyTpl)) {
    $template = $migx->getTemplate($emptyTpl);
    if ($template[$emptyTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$emptyTpl]);
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$inherit_children_tvname = $modx->getOption(\'inherit_children_tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$emptyTpl = $modx->getOption(\'emptyTpl\', $scriptProperties, \'\'); 
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\', $inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }

        if (empty($outputvalue)) {
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)) {
                foreach ($inheritFrom as $from) {
                    if ($from == \'parents\') {
                        if (!empty($inherit_children_tvname)){
                            //try to get items from optional MIGX-TV for children
                            if ($inh_tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inherit_children_tvname))) {
                                $outputvalue = $inh_tv->processInheritBinding(\'\', $docid);    
                            }
                        }
                        $outputvalue = empty($outputvalue) ? $tv->processInheritBinding(\'\', $docid) : $outputvalue;
                    } else {
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)) {
                        break;
                    }
                }
            }
        }


        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)) {
            $migx->source->initialize();
        }

    }


}

if (empty($outputvalue)) {
    $modx->setPlaceholder($totalVar, 0);
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (empty($o) && !empty($emptyTpl)) {
    $template = $migx->getTemplate($emptyTpl);
    if ($template[$emptyTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$emptyTpl]);
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
      'getTicketsSections' => 
      array (
        'fields' => 
        array (
          'id' => 37,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'getTicketsSections',
          'description' => '',
          'editor_type' => 0,
          'category' => 13,
          'cache_type' => 0,
          'snippet' => '/* @var array $scriptProperties */
/* @var Tickets $Tickets */
$Tickets = $modx->getService(\'tickets\', \'Tickets\', $modx->getOption(\'tickets.core_path\', null, $modx->getOption(\'core_path\') . \'components/tickets/\') . \'model/tickets/\', $scriptProperties);
$Tickets->initialize($modx->context->key, $scriptProperties);

/** @var pdoFetch $pdoFetch */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
if ($pdoClass = $modx->loadClass($fqn, \'\', false, true)) {
	$pdoFetch = new $pdoClass($modx, $scriptProperties);
}
elseif ($pdoClass = $modx->loadClass($fqn, MODX_CORE_PATH . \'components/pdotools/model/\', false, true)) {
	$pdoFetch = new $pdoClass($modx, $scriptProperties);
}
else {
	$modx->log(modX::LOG_LEVEL_ERROR, \'Could not load pdoFetch from "MODX_CORE_PATH/components/pdotools/model/".\');
	return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');

if (isset($parents) && $parents === \'\') {
	$scriptProperties[\'parents\'] = $modx->resource->id;
}

$class = \'TicketsSection\';
$where = array(\'class_key\' => $class);

// Adding custom where parameters
if (!empty($scriptProperties[\'where\'])) {
	$tmp = $modx->fromJSON($scriptProperties[\'where\']);
	if (is_array($tmp)) {
		$where = array_merge($where, $tmp);
	}
}
unset($scriptProperties[\'where\']);
$pdoFetch->addTime(\'"Where" expression built.\');

// Joining tables
$leftJoin = array(
	\'Ticket\' => array(\'class\' => \'Ticket\', \'on\' => \'Ticket.parent=TicketsSection.id AND Ticket.published=1 AND Ticket.deleted=0 AND Ticket.class_key="Ticket"\'),
	\'View\' => array(\'class\' => \'TicketView\', \'on\' => \'Ticket.id=View.parent\'),
	//\'TicketVote\' => array(\'class\' => \'TicketVote\', \'on\' => \'icket.id=Vote.parent AND Vote.class="Ticket"\'),
);

// Fields to select
$select = array(
	\'TicketsSection\' => !empty($includeContent)
		? $modx->getSelectColumns($class, $class)
		: $modx->getSelectColumns($class, $class, \'\', array(\'content\'), true),
	\'Ticket\' => \'COUNT(DISTINCT `Ticket`.`id`) as `tickets`\',
	\'View\' => \'COUNT(`View`.`parent`) as `views`\',
	//,\'Vote\' => \'SUM(DISTINCT `Vote`.`value`) as `votes`\'
);

$default = array(
	\'class\' => $class,
	\'where\' => $modx->toJSON($where),
	\'leftJoin\' => $modx->toJSON($leftJoin),
	\'select\' => $modx->toJSON($select),
	\'groupby\' => $class . \'.id\',
	\'sortby\' => \'views\',
	\'sortdir\' => \'DESC\',
	\'return\' => !empty($returnIds)
		? \'ids\'
		: \'data\',
	\'nestedChunkPrefix\' => \'tickets_\',
);

// Merge all properties and run!
$pdoFetch->setConfig(array_merge($default, $scriptProperties));
$pdoFetch->addTime(\'Query parameters are prepared.\');
$rows = $pdoFetch->run();

if (!empty($returnIds)) {
	return $rows;
}

// Processing rows
$output = array();
if (!empty($rows) && is_array($rows)) {
	foreach ($rows as $k => $row) {
		// Processing main fields
		$add = $pdoFetch->getObject(\'TicketThread\', array(\'deleted\' => 0), array(
			\'innerJoin\' => array(
				\'Ticket\' => array(\'class\' => \'Ticket\', \'on\' => \'Ticket.id = TicketThread.resource AND Ticket.published=1 AND Ticket.deleted=0 AND Ticket.class_key="Ticket" AND Ticket.parent=\' . $row[\'id\']),
			),
			\'select\' => array(
				\'TicketThread\' => \'SUM(TicketThread.comments) as `comments`\'
			)
		));

		$row[\'comments\'] = !empty($add[\'comments\'])
			? $add[\'comments\']
			: 0;
		$row[\'date_ago\'] = $Tickets->dateFormat($row[\'createdon\']);

		$row[\'idx\'] = $pdoFetch->idx++;
		// Processing chunk
		$tpl = $pdoFetch->defineChunk($row);
		$output[] = empty($tpl)
			? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
			: $pdoFetch->getChunk($tpl, $row, $pdoFetch->config[\'fastMode\']);
	}
}
$pdoFetch->addTime(\'Returning processed chunks\');
if (empty($outputSeparator)) {
	$outputSeparator = "\\n";
}
$output = implode($outputSeparator, $output);

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
	$log .= \'<pre class="getSectionsLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

// Return output
if (!empty($toSeparatePlaceholders)) {
	$output[\'log\'] = $log;
	$modx->setPlaceholders($output, $toSeparatePlaceholders);
}
else {
	$output .= $log;

	if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
		$output = $pdoFetch->getChunk($tplWrapper, array(\'output\' => $output), $pdoFetch->config[\'fastMode\']);
	}

	if (!empty($toPlaceholder)) {
		$modx->setPlaceholder($toPlaceholder, $output);
	}
	else {
		return $output;
	}
}',
          'locked' => false,
          'properties' => 
          array (
            'tpl' => 
            array (
              'name' => 'tpl',
              'desc' => 'tickets_prop_tpl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.sections.row',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления для каждого результата',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'tickets_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 10,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Лимит выборки результатов',
              'area_trans' => '',
            ),
            'offset' => 
            array (
              'name' => 'offset',
              'desc' => 'tickets_prop_offset',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Пропуск результатов с начала выборки',
              'area_trans' => '',
            ),
            'depth' => 
            array (
              'name' => 'depth',
              'desc' => 'tickets_prop_depth',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Глубина поиска ресурсов от каждого родителя.',
              'area_trans' => '',
            ),
            'parents' => 
            array (
              'name' => 'parents',
              'desc' => 'tickets_prop_parents',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Список категорий, через запятую, для поиска результатов. По умолчанию выборка ограничена текущим родителем. Если поставить 0 - выборка не ограничивается.',
              'area_trans' => '',
            ),
            'resources' => 
            array (
              'name' => 'resources',
              'desc' => 'tickets_prop_resources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Список ресурсов, через запятую, для вывода в результатах. Если id ресурса начинается с минуса, этот ресурс исключается из выборки.',
              'area_trans' => '',
            ),
            'sortby' => 
            array (
              'name' => 'sortby',
              'desc' => 'tickets_prop_sortby',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'views',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Сортировка выборки.',
              'area_trans' => '',
            ),
            'sortdir' => 
            array (
              'name' => 'sortdir',
              'desc' => 'tickets_prop_sortdir',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'ASC',
                  'value' => 'ASC',
                  'name' => 'ASC',
                ),
                1 => 
                array (
                  'text' => 'DESC',
                  'value' => 'DESC',
                  'name' => 'DESC',
                ),
              ),
              'value' => 'DESC',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Направление сортировки',
              'area_trans' => '',
            ),
            'includeContent' => 
            array (
              'name' => 'includeContent',
              'desc' => 'tickets_prop_includeContent',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Выбирать поле "content" у ресурсов.',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'tickets_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'includeTVs' => 
            array (
              'name' => 'includeTVs',
              'desc' => 'tickets_prop_includeTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров для выборки, через запятую. Например: "action,time" дадут плейсхолдеры [[+action]] и [[+time]].',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'tickets_prop_where',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Строка, закодированная в JSON, с дополнительными условиями выборки.',
              'area_trans' => '',
            ),
            'tvPrefix' => 
            array (
              'name' => 'tvPrefix',
              'desc' => 'tickets_prop_tvPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Префикс для ТВ плейсхолдеров, например "tv.". По умолчанию параметр пуст.',
              'area_trans' => '',
            ),
            'outputSeparator' => 
            array (
              'name' => 'outputSeparator',
              'desc' => 'tickets_prop_outputSeparator',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '
',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Необязательная строка для разделения результатов работы.',
              'area_trans' => '',
            ),
            'showLog' => 
            array (
              'name' => 'showLog',
              'desc' => 'tickets_prop_showLog',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контекте "mgr".',
              'area_trans' => '',
            ),
            'fastMode' => 
            array (
              'name' => 'fastMode',
              'desc' => 'tickets_prop_fastMode',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Если включено - в чанк результата будут подставлены только значения из БД. Все необработанные теги MODX, такие как фильтры, вызов сниппетов и другие - будут вырезаны.',
              'area_trans' => '',
            ),
            'showUnpublished' => 
            array (
              'name' => 'showUnpublished',
              'desc' => 'tickets_prop_showUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Показывать неопубликованные ресурсы.',
              'area_trans' => '',
            ),
            'showDeleted' => 
            array (
              'name' => 'showDeleted',
              'desc' => 'tickets_prop_showDeleted',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Показывать удалённые ресурсы.',
              'area_trans' => '',
            ),
            'showHidden' => 
            array (
              'name' => 'showHidden',
              'desc' => 'tickets_prop_showHidden',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Показывать ресурсы, скрытые в меню.',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/tickets/elements/snippets/snippet.get_sections.php',
          'content' => '/* @var array $scriptProperties */
/* @var Tickets $Tickets */
$Tickets = $modx->getService(\'tickets\', \'Tickets\', $modx->getOption(\'tickets.core_path\', null, $modx->getOption(\'core_path\') . \'components/tickets/\') . \'model/tickets/\', $scriptProperties);
$Tickets->initialize($modx->context->key, $scriptProperties);

/** @var pdoFetch $pdoFetch */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
if ($pdoClass = $modx->loadClass($fqn, \'\', false, true)) {
	$pdoFetch = new $pdoClass($modx, $scriptProperties);
}
elseif ($pdoClass = $modx->loadClass($fqn, MODX_CORE_PATH . \'components/pdotools/model/\', false, true)) {
	$pdoFetch = new $pdoClass($modx, $scriptProperties);
}
else {
	$modx->log(modX::LOG_LEVEL_ERROR, \'Could not load pdoFetch from "MODX_CORE_PATH/components/pdotools/model/".\');
	return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');

if (isset($parents) && $parents === \'\') {
	$scriptProperties[\'parents\'] = $modx->resource->id;
}

$class = \'TicketsSection\';
$where = array(\'class_key\' => $class);

// Adding custom where parameters
if (!empty($scriptProperties[\'where\'])) {
	$tmp = $modx->fromJSON($scriptProperties[\'where\']);
	if (is_array($tmp)) {
		$where = array_merge($where, $tmp);
	}
}
unset($scriptProperties[\'where\']);
$pdoFetch->addTime(\'"Where" expression built.\');

// Joining tables
$leftJoin = array(
	\'Ticket\' => array(\'class\' => \'Ticket\', \'on\' => \'Ticket.parent=TicketsSection.id AND Ticket.published=1 AND Ticket.deleted=0 AND Ticket.class_key="Ticket"\'),
	\'View\' => array(\'class\' => \'TicketView\', \'on\' => \'Ticket.id=View.parent\'),
	//\'TicketVote\' => array(\'class\' => \'TicketVote\', \'on\' => \'icket.id=Vote.parent AND Vote.class="Ticket"\'),
);

// Fields to select
$select = array(
	\'TicketsSection\' => !empty($includeContent)
		? $modx->getSelectColumns($class, $class)
		: $modx->getSelectColumns($class, $class, \'\', array(\'content\'), true),
	\'Ticket\' => \'COUNT(DISTINCT `Ticket`.`id`) as `tickets`\',
	\'View\' => \'COUNT(`View`.`parent`) as `views`\',
	//,\'Vote\' => \'SUM(DISTINCT `Vote`.`value`) as `votes`\'
);

$default = array(
	\'class\' => $class,
	\'where\' => $modx->toJSON($where),
	\'leftJoin\' => $modx->toJSON($leftJoin),
	\'select\' => $modx->toJSON($select),
	\'groupby\' => $class . \'.id\',
	\'sortby\' => \'views\',
	\'sortdir\' => \'DESC\',
	\'return\' => !empty($returnIds)
		? \'ids\'
		: \'data\',
	\'nestedChunkPrefix\' => \'tickets_\',
);

// Merge all properties and run!
$pdoFetch->setConfig(array_merge($default, $scriptProperties));
$pdoFetch->addTime(\'Query parameters are prepared.\');
$rows = $pdoFetch->run();

if (!empty($returnIds)) {
	return $rows;
}

// Processing rows
$output = array();
if (!empty($rows) && is_array($rows)) {
	foreach ($rows as $k => $row) {
		// Processing main fields
		$add = $pdoFetch->getObject(\'TicketThread\', array(\'deleted\' => 0), array(
			\'innerJoin\' => array(
				\'Ticket\' => array(\'class\' => \'Ticket\', \'on\' => \'Ticket.id = TicketThread.resource AND Ticket.published=1 AND Ticket.deleted=0 AND Ticket.class_key="Ticket" AND Ticket.parent=\' . $row[\'id\']),
			),
			\'select\' => array(
				\'TicketThread\' => \'SUM(TicketThread.comments) as `comments`\'
			)
		));

		$row[\'comments\'] = !empty($add[\'comments\'])
			? $add[\'comments\']
			: 0;
		$row[\'date_ago\'] = $Tickets->dateFormat($row[\'createdon\']);

		$row[\'idx\'] = $pdoFetch->idx++;
		// Processing chunk
		$tpl = $pdoFetch->defineChunk($row);
		$output[] = empty($tpl)
			? \'<pre>\' . $pdoFetch->getChunk(\'\', $row) . \'</pre>\'
			: $pdoFetch->getChunk($tpl, $row, $pdoFetch->config[\'fastMode\']);
	}
}
$pdoFetch->addTime(\'Returning processed chunks\');
if (empty($outputSeparator)) {
	$outputSeparator = "\\n";
}
$output = implode($outputSeparator, $output);

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
	$log .= \'<pre class="getSectionsLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

// Return output
if (!empty($toSeparatePlaceholders)) {
	$output[\'log\'] = $log;
	$modx->setPlaceholders($output, $toSeparatePlaceholders);
}
else {
	$output .= $log;

	if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
		$output = $pdoFetch->getChunk($tplWrapper, array(\'output\' => $output), $pdoFetch->config[\'fastMode\']);
	}

	if (!empty($toPlaceholder)) {
		$modx->setPlaceholder($toPlaceholder, $output);
	}
	else {
		return $output;
	}
}',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'pdoResources' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'pdoResources',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
if (isset($parents) && $parents === \'\') {
    $scriptProperties[\'parents\'] = $modx->resource->id;
}
if (!empty($returnIds)) {
    $scriptProperties[\'return\'] = \'ids\';
}

// Adding extra parameters into special place so we can put them in a results
/** @var modSnippet $snippet */
$additionalPlaceholders = $properties = array();
if (isset($this) && $this instanceof modSnippet) {
    $properties = $this->get(\'properties\');
}
elseif ($snippet = $modx->getObject(\'modSnippet\', array(\'name\' => \'pdoResources\'))) {
    $properties = $snippet->get(\'properties\');
}
if (!empty($properties)) {
    foreach ($scriptProperties as $k => $v) {
        if (!isset($properties[$k])) {
            $additionalPlaceholders[$k] = $v;
        }
    }
}
$scriptProperties[\'additionalPlaceholders\'] = $additionalPlaceholders;

/** @var pdoFetch $pdoFetch */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
$path = $modx->getOption(\'pdofetch_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoFetch = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');
$output = $pdoFetch->run();

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="pdoResourcesLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

// Return output
if (!empty($returnIds)) {
    $modx->setPlaceholder(\'pdoResources.log\', $log);
    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
} elseif (!empty($toSeparatePlaceholders)) {
    $output[\'log\'] = $log;
    $modx->setPlaceholders($output, $toSeparatePlaceholders);
} else {
    $output .= $log;

    if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
        $output = $pdoFetch->getChunk($tplWrapper, array_merge($additionalPlaceholders, array(\'output\' => $output)),
            $pdoFetch->config[\'fastMode\']);
    }

    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
}',
          'locked' => false,
          'properties' => 
          array (
            'tpl' => 
            array (
              'name' => 'tpl',
              'desc' => 'pdotools_prop_tpl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для оформления ресурса. Если не указан, то содержимое полей ресурса будет распечатано на экран.',
              'area_trans' => '',
            ),
            'returnIds' => 
            array (
              'name' => 'returnIds',
              'desc' => 'pdotools_prop_returnIds',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Возвращать строку со списком id ресурсов, вместо оформленных результатов.',
              'area_trans' => '',
            ),
            'showLog' => 
            array (
              'name' => 'showLog',
              'desc' => 'pdotools_prop_showLog',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контекте "mgr".',
              'area_trans' => '',
            ),
            'fastMode' => 
            array (
              'name' => 'fastMode',
              'desc' => 'pdotools_prop_fastMode',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Быстрый режим обработки чанков. Все необработанные теги (условия, сниппеты и т.п.) будут вырезаны.',
              'area_trans' => '',
            ),
            'sortby' => 
            array (
              'name' => 'sortby',
              'desc' => 'pdotools_prop_sortby',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'publishedon',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Любое поле ресурса для сортировки, включая ТВ параметр, если он указан в параметре "includeTVs". Можно указывать JSON строку с массивом нескольких полей. Для случайно сортировки укажите "RAND()"',
              'area_trans' => '',
            ),
            'sortbyTV' => 
            array (
              'name' => 'sortbyTV',
              'desc' => 'pdotools_prop_sortbyTV',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Сортировка по ТВ параметру. Если он не указан в &includeTVs, то будет подключен автоматически.',
              'area_trans' => '',
            ),
            'sortbyTVType' => 
            array (
              'name' => 'sortbyTVType',
              'desc' => 'pdotools_prop_sortbyTVType',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Тип сортировки по ТВ параметру. Возможные варианты: string, integer, decimal и datetime. Если пусто, то ТВ будет отсортирован в зависимости от его типа: как текст, число или дата.',
              'area_trans' => '',
            ),
            'sortdir' => 
            array (
              'name' => 'sortdir',
              'desc' => 'pdotools_prop_sortdir',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'ASC',
                  'value' => 'ASC',
                  'name' => 'ASC',
                ),
                1 => 
                array (
                  'text' => 'DESC',
                  'value' => 'DESC',
                  'name' => 'DESC',
                ),
              ),
              'value' => 'DESC',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Направление сортировки: по убыванию или возрастанию.',
              'area_trans' => '',
            ),
            'sortdirTV' => 
            array (
              'name' => 'sortdirTV',
              'desc' => 'pdotools_prop_sortdirTV',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'ASC',
                  'value' => 'ASC',
                  'name' => 'ASC',
                ),
                1 => 
                array (
                  'text' => 'DESC',
                  'value' => 'DESC',
                  'name' => 'DESC',
                ),
              ),
              'value' => 'ASC',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Направление сортировки ТВ: по убыванию или возрастанию. Если не указан, то будет равен параметру &sortdir.',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'pdotools_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 10,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение количества результатов выборки. Можно использовать "0".',
              'area_trans' => '',
            ),
            'offset' => 
            array (
              'name' => 'offset',
              'desc' => 'pdotools_prop_offset',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Пропуск результатов от начала.',
              'area_trans' => '',
            ),
            'depth' => 
            array (
              'name' => 'depth',
              'desc' => 'pdotools_prop_depth',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 10,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Глубина поиска дочерних ресурсов от родителя.',
              'area_trans' => '',
            ),
            'outputSeparator' => 
            array (
              'name' => 'outputSeparator',
              'desc' => 'pdotools_prop_outputSeparator',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '
',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Необязательная строка для разделения результатов работы.',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'pdotools_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'parents' => 
            array (
              'name' => 'parents',
              'desc' => 'pdotools_prop_parents',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список родителей, через запятую, для поиска результатов. По умолчанию выборка ограничена текущим родителем. Если поставить 0 - выборка не ограничивается. Если id родителя начинается с дефиса, он и его потомки исключается из выборки.',
              'area_trans' => '',
            ),
            'includeContent' => 
            array (
              'name' => 'includeContent',
              'desc' => 'pdotools_prop_includeContent',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включаем поле "content" в выборку.',
              'area_trans' => '',
            ),
            'includeTVs' => 
            array (
              'name' => 'includeTVs',
              'desc' => 'pdotools_prop_includeTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров для выборки, через запятую. Например: "action,time" дадут плейсхолдеры [[+action]] и [[+time]].',
              'area_trans' => '',
            ),
            'prepareTVs' => 
            array (
              'name' => 'prepareTVs',
              'desc' => 'pdotools_prop_prepareTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '1',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров, которые нужно подготовить перед выводом. По умолчанию, установлено в "1", что означает подготовку всех ТВ, указанных в "&includeTVs=``"',
              'area_trans' => '',
            ),
            'processTVs' => 
            array (
              'name' => 'processTVs',
              'desc' => 'pdotools_prop_processTVs',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ТВ параметров, которые нужно обработать перед выводом. Если установить в "1" - будут обработаны все ТВ, указанные в "&includeTVs=``". По умолчанию параметр пуст.',
              'area_trans' => '',
            ),
            'tvPrefix' => 
            array (
              'name' => 'tvPrefix',
              'desc' => 'pdotools_prop_tvPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tv.',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс для ТВ параметров.',
              'area_trans' => '',
            ),
            'tvFilters' => 
            array (
              'name' => 'tvFilters',
              'desc' => 'pdotools_prop_tvFilters',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список фильтров по ТВ, с разделителями AND и OR. Разделитель, указанный в параметре "&tvFiltersOrDelimiter" представляет логическое условие OR и по нему условия группируются в первую очередь.  Внутри каждой группы вы можете задать список значений, разделив их "&tvFiltersAndDelimiter". Поиск значений может проводиться в каком-то конкретном ТВ, если он указан ("myTV==value"), или в любом ("value"). Пример вызова: "&tvFilters=`filter2==one,filter1==bar%||filter1==foo`". <br />Обратите внимание: фильтрация использует оператор LIKE и знак "%" является метасимволом. <br />И еще: Поиск идёт по значениям, которые физически находятся в БД, то есть, сюда не подставляются значения по умолчанию из настроек ТВ.',
              'area_trans' => '',
            ),
            'tvFiltersAndDelimiter' => 
            array (
              'name' => 'tvFiltersAndDelimiter',
              'desc' => 'pdotools_prop_tvFiltersAndDelimiter',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => ',',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Разделитель для условий AND в параметре "&tvFilters". По умолчанию: ",".',
              'area_trans' => '',
            ),
            'tvFiltersOrDelimiter' => 
            array (
              'name' => 'tvFiltersOrDelimiter',
              'desc' => 'pdotools_prop_tvFiltersOrDelimiter',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '||',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Разделитель для условий OR в параметре "&tvFilters". По умолчанию: "||".',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'pdotools_prop_where',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Массив дополнительных параметров выборки, закодированный в JSON.',
              'area_trans' => '',
            ),
            'showUnpublished' => 
            array (
              'name' => 'showUnpublished',
              'desc' => 'pdotools_prop_showUnpublished',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать неопубликованные ресурсы.',
              'area_trans' => '',
            ),
            'showDeleted' => 
            array (
              'name' => 'showDeleted',
              'desc' => 'pdotools_prop_showDeleted',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать удалённые ресурсы.',
              'area_trans' => '',
            ),
            'showHidden' => 
            array (
              'name' => 'showHidden',
              'desc' => 'pdotools_prop_showHidden',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Показывать ресурсы, скрытые в меню.',
              'area_trans' => '',
            ),
            'hideContainers' => 
            array (
              'name' => 'hideContainers',
              'desc' => 'pdotools_prop_hideContainers',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Отключает вывод контейнеров, то есть, ресурсов с isfolder = 1.',
              'area_trans' => '',
            ),
            'context' => 
            array (
              'name' => 'context',
              'desc' => 'pdotools_prop_context',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение выборки по контексту ресурсов.',
              'area_trans' => '',
            ),
            'idx' => 
            array (
              'name' => 'idx',
              'desc' => 'pdotools_prop_idx',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Вы можете указать стартовый номер итерации вывода результатов.',
              'area_trans' => '',
            ),
            'first' => 
            array (
              'name' => 'first',
              'desc' => 'pdotools_prop_first',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Номер первой итерации вывода результатов.',
              'area_trans' => '',
            ),
            'last' => 
            array (
              'name' => 'last',
              'desc' => 'pdotools_prop_last',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Номер последней итерации вывода результатов. По умолчанию он рассчитается автоматически, по формуле (total + first - 1).',
              'area_trans' => '',
            ),
            'tplFirst' => 
            array (
              'name' => 'tplFirst',
              'desc' => 'pdotools_prop_tplFirst',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для первого ресурса в результатах.',
              'area_trans' => '',
            ),
            'tplLast' => 
            array (
              'name' => 'tplLast',
              'desc' => 'pdotools_prop_tplLast',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для последнего ресурса в результатах.',
              'area_trans' => '',
            ),
            'tplOdd' => 
            array (
              'name' => 'tplOdd',
              'desc' => 'pdotools_prop_tplOdd',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя чанка для каждого второго ресурса.',
              'area_trans' => '',
            ),
            'tplWrapper' => 
            array (
              'name' => 'tplWrapper',
              'desc' => 'pdotools_prop_tplWrapper',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк-обёртка, для заворачивания всех результатов. Понимает один плейсхолдер: [[+output]]. Не работает вместе с параметром "toSeparatePlaceholders".',
              'area_trans' => '',
            ),
            'wrapIfEmpty' => 
            array (
              'name' => 'wrapIfEmpty',
              'desc' => 'pdotools_prop_wrapIfEmpty',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включает вывод чанка-обертки (tplWrapper) даже если результатов нет.',
              'area_trans' => '',
            ),
            'totalVar' => 
            array (
              'name' => 'totalVar',
              'desc' => 'pdotools_prop_totalVar',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'total',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя плейсхолдера для сохранения общего количества результатов.',
              'area_trans' => '',
            ),
            'resources' => 
            array (
              'name' => 'resources',
              'desc' => 'pdotools_prop_resources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список ресурсов, через запятую, для вывода в результатах. Если id ресурса начинается с дефиса, этот ресурс исключается из выборки.',
              'area_trans' => '',
            ),
            'tplCondition' => 
            array (
              'name' => 'tplCondition',
              'desc' => 'pdotools_prop_tplCondition',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Поле ресурса, из которого будет получено значение для выбора чанка по условию в "conditionalTpls".',
              'area_trans' => '',
            ),
            'tplOperator' => 
            array (
              'name' => 'tplOperator',
              'desc' => 'pdotools_prop_tplOperator',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'is equal to',
                  'value' => '==',
                  'name' => 'is equal to',
                ),
                1 => 
                array (
                  'text' => 'is not equal to',
                  'value' => '!=',
                  'name' => 'is not equal to',
                ),
                2 => 
                array (
                  'text' => 'less than',
                  'value' => '<',
                  'name' => 'less than',
                ),
                3 => 
                array (
                  'text' => 'less than or equal to',
                  'value' => '<=',
                  'name' => 'less than or equal to',
                ),
                4 => 
                array (
                  'text' => 'greater than or equal to',
                  'value' => '>=',
                  'name' => 'greater than or equal to',
                ),
                5 => 
                array (
                  'text' => 'is empty',
                  'value' => 'empty',
                  'name' => 'is empty',
                ),
                6 => 
                array (
                  'text' => 'is not empty',
                  'value' => '!empty',
                  'name' => 'is not empty',
                ),
                7 => 
                array (
                  'text' => 'is null',
                  'value' => 'null',
                  'name' => 'is null',
                ),
                8 => 
                array (
                  'text' => 'is in array',
                  'value' => 'inarray',
                  'name' => 'is in array',
                ),
                9 => 
                array (
                  'text' => 'is between',
                  'value' => 'between',
                  'name' => 'is between',
                ),
              ),
              'value' => '==',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Необязательный оператор для проведения сравнения поля ресурса в "tplCondition" с массивом значений и чанков в "conditionalTpls".',
              'area_trans' => '',
            ),
            'conditionalTpls' => 
            array (
              'name' => 'conditionalTpls',
              'desc' => 'pdotools_prop_conditionalTpls',
              'type' => 'textarea',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'JSON строка с массивом, у которого в ключах указано то, с чем будет сравниваться "tplCondition", а в значениях - чанки, которые будут использованы для вывода, если сравнение будет успешно. Оператор сравнения указывается в "tplOperator". Для операторов типа "isempty" можно использовать массив без ключей.',
              'area_trans' => '',
            ),
            'select' => 
            array (
              'name' => 'select',
              'desc' => 'pdotools_prop_select',
              'type' => 'textarea',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список полей для выборки, через запятую. Можно указывать JSON строку с массивом, например {"modResource":"id,pagetitle,content"}.',
              'area_trans' => '',
            ),
            'toSeparatePlaceholders' => 
            array (
              'name' => 'toSeparatePlaceholders',
              'desc' => 'pdotools_prop_toSeparatePlaceholders',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Если вы укажете слово в этом параметре, то ВСЕ результаты будут выставлены в разные плейсхолдеры, начинающиеся с этого слова и заканчивающиеся порядковым номером строки, от нуля. Например, указав в параметре "myPl", вы получите плейсхолдеры [[+myPl0]], [[+myPl1]] и т.д.',
              'area_trans' => '',
            ),
            'loadModels' => 
            array (
              'name' => 'loadModels',
              'desc' => 'pdotools_prop_loadModels',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Список компонентов, через запятую, чьи модели нужно загрузить для построения запроса. Например: "&loadModels=`ms2gallery,msearch2`".',
              'area_trans' => '',
            ),
            'scheme' => 
            array (
              'name' => 'scheme',
              'desc' => 'pdotools_prop_scheme',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => '',
                  'text' => 'System default',
                  'name' => 'System default',
                ),
                1 => 
                array (
                  'value' => -1,
                  'text' => '-1 (relative to site_url)',
                  'name' => '-1 (relative to site_url)',
                ),
                2 => 
                array (
                  'value' => 'full',
                  'text' => 'full (absolute, prepended with site_url)',
                  'name' => 'full (absolute, prepended with site_url)',
                ),
                3 => 
                array (
                  'value' => 'abs',
                  'text' => 'abs (absolute, prepended with base_url)',
                  'name' => 'abs (absolute, prepended with base_url)',
                ),
                4 => 
                array (
                  'value' => 'http',
                  'text' => 'http (absolute, forced to http scheme)',
                  'name' => 'http (absolute, forced to http scheme)',
                ),
                5 => 
                array (
                  'value' => 'https',
                  'text' => 'https (absolute, forced to https scheme)',
                  'name' => 'https (absolute, forced to https scheme)',
                ),
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Схема формирования ссылок: "uri" для подстановки поля uri документа (очень быстро) или параметр для modX::makeUrl().',
              'area_trans' => '',
            ),
            'useWeblinkUrl' => 
            array (
              'name' => 'useWeblinkUrl',
              'desc' => 'pdotools_prop_useWeblinkUrl',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Генерировать ссылку с учетом класса ресурса.',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/pdotools/elements/snippets/snippet.pdoresources.php',
          'content' => '/** @var array $scriptProperties */
if (isset($parents) && $parents === \'\') {
    $scriptProperties[\'parents\'] = $modx->resource->id;
}
if (!empty($returnIds)) {
    $scriptProperties[\'return\'] = \'ids\';
}

// Adding extra parameters into special place so we can put them in a results
/** @var modSnippet $snippet */
$additionalPlaceholders = $properties = array();
if (isset($this) && $this instanceof modSnippet) {
    $properties = $this->get(\'properties\');
}
elseif ($snippet = $modx->getObject(\'modSnippet\', array(\'name\' => \'pdoResources\'))) {
    $properties = $snippet->get(\'properties\');
}
if (!empty($properties)) {
    foreach ($scriptProperties as $k => $v) {
        if (!isset($properties[$k])) {
            $additionalPlaceholders[$k] = $v;
        }
    }
}
$scriptProperties[\'additionalPlaceholders\'] = $additionalPlaceholders;

/** @var pdoFetch $pdoFetch */
$fqn = $modx->getOption(\'pdoFetch.class\', null, \'pdotools.pdofetch\', true);
$path = $modx->getOption(\'pdofetch_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoFetch = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoFetch->addTime(\'pdoTools loaded\');
$output = $pdoFetch->run();

$log = \'\';
if ($modx->user->hasSessionContext(\'mgr\') && !empty($showLog)) {
    $log .= \'<pre class="pdoResourcesLog">\' . print_r($pdoFetch->getTime(), 1) . \'</pre>\';
}

// Return output
if (!empty($returnIds)) {
    $modx->setPlaceholder(\'pdoResources.log\', $log);
    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
} elseif (!empty($toSeparatePlaceholders)) {
    $output[\'log\'] = $log;
    $modx->setPlaceholders($output, $toSeparatePlaceholders);
} else {
    $output .= $log;

    if (!empty($tplWrapper) && (!empty($wrapIfEmpty) || !empty($output))) {
        $output = $pdoFetch->getChunk($tplWrapper, array_merge($additionalPlaceholders, array(\'output\' => $output)),
            $pdoFetch->config[\'fastMode\']);
    }

    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $output);
    } else {
        return $output;
    }
}',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'MinifyX' => 
      array (
        'fields' => 
        array (
          'id' => 55,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'MinifyX',
          'description' => 'MinifyX is a snippet the allows you to combine and minify JS and CSS files',
          'editor_type' => 0,
          'category' => 21,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
if (!$modx->getService(\'minifyx\',\'MinifyX\', MODX_CORE_PATH.\'components/minifyx/model/minifyx/\')) {return;}
/** @var MinifyX $MinifyX */
$MinifyX = new MinifyX($modx, $scriptProperties);
if (!$MinifyX->prepareCacheFolder()) {
	$modx->log(modX::LOG_LEVEL_ERROR, \'[MinifyX] Could not create cache dir "\'.$MinifyX->config[\'cacheFolder\'].\'"\');
	return;
}
$cacheFolderUrl = MODX_BASE_URL . str_replace(MODX_BASE_PATH, \'\', $MinifyX->config[\'cacheFolder\']);

$array = array(
	\'js\' => trim($modx->getOption(\'jsSources\', $scriptProperties, \'\', true)),
	\'css\' => trim($modx->getOption(\'cssSources\', $scriptProperties, \'\', true)),
);

foreach ($array as $type => $value) {
	if (empty($value)) {continue;}
	$filename = $MinifyX->config[$type.\'Filename\'] . \'_\';
	$extension = $MinifyX->config[$type.\'Ext\'];
	$register = $MinifyX->config[\'register\'.ucfirst($type)];
	$placeholder = !empty($MinifyX->config[$type.\'Placeholder\'])
		? $MinifyX->config[$type.\'Placeholder\']
		: \'\';

	$files = $MinifyX->prepareFiles($value);
	$properties = array(
		\'minify\' => $MinifyX->config[\'minify\'.ucfirst($type)]
				? \'true\'
				: \'false\',
	);

	$result = $MinifyX->Munee($files, $properties);
	$file = $MinifyX->saveFile($result, $filename, $extension);

	// Register file on frontend
	if (!empty($file) && file_exists($MinifyX->config[\'cacheFolder\'] . $file)) {
		if ($register == \'placeholder\' && $placeholder) {
			$tag = $type == \'css\'
				? \'<link rel="stylesheet" href="\' . $cacheFolderUrl .  $file . \'" type="text/css" />\'
				: \'<script type="text/javascript" src="\' . $cacheFolderUrl . $file . \'"></script>\';
			$modx->setPlaceholder($placeholder, $tag);
		}
		else {
			if ($type == \'css\') {
				$modx->regClientCSS($cacheFolderUrl . $file);
			}
			else {
				if ($register == \'startup\') {
					$modx->regClientStartupScript($cacheFolderUrl . $file);
				}
				else {
					$modx->regClientScript($cacheFolderUrl . $file);
				}
			}
		}
	}
}
return;',
          'locked' => false,
          'properties' => 
          array (
            'jsSources' => 
            array (
              'name' => 'jsSources',
              'desc' => 'minifyx_prop_jsSources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Список JS файлов для обработки. Можно указывать *.js и *.coffee.',
              'area_trans' => '',
            ),
            'cssSources' => 
            array (
              'name' => 'cssSources',
              'desc' => 'minifyx_prop_cssSources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Список CSS файлов для обработки. Можно указывать *.css, *.less и *.scss.',
              'area_trans' => '',
            ),
            'minifyJs' => 
            array (
              'name' => 'minifyJs',
              'desc' => 'minifyx_prop_minifyJs',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Включить минификацию JS?',
              'area_trans' => '',
            ),
            'minifyCss' => 
            array (
              'name' => 'minifyCss',
              'desc' => 'minifyx_prop_minifyCss',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Включить минификацию CSS?',
              'area_trans' => '',
            ),
            'jsFilename' => 
            array (
              'name' => 'jsFilename',
              'desc' => 'minifyx_prop_jsFilename',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'scripts',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Базовое имя готового JS файла.',
              'area_trans' => '',
            ),
            'cssFilename' => 
            array (
              'name' => 'cssFilename',
              'desc' => 'minifyx_prop_cssFilename',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'styles',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Базовое имя готового CSS файла.',
              'area_trans' => '',
            ),
            'registerJs' => 
            array (
              'name' => 'registerJs',
              'desc' => 'minifyx_prop_registerJs',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => 'placeholder',
                  'text' => 'Placeholder',
                  'name' => 'Placeholder',
                ),
                1 => 
                array (
                  'value' => 'startup',
                  'text' => 'Startup script',
                  'name' => 'Startup script',
                ),
                2 => 
                array (
                  'value' => 'default',
                  'text' => 'Default',
                  'name' => 'Default',
                ),
              ),
              'value' => 'placeholder',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Подключение javascript: можно сохранить в плейсхолдер (placeholder), вызвать в теге "head" (startup) или разместить перед закрывающим "body" (default).',
              'area_trans' => '',
            ),
            'jsPlaceholder' => 
            array (
              'name' => 'jsPlaceholder',
              'desc' => 'minifyx_prop_jsPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'MinifyX.javascript',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Имя плейсхолдера javascript. Используется, если &registerJs=`placeholder`',
              'area_trans' => '',
            ),
            'registerCss' => 
            array (
              'name' => 'registerCss',
              'desc' => 'minifyx_prop_registerCss',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'value' => 'placeholder',
                  'text' => 'Placeholder',
                  'name' => 'Placeholder',
                ),
                1 => 
                array (
                  'value' => 'default',
                  'text' => 'Default',
                  'name' => 'Default',
                ),
              ),
              'value' => 'placeholder',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Подключение сss: можно сохранить в плейсхолдер (placeholder) или вызвать в теге "head" (default).',
              'area_trans' => '',
            ),
            'cssPlaceholder' => 
            array (
              'name' => 'cssPlaceholder',
              'desc' => 'minifyx_prop_cssPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'MinifyX.css',
              'lexicon' => 'minifyx:properties',
              'area' => '',
              'desc_trans' => 'Имя плейсхолдера css. Используется,если &registerCss=`placeholder`',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/minifyx/elements/snippets/snippet.minifyx.php',
          'content' => '/** @var array $scriptProperties */
if (!$modx->getService(\'minifyx\',\'MinifyX\', MODX_CORE_PATH.\'components/minifyx/model/minifyx/\')) {return;}
/** @var MinifyX $MinifyX */
$MinifyX = new MinifyX($modx, $scriptProperties);
if (!$MinifyX->prepareCacheFolder()) {
	$modx->log(modX::LOG_LEVEL_ERROR, \'[MinifyX] Could not create cache dir "\'.$MinifyX->config[\'cacheFolder\'].\'"\');
	return;
}
$cacheFolderUrl = MODX_BASE_URL . str_replace(MODX_BASE_PATH, \'\', $MinifyX->config[\'cacheFolder\']);

$array = array(
	\'js\' => trim($modx->getOption(\'jsSources\', $scriptProperties, \'\', true)),
	\'css\' => trim($modx->getOption(\'cssSources\', $scriptProperties, \'\', true)),
);

foreach ($array as $type => $value) {
	if (empty($value)) {continue;}
	$filename = $MinifyX->config[$type.\'Filename\'] . \'_\';
	$extension = $MinifyX->config[$type.\'Ext\'];
	$register = $MinifyX->config[\'register\'.ucfirst($type)];
	$placeholder = !empty($MinifyX->config[$type.\'Placeholder\'])
		? $MinifyX->config[$type.\'Placeholder\']
		: \'\';

	$files = $MinifyX->prepareFiles($value);
	$properties = array(
		\'minify\' => $MinifyX->config[\'minify\'.ucfirst($type)]
				? \'true\'
				: \'false\',
	);

	$result = $MinifyX->Munee($files, $properties);
	$file = $MinifyX->saveFile($result, $filename, $extension);

	// Register file on frontend
	if (!empty($file) && file_exists($MinifyX->config[\'cacheFolder\'] . $file)) {
		if ($register == \'placeholder\' && $placeholder) {
			$tag = $type == \'css\'
				? \'<link rel="stylesheet" href="\' . $cacheFolderUrl .  $file . \'" type="text/css" />\'
				: \'<script type="text/javascript" src="\' . $cacheFolderUrl . $file . \'"></script>\';
			$modx->setPlaceholder($placeholder, $tag);
		}
		else {
			if ($type == \'css\') {
				$modx->regClientCSS($cacheFolderUrl . $file);
			}
			else {
				if ($register == \'startup\') {
					$modx->regClientStartupScript($cacheFolderUrl . $file);
				}
				else {
					$modx->regClientScript($cacheFolderUrl . $file);
				}
			}
		}
	}
}
return;',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'bannersInitialize' => 
      array (
        'fields' => 
        array (
          'id' => 53,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'bannersInitialize',
          'description' => '',
          'editor_type' => 0,
          'category' => 19,
          'cache_type' => 0,
          'snippet' => '$default = array(
    "show_banner_on_main" => 1,
    "show_banner_on_article" => 1
);
$config = require(MODX_ASSETS_PATH . \'banners_altravita/config.php\');
$modx->setPlaceholders(array_merge($default, $config));
$modx->regClientCSS(MODX_ASSETS_URL . \'banners_altravita/style.css\');
return;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => true,
          'static_file' => 'assets/banners_altravita/elements/snippet.bannersInitialize.php',
          'content' => '$default = array(
    "show_banner_on_main" => 1,
    "show_banner_on_article" => 1
);
$config = require(MODX_ASSETS_PATH . \'banners_altravita/config.php\');
$modx->setPlaceholders(array_merge($default, $config));
$modx->regClientCSS(MODX_ASSETS_URL . \'banners_altravita/style.css\');
return;',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'CanonicalUrl' => 
      array (
        'fields' => 
        array (
          'id' => 59,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'CanonicalUrl',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => 'if(!empty($_GET[\'page\'])){
    print \'<link rel="canonical" href="[[~[[*id]]? &scheme=`full`]]" />\';
}',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => 'if(!empty($_GET[\'page\'])){
    print \'<link rel="canonical" href="[[~[[*id]]? &scheme=`full`]]" />\';
}',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'pdoPage' => 
      array (
        'fields' => 
        array (
          'id' => 7,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'pdoPage',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
// Default variables
if (empty($pageVarKey)) {
    $pageVarKey = \'page\';
}
if (empty($pageNavVar)) {
    $pageNavVar = \'page.nav\';
}
if (empty($pageCountVar)) {
    $pageCountVar = \'pageCount\';
}
if (empty($totalVar)) {
    $totalVar = \'total\';
}
if (empty($page)) {
    $page = 1;
}
if (empty($pageLimit)) {
    $pageLimit = 5;
} else {
    $pageLimit = (integer)$pageLimit;
}
if (!isset($plPrefix)) {
    $plPrefix = \'\';
}
if (!empty($scriptProperties[\'ajaxMode\'])) {
    $scriptProperties[\'ajax\'] = 1;
}

// Convert parameters from getPage if exists
if (!empty($namespace)) {
    $plPrefix = $namespace;
}
if (!empty($pageNavTpl)) {
    $scriptProperties[\'tplPage\'] = $pageNavTpl;
}
if (!empty($pageNavOuterTpl)) {
    $scriptProperties[\'tplPageWrapper\'] = $pageNavOuterTpl;
}
if (!empty($pageActiveTpl)) {
    $scriptProperties[\'tplPageActive\'] = $pageActiveTpl;
}
if (!empty($pageFirstTpl)) {
    $scriptProperties[\'tplPageFirst\'] = $pageFirstTpl;
}
if (!empty($pagePrevTpl)) {
    $scriptProperties[\'tplPagePrev\'] = $pagePrevTpl;
}
if (!empty($pageNextTpl)) {
    $scriptProperties[\'tplPageNext\'] = $pageNextTpl;
}
if (!empty($pageLastTpl)) {
    $scriptProperties[\'tplPageLast\'] = $pageLastTpl;
}
if (!empty($pageSkipTpl)) {
    $scriptProperties[\'tplPageSkip\'] = $pageSkipTpl;
}
if (!empty($pageNavScheme)) {
    $scriptProperties[\'scheme\'] = $pageNavScheme;
}
if (!empty($cache_expires)) {
    $scriptProperties[\'cacheTime\'] = $cache_expires;
}
//---
$strictMode = !empty($strictMode);

$isAjax = !empty($scriptProperties[\'ajax\']) && !empty($_SERVER[\'HTTP_X_REQUESTED_WITH\']) && $_SERVER[\'HTTP_X_REQUESTED_WITH\'] == \'XMLHttpRequest\';
if ($isAjax && !isset($_REQUEST[$pageVarKey])) {
    return;
}

/** @var pdoPage $pdoPage */
$fqn = $modx->getOption(\'pdoPage.class\', null, \'pdotools.pdopage\', true);
$path = $modx->getOption(\'pdopage_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoPage = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoPage->pdoTools->addTime(\'pdoTools loaded\');

// Script and styles
if (!$isAjax && !empty($scriptProperties[\'ajaxMode\'])) {
    $pdoPage->loadJsCss();
}
// Removing of default scripts and styles so they do not overwrote nested snippet parameters
if ($snippet = $modx->getObject(\'modSnippet\', array(\'name\' => \'pdoPage\'))) {
    $properties = $snippet->get(\'properties\');
    if ($scriptProperties[\'frontend_js\'] == $properties[\'frontend_js\'][\'value\']) {
        unset($scriptProperties[\'frontend_js\']);
    }
    if ($scriptProperties[\'frontend_css\'] == $properties[\'frontend_css\'][\'value\']) {
        unset($scriptProperties[\'frontend_css\']);
    }
}

// Page
if (isset($_REQUEST[$pageVarKey]) && $strictMode && (!is_numeric($_REQUEST[$pageVarKey]) || ($_REQUEST[$pageVarKey] <= 1 && !$isAjax))) {
    return $pdoPage->redirectToFirst($isAjax);
} elseif (!empty($_REQUEST[$pageVarKey])) {
    $page = (integer)$_REQUEST[$pageVarKey];
}
$scriptProperties[\'page\'] = $page;
$scriptProperties[\'request\'] = $_REQUEST;

// Limit
if (isset($_REQUEST[\'limit\'])) {
    if (is_numeric($_REQUEST[\'limit\']) && abs($_REQUEST[\'limit\']) > 0) {
        $scriptProperties[\'limit\'] = abs($_REQUEST[\'limit\']);
    } elseif ($strictMode) {
        unset($_GET[\'limit\']);

        return $pdoPage->redirectToFirst($isAjax);
    }
}
if (!empty($maxLimit) && !empty($scriptProperties[\'limit\']) && $scriptProperties[\'limit\'] > $maxLimit) {
    $scriptProperties[\'limit\'] = $maxLimit;
}

// Offset
$offset = !empty($scriptProperties[\'offset\']) && $scriptProperties[\'offset\'] > 0
    ? (int)$scriptProperties[\'offset\']
    : 0;
$scriptProperties[\'offset\'] = $page > 1
    ? $scriptProperties[\'limit\'] * ($page - 1) + $offset
    : $offset;
if (!empty($scriptProperties[\'offset\']) && empty($scriptProperties[\'limit\'])) {
    $scriptProperties[\'limit\'] = 10000000;
}

$cache = !empty($cache) || (!$modx->user->id && !empty($cacheAnonymous));
$url = $pdoPage->getBaseUrl();
$output = $pagination = $total = $pageCount = \'\';

$data = $cache
    ? $pdoPage->pdoTools->getCache($scriptProperties)
    : array();

if (empty($data)) {
    $output = $pdoPage->pdoTools->runSnippet($scriptProperties[\'element\'], $scriptProperties);
    if ($output === false) {
        return \'\';
    } elseif (!empty($toPlaceholder)) {
        $output = $modx->getPlaceholder($toPlaceholder);
    }

    // Pagination
    $total = (int)$modx->getPlaceholder($totalVar);
    $pageCount = !empty($scriptProperties[\'limit\']) && $total > $offset
        ? ceil(($total - $offset) / $scriptProperties[\'limit\'])
        : 0;

    // Redirect to start if somebody specified incorrect page
    if ($page > 1 && $page > $pageCount && $strictMode) {
        return $pdoPage->redirectToFirst($isAjax);
    }
    if (!empty($pageCount) && $pageCount > 1) {
        $pagination = array(
            \'first\' => $page > 1 && !empty($tplPageFirst)
                ? $pdoPage->makePageLink($url, 1, $tplPageFirst)
                : \'\',
            \'prev\' => $page > 1 && !empty($tplPagePrev)
                ? $pdoPage->makePageLink($url, $page - 1, $tplPagePrev)
                : \'\',
            \'pages\' => $pageLimit >= 7 && empty($disableModernPagination)
                ? $pdoPage->buildModernPagination($page, $pageCount, $url)
                : $pdoPage->buildClassicPagination($page, $pageCount, $url),
            \'next\' => $page < $pageCount && !empty($tplPageNext)
                ? $pdoPage->makePageLink($url, $page + 1, $tplPageNext)
                : \'\',
            \'last\' => $page < $pageCount && !empty($tplPageLast)
                ? $pdoPage->makePageLink($url, $pageCount, $tplPageLast)
                : \'\',
        );

        if (!empty($pageCount)) {
            foreach (array(\'first\', \'prev\', \'next\', \'last\') as $v) {
                $tpl = \'tplPage\' . ucfirst($v) . \'Empty\';
                if (!empty(${$tpl}) && empty($pagination[$v])) {
                    $pagination[$v] = $pdoPage->pdoTools->getChunk(${$tpl});
                }
            }
        }
    } else {
        $pagination = array(
            \'first\' => \'\',
            \'prev\' => \'\',
            \'pages\' => \'\',
            \'next\' => \'\',
            \'last\' => \'\'
        );
    }

    $data = array(
        \'output\' => $output,
        $pageVarKey => $page,
        $pageCountVar => $pageCount,
        $pageNavVar => !empty($tplPageWrapper)
            ? $pdoPage->pdoTools->getChunk($tplPageWrapper, $pagination)
            : $pdoPage->pdoTools->parseChunk(\'\', $pagination),
        $totalVar => $total,
    );
    if ($cache) {
        $pdoPage->pdoTools->setCache($data, $scriptProperties);
    }
}

if ($isAjax) {
    if ($pageNavVar != \'pagination\') {
        $data[\'pagination\'] = $data[$pageNavVar];
        unset($data[$pageNavVar]);
    }
    if ($pageCountVar != \'pages\') {
        $data[\'pages\'] = (int)$data[$pageCountVar];
        unset($data[$pageCountVar]);
    }
    if ($pageVarKey != \'page\') {
        $data[\'page\'] = (int)$data[$pageVarKey];
        unset($data[$pageVarKey]);
    }
    if ($totalVar != \'total\') {
        $data[\'total\'] = (int)$data[$totalVar];
        unset($data[$totalVar]);
    }

    $maxIterations = (integer)$modx->getOption(\'parser_max_iterations\', null, 10);
    $modx->getParser()->processElementTags(\'\', $data[\'output\'], false, false, \'[[\', \']]\', array(), $maxIterations);
    $modx->getParser()->processElementTags(\'\', $data[\'output\'], true, true, \'[[\', \']]\', array(), $maxIterations);

    @session_write_close();
    exit(json_encode($data));
} else {
    if (!empty($setMeta)) {
        $canurl = $pdoPage->pdoTools->config[\'scheme\'] !== \'full\'
            ? $modx->getOption(\'url_scheme\') . rtrim($modx->getOption(\'http_host\'), \'/\') . \'/\' . ltrim($url, \'/\')
            : $url;

        $modx->regClientStartupHTMLBlock(\'<link rel="canonical" href="\' . $canurl . \'"/>\');
        if ($data[$pageVarKey] > 1) {
            $modx->regClientStartupHTMLBlock(
                \'<link rel="prev" href="\' . $pdoPage->makePageLink($canurl, $data[$pageVarKey] - 1) . \'"/>\'
            );
        }
        if ($data[$pageVarKey] < $data[$pageCountVar]) {
            $modx->regClientStartupHTMLBlock(
                \'<link rel="next" href="\' . $pdoPage->makePageLink($canurl, $data[$pageVarKey] + 1) . \'"/>\'
            );
        }
    }

    $modx->setPlaceholders($data, $plPrefix);
    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $data[\'output\']);
    } else {
        return $data[\'output\'];
    }
}',
          'locked' => false,
          'properties' => 
          array (
            'plPrefix' => 
            array (
              'name' => 'plPrefix',
              'desc' => 'pdotools_prop_plPrefix',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Префикс для выставляемых плейсхолдеров, по умолчанию "wf.".',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'pdotools_prop_limit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 10,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ограничение количества результатов выборки. Можно использовать "0".',
              'area_trans' => '',
            ),
            'maxLimit' => 
            array (
              'name' => 'maxLimit',
              'desc' => 'pdotools_prop_maxLimit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 100,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Максимально возможный лимит выборки. Перекрывает лимит, указанный пользователем через url.',
              'area_trans' => '',
            ),
            'offset' => 
            array (
              'name' => 'offset',
              'desc' => 'pdotools_prop_offset',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Пропуск результатов от начала.',
              'area_trans' => '',
            ),
            'page' => 
            array (
              'name' => 'page',
              'desc' => 'pdotools_prop_page',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Номер страницы для вывода. Перекрывается номером, указанным пользователем через url.',
              'area_trans' => '',
            ),
            'pageVarKey' => 
            array (
              'name' => 'pageVarKey',
              'desc' => 'pdotools_prop_pageVarKey',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'page',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя переменной для поиска номера страницы в url.',
              'area_trans' => '',
            ),
            'totalVar' => 
            array (
              'name' => 'totalVar',
              'desc' => 'pdotools_prop_totalVar',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'page.total',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя плейсхолдера для сохранения общего количества результатов.',
              'area_trans' => '',
            ),
            'pageLimit' => 
            array (
              'name' => 'pageLimit',
              'desc' => 'pdotools_prop_pageLimit',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 5,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Количество ссылок на страницы. Если больше или равно 7 - включается продвинутый режим отображения.',
              'area_trans' => '',
            ),
            'element' => 
            array (
              'name' => 'element',
              'desc' => 'pdotools_prop_element',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'pdoResources',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя сниппета для запуска.',
              'area_trans' => '',
            ),
            'pageNavVar' => 
            array (
              'name' => 'pageNavVar',
              'desc' => 'pdotools_prop_pageNavVar',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'page.nav',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя плейсхолдера для вывода пагинации.',
              'area_trans' => '',
            ),
            'pageCountVar' => 
            array (
              'name' => 'pageCountVar',
              'desc' => 'pdotools_prop_pageCountVar',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'pageCount',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Имя плейсхолдера для вывода количества страниц.',
              'area_trans' => '',
            ),
            'pageLinkScheme' => 
            array (
              'name' => 'pageLinkScheme',
              'desc' => 'pdotools_prop_pageLinkScheme',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Схема генерации ссылки на страницу. Можно использовать плейсхолдеры [[+pageVarKey]] и [[+page]]',
              'area_trans' => '',
            ),
            'tplPage' => 
            array (
              'name' => 'tplPage',
              'desc' => 'pdotools_prop_tplPage',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li><a href="[[+href]]">[[+pageNo]]</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления обычной ссылки на страницу.',
              'area_trans' => '',
            ),
            'tplPageWrapper' => 
            array (
              'name' => 'tplPageWrapper',
              'desc' => 'pdotools_prop_tplPageWrapper',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <div class="pagination"><ul class="pagination">[[+first]][[+prev]][[+pages]][[+next]][[+last]]</ul></div>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления всего блока пагинации, содержит плейсхолдеры страниц.',
              'area_trans' => '',
            ),
            'tplPageActive' => 
            array (
              'name' => 'tplPageActive',
              'desc' => 'pdotools_prop_tplPageActive',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="active"><a href="[[+href]]">[[+pageNo]]</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления ссылки на текущую страницу.',
              'area_trans' => '',
            ),
            'tplPageFirst' => 
            array (
              'name' => 'tplPageFirst',
              'desc' => 'pdotools_prop_tplPageFirst',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="control"><a href="[[+href]]">[[%pdopage_first]]</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления ссылки на первую страницу.',
              'area_trans' => '',
            ),
            'tplPageLast' => 
            array (
              'name' => 'tplPageLast',
              'desc' => 'pdotools_prop_tplPageLast',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="control"><a href="[[+href]]">[[%pdopage_last]]</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления ссылки на последнюю страницу.',
              'area_trans' => '',
            ),
            'tplPagePrev' => 
            array (
              'name' => 'tplPagePrev',
              'desc' => 'pdotools_prop_tplPagePrev',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="control"><a href="[[+href]]">&laquo;</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления ссылки на предыдущую страницу.',
              'area_trans' => '',
            ),
            'tplPageNext' => 
            array (
              'name' => 'tplPageNext',
              'desc' => 'pdotools_prop_tplPageNext',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="control"><a href="[[+href]]">&raquo;</a></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления ссылки на следующую страницу.',
              'area_trans' => '',
            ),
            'tplPageSkip' => 
            array (
              'name' => 'tplPageSkip',
              'desc' => 'pdotools_prop_tplPageSkip',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="disabled"><span>...</span></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления пропущенных страниц при продвинутом режиме отображения (&pageLimit >= 7).',
              'area_trans' => '',
            ),
            'tplPageFirstEmpty' => 
            array (
              'name' => 'tplPageFirstEmpty',
              'desc' => 'pdotools_prop_tplPageFirstEmpty',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="disabled"><span>[[%pdopage_first]]</span></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк, выводящийся при отсутствии ссылки на первую страницу.',
              'area_trans' => '',
            ),
            'tplPageLastEmpty' => 
            array (
              'name' => 'tplPageLastEmpty',
              'desc' => 'pdotools_prop_tplPageLastEmpty',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="disabled"><span>[[%pdopage_last]]</span></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк, выводящийся при отсутствии ссылки на последнюю страницу.',
              'area_trans' => '',
            ),
            'tplPagePrevEmpty' => 
            array (
              'name' => 'tplPagePrevEmpty',
              'desc' => 'pdotools_prop_tplPagePrevEmpty',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="disabled"><span>&laquo;</span></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк, выводящийся при отсутствии ссылки на предыдущую страницу.',
              'area_trans' => '',
            ),
            'tplPageNextEmpty' => 
            array (
              'name' => 'tplPageNextEmpty',
              'desc' => 'pdotools_prop_tplPageNextEmpty',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <li class="disabled"><span>&raquo;</span></li>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Чанк, выводящийся при отсутствии ссылки на следующую страницу.',
              'area_trans' => '',
            ),
            'cache' => 
            array (
              'name' => 'cache',
              'desc' => 'pdotools_prop_cache',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Кэширование результатов работы сниппета.',
              'area_trans' => '',
            ),
            'cacheTime' => 
            array (
              'name' => 'cacheTime',
              'desc' => 'pdotools_prop_cacheTime',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 3600,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Время актуальности кэша в секундах.',
              'area_trans' => '',
            ),
            'cacheAnonymous' => 
            array (
              'name' => 'cacheAnonymous',
              'desc' => 'pdotools_prop_cacheAnonymous',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить кэширование только для неавторизованных посетителей.',
              'area_trans' => '',
            ),
            'toPlaceholder' => 
            array (
              'name' => 'toPlaceholder',
              'desc' => 'pdotools_prop_toPlaceholder',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.',
              'area_trans' => '',
            ),
            'ajax' => 
            array (
              'name' => 'ajax',
              'desc' => 'pdotools_prop_ajax',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => false,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Включить поддержку ajax запросов.',
              'area_trans' => '',
            ),
            'ajaxMode' => 
            array (
              'name' => 'ajaxMode',
              'desc' => 'pdotools_prop_ajaxMode',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'None',
                  'value' => '',
                  'name' => 'None',
                ),
                1 => 
                array (
                  'text' => 'Default',
                  'value' => 'default',
                  'name' => 'Default',
                ),
                2 => 
                array (
                  'text' => 'Scroll',
                  'value' => 'scroll',
                  'name' => 'Scroll',
                ),
                3 => 
                array (
                  'text' => 'Button',
                  'value' => 'button',
                  'name' => 'Button',
                ),
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ajax пагинация "из коробки". Доступны 3 режима: "default", "button" и "scroll".',
              'area_trans' => '',
            ),
            'ajaxElemWrapper' => 
            array (
              'name' => 'ajaxElemWrapper',
              'desc' => 'pdotools_prop_ajaxElemWrapper',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '#pdopage',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'jQuery селектор элемента-обёртки с результатами и пагинацией.',
              'area_trans' => '',
            ),
            'ajaxElemRows' => 
            array (
              'name' => 'ajaxElemRows',
              'desc' => 'pdotools_prop_ajaxElemRows',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '#pdopage .rows',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'jQuery селектор элемента с результатами.',
              'area_trans' => '',
            ),
            'ajaxElemPagination' => 
            array (
              'name' => 'ajaxElemPagination',
              'desc' => 'pdotools_prop_ajaxElemPagination',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '#pdopage .pagination',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'jQuery селектор элемента с пагинацией.',
              'area_trans' => '',
            ),
            'ajaxElemLink' => 
            array (
              'name' => 'ajaxElemLink',
              'desc' => 'pdotools_prop_ajaxElemLink',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '#pdopage .pagination a',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'jQuery селектор ссылки на страницу.',
              'area_trans' => '',
            ),
            'ajaxElemMore' => 
            array (
              'name' => 'ajaxElemMore',
              'desc' => 'pdotools_prop_ajaxElemMore',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '#pdopage .btn-more',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'jQuery селектор кнопки загрузки результатов при ajaxMode = button.',
              'area_trans' => '',
            ),
            'ajaxTplMore' => 
            array (
              'name' => 'ajaxTplMore',
              'desc' => 'pdotools_prop_ajaxTplMore',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <button class="btn btn-default btn-more">[[%pdopage_more]]</button>',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Шаблон кнопки для загрузки новых результатов при ajaxMode = button. Должен включать селектор, указанный в "ajaxElemMore".',
              'area_trans' => '',
            ),
            'ajaxHistory' => 
            array (
              'name' => 'ajaxHistory',
              'desc' => 'pdotools_prop_ajaxHistory',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'Auto',
                  'value' => '',
                  'name' => 'Auto',
                ),
                1 => 
                array (
                  'text' => 'Enabled',
                  'value' => 1,
                  'name' => 'Enabled',
                ),
                2 => 
                array (
                  'text' => 'Disabled',
                  'value' => 0,
                  'name' => 'Disabled',
                ),
              ),
              'value' => '',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Сохранять номер страницы в url при работе в режиме ajax.',
              'area_trans' => '',
            ),
            'frontend_js' => 
            array (
              'name' => 'frontend_js',
              'desc' => 'pdotools_prop_frontend_js',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]js/pdopage.min.js',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ссылка на javascript для подключения сниппетом.',
              'area_trans' => '',
            ),
            'frontend_css' => 
            array (
              'name' => 'frontend_css',
              'desc' => 'pdotools_prop_frontend_css',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]css/pdopage.min.css',
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Ссылка на css стили оформления для подключения сниппетом.',
              'area_trans' => '',
            ),
            'setMeta' => 
            array (
              'name' => 'setMeta',
              'desc' => 'pdotools_prop_setMeta',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Регистрация мета-тегов со ссылками на предыдущую и следующую страницу.',
              'area_trans' => '',
            ),
            'strictMode' => 
            array (
              'name' => 'strictMode',
              'desc' => 'pdotools_prop_strictMode',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'pdotools:properties',
              'area' => '',
              'desc_trans' => 'Строгий режим работы. pdoPage делает редиректы при загрузке несуществующих страниц.',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/pdotools/elements/snippets/snippet.pdopage.php',
          'content' => '/** @var array $scriptProperties */
// Default variables
if (empty($pageVarKey)) {
    $pageVarKey = \'page\';
}
if (empty($pageNavVar)) {
    $pageNavVar = \'page.nav\';
}
if (empty($pageCountVar)) {
    $pageCountVar = \'pageCount\';
}
if (empty($totalVar)) {
    $totalVar = \'total\';
}
if (empty($page)) {
    $page = 1;
}
if (empty($pageLimit)) {
    $pageLimit = 5;
} else {
    $pageLimit = (integer)$pageLimit;
}
if (!isset($plPrefix)) {
    $plPrefix = \'\';
}
if (!empty($scriptProperties[\'ajaxMode\'])) {
    $scriptProperties[\'ajax\'] = 1;
}

// Convert parameters from getPage if exists
if (!empty($namespace)) {
    $plPrefix = $namespace;
}
if (!empty($pageNavTpl)) {
    $scriptProperties[\'tplPage\'] = $pageNavTpl;
}
if (!empty($pageNavOuterTpl)) {
    $scriptProperties[\'tplPageWrapper\'] = $pageNavOuterTpl;
}
if (!empty($pageActiveTpl)) {
    $scriptProperties[\'tplPageActive\'] = $pageActiveTpl;
}
if (!empty($pageFirstTpl)) {
    $scriptProperties[\'tplPageFirst\'] = $pageFirstTpl;
}
if (!empty($pagePrevTpl)) {
    $scriptProperties[\'tplPagePrev\'] = $pagePrevTpl;
}
if (!empty($pageNextTpl)) {
    $scriptProperties[\'tplPageNext\'] = $pageNextTpl;
}
if (!empty($pageLastTpl)) {
    $scriptProperties[\'tplPageLast\'] = $pageLastTpl;
}
if (!empty($pageSkipTpl)) {
    $scriptProperties[\'tplPageSkip\'] = $pageSkipTpl;
}
if (!empty($pageNavScheme)) {
    $scriptProperties[\'scheme\'] = $pageNavScheme;
}
if (!empty($cache_expires)) {
    $scriptProperties[\'cacheTime\'] = $cache_expires;
}
//---
$strictMode = !empty($strictMode);

$isAjax = !empty($scriptProperties[\'ajax\']) && !empty($_SERVER[\'HTTP_X_REQUESTED_WITH\']) && $_SERVER[\'HTTP_X_REQUESTED_WITH\'] == \'XMLHttpRequest\';
if ($isAjax && !isset($_REQUEST[$pageVarKey])) {
    return;
}

/** @var pdoPage $pdoPage */
$fqn = $modx->getOption(\'pdoPage.class\', null, \'pdotools.pdopage\', true);
$path = $modx->getOption(\'pdopage_class_path\', null, MODX_CORE_PATH . \'components/pdotools/model/\', true);
if ($pdoClass = $modx->loadClass($fqn, $path, false, true)) {
    $pdoPage = new $pdoClass($modx, $scriptProperties);
} else {
    return false;
}
$pdoPage->pdoTools->addTime(\'pdoTools loaded\');

// Script and styles
if (!$isAjax && !empty($scriptProperties[\'ajaxMode\'])) {
    $pdoPage->loadJsCss();
}
// Removing of default scripts and styles so they do not overwrote nested snippet parameters
if ($snippet = $modx->getObject(\'modSnippet\', array(\'name\' => \'pdoPage\'))) {
    $properties = $snippet->get(\'properties\');
    if ($scriptProperties[\'frontend_js\'] == $properties[\'frontend_js\'][\'value\']) {
        unset($scriptProperties[\'frontend_js\']);
    }
    if ($scriptProperties[\'frontend_css\'] == $properties[\'frontend_css\'][\'value\']) {
        unset($scriptProperties[\'frontend_css\']);
    }
}

// Page
if (isset($_REQUEST[$pageVarKey]) && $strictMode && (!is_numeric($_REQUEST[$pageVarKey]) || ($_REQUEST[$pageVarKey] <= 1 && !$isAjax))) {
    return $pdoPage->redirectToFirst($isAjax);
} elseif (!empty($_REQUEST[$pageVarKey])) {
    $page = (integer)$_REQUEST[$pageVarKey];
}
$scriptProperties[\'page\'] = $page;
$scriptProperties[\'request\'] = $_REQUEST;

// Limit
if (isset($_REQUEST[\'limit\'])) {
    if (is_numeric($_REQUEST[\'limit\']) && abs($_REQUEST[\'limit\']) > 0) {
        $scriptProperties[\'limit\'] = abs($_REQUEST[\'limit\']);
    } elseif ($strictMode) {
        unset($_GET[\'limit\']);

        return $pdoPage->redirectToFirst($isAjax);
    }
}
if (!empty($maxLimit) && !empty($scriptProperties[\'limit\']) && $scriptProperties[\'limit\'] > $maxLimit) {
    $scriptProperties[\'limit\'] = $maxLimit;
}

// Offset
$offset = !empty($scriptProperties[\'offset\']) && $scriptProperties[\'offset\'] > 0
    ? (int)$scriptProperties[\'offset\']
    : 0;
$scriptProperties[\'offset\'] = $page > 1
    ? $scriptProperties[\'limit\'] * ($page - 1) + $offset
    : $offset;
if (!empty($scriptProperties[\'offset\']) && empty($scriptProperties[\'limit\'])) {
    $scriptProperties[\'limit\'] = 10000000;
}

$cache = !empty($cache) || (!$modx->user->id && !empty($cacheAnonymous));
$url = $pdoPage->getBaseUrl();
$output = $pagination = $total = $pageCount = \'\';

$data = $cache
    ? $pdoPage->pdoTools->getCache($scriptProperties)
    : array();

if (empty($data)) {
    $output = $pdoPage->pdoTools->runSnippet($scriptProperties[\'element\'], $scriptProperties);
    if ($output === false) {
        return \'\';
    } elseif (!empty($toPlaceholder)) {
        $output = $modx->getPlaceholder($toPlaceholder);
    }

    // Pagination
    $total = (int)$modx->getPlaceholder($totalVar);
    $pageCount = !empty($scriptProperties[\'limit\']) && $total > $offset
        ? ceil(($total - $offset) / $scriptProperties[\'limit\'])
        : 0;

    // Redirect to start if somebody specified incorrect page
    if ($page > 1 && $page > $pageCount && $strictMode) {
        return $pdoPage->redirectToFirst($isAjax);
    }
    if (!empty($pageCount) && $pageCount > 1) {
        $pagination = array(
            \'first\' => $page > 1 && !empty($tplPageFirst)
                ? $pdoPage->makePageLink($url, 1, $tplPageFirst)
                : \'\',
            \'prev\' => $page > 1 && !empty($tplPagePrev)
                ? $pdoPage->makePageLink($url, $page - 1, $tplPagePrev)
                : \'\',
            \'pages\' => $pageLimit >= 7 && empty($disableModernPagination)
                ? $pdoPage->buildModernPagination($page, $pageCount, $url)
                : $pdoPage->buildClassicPagination($page, $pageCount, $url),
            \'next\' => $page < $pageCount && !empty($tplPageNext)
                ? $pdoPage->makePageLink($url, $page + 1, $tplPageNext)
                : \'\',
            \'last\' => $page < $pageCount && !empty($tplPageLast)
                ? $pdoPage->makePageLink($url, $pageCount, $tplPageLast)
                : \'\',
        );

        if (!empty($pageCount)) {
            foreach (array(\'first\', \'prev\', \'next\', \'last\') as $v) {
                $tpl = \'tplPage\' . ucfirst($v) . \'Empty\';
                if (!empty(${$tpl}) && empty($pagination[$v])) {
                    $pagination[$v] = $pdoPage->pdoTools->getChunk(${$tpl});
                }
            }
        }
    } else {
        $pagination = array(
            \'first\' => \'\',
            \'prev\' => \'\',
            \'pages\' => \'\',
            \'next\' => \'\',
            \'last\' => \'\'
        );
    }

    $data = array(
        \'output\' => $output,
        $pageVarKey => $page,
        $pageCountVar => $pageCount,
        $pageNavVar => !empty($tplPageWrapper)
            ? $pdoPage->pdoTools->getChunk($tplPageWrapper, $pagination)
            : $pdoPage->pdoTools->parseChunk(\'\', $pagination),
        $totalVar => $total,
    );
    if ($cache) {
        $pdoPage->pdoTools->setCache($data, $scriptProperties);
    }
}

if ($isAjax) {
    if ($pageNavVar != \'pagination\') {
        $data[\'pagination\'] = $data[$pageNavVar];
        unset($data[$pageNavVar]);
    }
    if ($pageCountVar != \'pages\') {
        $data[\'pages\'] = (int)$data[$pageCountVar];
        unset($data[$pageCountVar]);
    }
    if ($pageVarKey != \'page\') {
        $data[\'page\'] = (int)$data[$pageVarKey];
        unset($data[$pageVarKey]);
    }
    if ($totalVar != \'total\') {
        $data[\'total\'] = (int)$data[$totalVar];
        unset($data[$totalVar]);
    }

    $maxIterations = (integer)$modx->getOption(\'parser_max_iterations\', null, 10);
    $modx->getParser()->processElementTags(\'\', $data[\'output\'], false, false, \'[[\', \']]\', array(), $maxIterations);
    $modx->getParser()->processElementTags(\'\', $data[\'output\'], true, true, \'[[\', \']]\', array(), $maxIterations);

    @session_write_close();
    exit(json_encode($data));
} else {
    if (!empty($setMeta)) {
        $canurl = $pdoPage->pdoTools->config[\'scheme\'] !== \'full\'
            ? $modx->getOption(\'url_scheme\') . rtrim($modx->getOption(\'http_host\'), \'/\') . \'/\' . ltrim($url, \'/\')
            : $url;

        $modx->regClientStartupHTMLBlock(\'<link rel="canonical" href="\' . $canurl . \'"/>\');
        if ($data[$pageVarKey] > 1) {
            $modx->regClientStartupHTMLBlock(
                \'<link rel="prev" href="\' . $pdoPage->makePageLink($canurl, $data[$pageVarKey] - 1) . \'"/>\'
            );
        }
        if ($data[$pageVarKey] < $data[$pageCountVar]) {
            $modx->regClientStartupHTMLBlock(
                \'<link rel="next" href="\' . $pdoPage->makePageLink($canurl, $data[$pageVarKey] + 1) . \'"/>\'
            );
        }
    }

    $modx->setPlaceholders($data, $plPrefix);
    if (!empty($toPlaceholder)) {
        $modx->setPlaceholder($toPlaceholder, $data[\'output\']);
    } else {
        return $data[\'output\'];
    }
}',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'localtime' => 
      array (
        'fields' => 
        array (
          'id' => 60,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'localtime',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => 'if(!$input)
    return;
$out = explode(\'.\', date(\'d.m.Y\', strtotime($input)));
$monthses = array(
    \'января\',\'февраля\',\'марта\',\'апреля\',\'мая\',\'июня\',\'июля\',\'августа\',\'сентября\',\'октября\',\'ноября\',\'декабря\'
);
return $out[0] . \' \' . $monthses[intval($out[1]) - 1] . \' \' . $out[2] . \'г.\';',
          'locked' => false,
          'properties' => NULL,
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => 'if(!$input)
    return;
$out = explode(\'.\', date(\'d.m.Y\', strtotime($input)));
$monthses = array(
    \'января\',\'февраля\',\'марта\',\'апреля\',\'мая\',\'июня\',\'июля\',\'августа\',\'сентября\',\'октября\',\'ноября\',\'декабря\'
);
return $out[0] . \' \' . $monthses[intval($out[1]) - 1] . \' \' . $out[2] . \'г.\';',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
      'loginUserForAddTicket' => 
      array (
        'fields' => 
        array (
          'id' => 56,
          'source' => 2,
          'property_preprocess' => false,
          'name' => 'loginUserForAddTicket',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => 'if ($user = $modx->getObject(\'modUser\', 7)) {
	$modx->user = $user;
	$modx->user->addSessionContext(\'web\');
}',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => 'if ($user = $modx->getObject(\'modUser\', 7)) {
	$modx->user = $user;
	$modx->user->addSessionContext(\'web\');
}',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'TicketFormCustom' => 
      array (
        'fields' => 
        array (
          'id' => 57,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'TicketFormCustom',
          'description' => '',
          'editor_type' => 0,
          'category' => 13,
          'cache_type' => 0,
          'snippet' => '/* @var array $scriptProperties */
/* @var Tickets $Tickets */
$Tickets = $modx->getService(\'tickets\', \'Tickets\', $modx->getOption(\'tickets.core_path\', null, $modx->getOption(\'core_path\') . \'components/tickets/\') . \'model/tickets/\', $scriptProperties);
$Tickets->initialize($modx->context->key, $scriptProperties);

// if (!$Tickets->authenticated) {
// 	return $modx->lexicon(\'ticket_err_no_auth\');
// }

$tplSectionRow = $modx->getOption(\'tplSectionRow\', $scriptProperties, \'tpl.Tickets.sections.row\');
$tplFormCreate = $modx->getOption(\'tplFormCreate\', $scriptProperties, \'tpl.Tickets.form.create\');
$tplFormUpdate = $modx->getOption(\'tplFormUpdate\', $scriptProperties, \'tpl.Tickets.form.update\');
$tplFiles = $modx->getOption(\'tplFiles\', $scriptProperties, \'tpl.Tickets.form.files\');
$tplFile = $Tickets->config[\'tplFile\'] = $modx->getOption(\'tplFile\', $scriptProperties, \'tpl.Tickets.form.file\', true);
$tplImage = $Tickets->config[\'tplImage\'] = $modx->getOption(\'tplImage\', $scriptProperties, \'tpl.Tickets.form.image\', true);
if (empty($source)) {
	$source = $Tickets->config[\'source\'] = $modx->getOption(\'tickets.source_default\', null, $modx->getOption(\'default_media_source\'));
}
$tid = !empty($_REQUEST[\'tid\'])
	? (int)$_REQUEST[\'tid\']
	: 0;
$parent = !empty($_REQUEST[\'parent\'])
	? $_REQUEST[\'parent\']
	: \'\';
$data = array();

// Update of ticket
if (!empty($tid)) {
	$tplWrapper = $tplFormUpdate;
	/* @var Ticket $ticket */
	if ($ticket = $modx->getObject(\'Ticket\', array(\'class_key\' => \'Ticket\', \'id\' => $tid))) {
		if ($ticket->get(\'createdby\') != $modx->user->id && !$modx->hasPermission(\'edit_document\')) {
			return $modx->lexicon(\'ticket_err_wrong_user\');
		}
		$charset = $modx->getOption(\'modx_charset\');
		$allowedFields = array_map(\'trim\', explode(\',\', $scriptProperties[\'allowedFields\']));
		$allowedFields = array_unique(array_merge($allowedFields, array(\'parent\', \'pagetitle\', \'content\')));

		$fields = array_keys($modx->getFieldMeta(\'Ticket\'));
		foreach ($allowedFields as $field) {
			$value = in_array($field, $fields)
				? $ticket->get($field)
				: $ticket->getTVValue($field);
			if (is_string($value)) {
				$value = html_entity_decode($value, ENT_QUOTES, $charset);
				$value = str_replace(array(\'[^\', \'^]\', \'[\', \']\'), array(\'&#91;^\', \'^&#93;\', \'*{*{*{*{*{*\', \'*}*}*}*}*}*\'), $value);
				$value = htmlentities($value, ENT_QUOTES, $charset);
			}
			$data[$field] = $value;
		}
		$data[\'id\'] = $ticket->id;
		$data[\'published\'] = $ticket->published;
		if (empty($parent)) {
			$parent = $ticket->get(\'parent\');
		}
	}
	else {
		return $modx->lexicon(\'ticket_err_id\', array(\'id\' => $tid));
	}
}
else {
	$tplWrapper = $tplFormCreate;
}

// Get available sections for ticket create
$data[\'sections\'] = \'\';
/** @var modProcessorResponse $response */
$response = $Tickets->runProcessor(\'web/section/getlist\', array(
	\'parents\' => $scriptProperties[\'parents\'],
	\'resources\' => $scriptProperties[\'resources\'],
	\'permissions\' => $scriptProperties[\'permissions\'],
	\'sortby\' => !empty($scriptProperties[\'sortby\'])
		? $scriptProperties[\'sortby\']
		: \'pagetitle\',
	\'sortdir\' => !empty($scriptProperties[\'sortdir\'])
		? $scriptProperties[\'sortdir\']
		: \'asc\',
	\'depth\' => isset($scriptProperties[\'depth\'])
		? $scriptProperties[\'depth\']
		: 0,
	\'context\' => !empty($scriptProperties[\'context\'])
		? $scriptProperties[\'context\']
		: $modx->context->key,
	\'limit\' => 0,
));
$response = $modx->fromJSON($response->getResponse());

if (!empty($response[\'results\'])) {
	$Tickets->config[\'sections\'] = array();
	foreach ($response[\'results\'] as $v) {
		$v[\'selected\'] = $parent == $v[\'id\'] || $parent == $v[\'alias\']
			? \'selected\'
			: \'\';
		$data[\'sections\'] .= $Tickets->getChunk($tplSectionRow, $v);
		$Tickets->config[\'sections\'][] = $v[\'id\'];
	}
}

if (!empty($allowFiles)) {
	$q = $modx->newQuery(\'TicketFile\');
	$q->where(array(\'class\' => \'Ticket\'));
	$q->andCondition(array(\'parent\' => 0, \'createdby\' => $modx->user->id), null, 1);
	if (!empty($tid)) {
		$q->orCondition(array(\'parent\' => $tid), null, 1);
	}
	$q->sortby(\'createdon\', \'ASC\');
	$collection = $modx->getIterator(\'TicketFile\', $q);
	$files = \'\';
	/** @var TicketFile $item */
	foreach ($collection as $item) {
		if ($item->get(\'deleted\') && !$item->get(\'parent\')) {
			$item->remove();
		}
		else {
			$item = $item->toArray();
			$item[\'size\'] = round($item[\'size\'] / 1024, 2);
			$item[\'new\'] = empty($item[\'parent\']);
			$tpl = $item[\'type\'] == \'image\'
				? $tplImage
				: $tplFile;
			$files .= $Tickets->getChunk($tpl, $item);
		}
	}
	$data[\'files\'] = $Tickets->getChunk($tplFiles, array(
		\'files\' => $files,
	));
	/** @var modMediaSource $source */
	if ($source = $modx->getObject(\'sources.modMediaSource\', $source)) {
		$properties = $source->getPropertyList();
		$config = array(
			\'size\' => !empty($properties[\'maxUploadSize\'])
				? $properties[\'maxUploadSize\']
				: 3145728,
			\'height\' => !empty($properties[\'maxUploadHeight\'])
				? $properties[\'maxUploadHeight\']
				: 1080,
			\'width\' => !empty($properties[\'maxUploadWidth\'])
				? $properties[\'maxUploadWidth\']
				: 1920,
			\'extensions\' => !empty($properties[\'allowedFileTypes\'])
				? $properties[\'allowedFileTypes\']
				: \'jpg,jpeg,png,gif\'
		);
		$modx->regClientStartupScript(\'<script type="text/javascript">TicketsConfig.source=\' . $modx->toJSON($config) . \'</script>\', true);
	}
	$modx->regClientScript($Tickets->config[\'jsUrl\'] . \'web/lib/plupload/plupload.full.min.js\');
	$modx->regClientScript($Tickets->config[\'jsUrl\'] . \'web/files.js\');

	$lang = $modx->getOption(\'cultureKey\');
	if ($lang != \'en\' && file_exists($Tickets->config[\'jsPath\'] . \'web/lib/plupload/i18n/\' . $lang . \'.js\')) {
		$modx->regClientScript($Tickets->config[\'jsUrl\'] . \'web/lib/plupload/i18n/\' . $lang . \'.js\');
	}
}

$output = $Tickets->getChunk($tplWrapper, $data);
$key = md5($modx->toJSON($Tickets->config));
$_SESSION[\'TicketForm\'][$key] = $Tickets->config;
$output = str_ireplace(\'</form>\', "\\n<input type=\\"hidden\\" name=\\"form_key\\" value=\\"{$key}\\" class=\\"disable-sisyphus\\" />\\n</form>", $output);

return $output;',
          'locked' => false,
          'properties' => 
          array (
            'allowFiles' => 
            array (
              'name' => 'allowFiles',
              'desc' => 'tickets_prop_allowFiles',
              'type' => 'combo-boolean',
              'options' => 
              array (
              ),
              'value' => true,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Разрешить пользователю загружать файлы на сервер.',
              'area_trans' => '',
            ),
            'allowedFields' => 
            array (
              'name' => 'allowedFields',
              'desc' => 'tickets_prop_allowedFields',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'parent,pagetitle,content',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Поля тикета, которые разрешено заполнять пользователю. Можно указывать имена ТВ параметров.',
              'area_trans' => '',
            ),
            'bypassFields' => 
            array (
              'name' => 'bypassFields',
              'desc' => 'tickets_prop_bypassFields',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Поля тикета, которые не нужно фильтровать при сохранении.',
              'area_trans' => '',
            ),
            'context' => 
            array (
              'name' => 'context',
              'desc' => 'tickets_prop_sections_context',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Список контекстов для поиска секций, через запятую.',
              'area_trans' => '',
            ),
            'parents' => 
            array (
              'name' => 'parents',
              'desc' => 'tickets_prop_sections_parents',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'По умолчанию выводятся все доступные разделы тикетов, но вы можете ограничить их, указав конкретных родителей через запятую.',
              'area_trans' => '',
            ),
            'permissions' => 
            array (
              'name' => 'permissions',
              'desc' => 'tickets_prop_sections_permissions',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'section_add_children',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Проверка прав на публикацию в раздел. По умолачанию проверяется разрешение "section_add_children".',
              'area_trans' => '',
            ),
            'redirectUnpublished' => 
            array (
              'name' => 'redirectUnpublished',
              'desc' => 'tickets_prop_redirectUnpublished',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Вы можете указать, на какой документ отправлять пользователя при создании неопубликованного тикета.',
              'area_trans' => '',
            ),
            'requiredFields' => 
            array (
              'name' => 'requiredFields',
              'desc' => 'tickets_prop_requiredFields',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'parent,pagetitle,content',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Обязательные поля, которые пользователь должен заполнить для отправки формы.',
              'area_trans' => '',
            ),
            'resources' => 
            array (
              'name' => 'resources',
              'desc' => 'tickets_prop_sections_resources',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'По умолчанию выводятся все доступные тикеты разделов, но вы можете ограничить их, указав конкретные id секций через запятую.',
              'area_trans' => '',
            ),
            'sortby' => 
            array (
              'name' => 'sortby',
              'desc' => 'tickets_prop_sections_sortby',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'pagetitle',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Поле для сортировки списка разделов.',
              'area_trans' => '',
            ),
            'sortdir' => 
            array (
              'name' => 'sortdir',
              'desc' => 'tickets_prop_sections_sortdir',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'ASC',
                  'value' => 'ASC',
                  'name' => 'ASC',
                ),
                1 => 
                array (
                  'text' => 'DESC',
                  'value' => 'DESC',
                  'name' => 'DESC',
                ),
              ),
              'value' => 'ASC',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Направление сортировки списка разделов.',
              'area_trans' => '',
            ),
            'source' => 
            array (
              'name' => 'source',
              'desc' => 'tickets_prop_source',
              'type' => 'numberfield',
              'options' => 
              array (
              ),
              'value' => 0,
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Id источника медиа для загрузки файлов. По умолчанию будет использован источник, указанный в системной настройке "tickets.source_default".',
              'area_trans' => '',
            ),
            'tplFile' => 
            array (
              'name' => 'tplFile',
              'desc' => 'tickets_prop_tplFile',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.form.file',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления загруженного файла, который не является изображением.',
              'area_trans' => '',
            ),
            'tplFiles' => 
            array (
              'name' => 'tplFiles',
              'desc' => 'tickets_prop_tplFiles',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.form.files',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Контейнер для вывода загрузчика и списка уже загруженных файлов.',
              'area_trans' => '',
            ),
            'tplFormCreate' => 
            array (
              'name' => 'tplFormCreate',
              'desc' => 'tickets_prop_tplFormCreate',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.form.create',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк для создания нового тикета',
              'area_trans' => '',
            ),
            'tplFormUpdate' => 
            array (
              'name' => 'tplFormUpdate',
              'desc' => 'tickets_prop_tplFormUpdate',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.form.update',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк для обновления существующего тикета',
              'area_trans' => '',
            ),
            'tplImage' => 
            array (
              'name' => 'tplImage',
              'desc' => 'tickets_prop_tplImage',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.form.image',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк оформления загруженного изображения.',
              'area_trans' => '',
            ),
            'tplPreview' => 
            array (
              'name' => 'tplPreview',
              'desc' => 'tickets_prop_tplPreview',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.form.preview',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк для предпросмотра тикета перед публикацией',
              'area_trans' => '',
            ),
            'tplSectionRow' => 
            array (
              'name' => 'tplSectionRow',
              'desc' => 'tickets_prop_tplSectionRow',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '@INLINE <option value="[[+id]]" [[+selected]]>[[+pagetitle]]</option>',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк для оформления раздела вопросов в форме',
              'area_trans' => '',
            ),
            'tplTicketEmailBcc' => 
            array (
              'name' => 'tplTicketEmailBcc',
              'desc' => 'tickets_prop_tplTicketEmailBcc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.ticket.email.bcc',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'Чанк для уведомления админов сайта о новом тикете.',
              'area_trans' => '',
            ),
            'tplTicketEmailSubscription' => 
            array (
              'name' => 'tplTicketEmailSubscription',
              'desc' => 'tickets_prop_tplTicketEmailSubscription',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.Tickets.ticket.email.subscription',
              'lexicon' => 'tickets:properties',
              'area' => '',
              'desc_trans' => 'tickets_prop_tplTicketEmailSubscription',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/tickets/elements/snippets/snippet.ticket_form.php',
          'content' => '/* @var array $scriptProperties */
/* @var Tickets $Tickets */
$Tickets = $modx->getService(\'tickets\', \'Tickets\', $modx->getOption(\'tickets.core_path\', null, $modx->getOption(\'core_path\') . \'components/tickets/\') . \'model/tickets/\', $scriptProperties);
$Tickets->initialize($modx->context->key, $scriptProperties);

// if (!$Tickets->authenticated) {
// 	return $modx->lexicon(\'ticket_err_no_auth\');
// }

$tplSectionRow = $modx->getOption(\'tplSectionRow\', $scriptProperties, \'tpl.Tickets.sections.row\');
$tplFormCreate = $modx->getOption(\'tplFormCreate\', $scriptProperties, \'tpl.Tickets.form.create\');
$tplFormUpdate = $modx->getOption(\'tplFormUpdate\', $scriptProperties, \'tpl.Tickets.form.update\');
$tplFiles = $modx->getOption(\'tplFiles\', $scriptProperties, \'tpl.Tickets.form.files\');
$tplFile = $Tickets->config[\'tplFile\'] = $modx->getOption(\'tplFile\', $scriptProperties, \'tpl.Tickets.form.file\', true);
$tplImage = $Tickets->config[\'tplImage\'] = $modx->getOption(\'tplImage\', $scriptProperties, \'tpl.Tickets.form.image\', true);
if (empty($source)) {
	$source = $Tickets->config[\'source\'] = $modx->getOption(\'tickets.source_default\', null, $modx->getOption(\'default_media_source\'));
}
$tid = !empty($_REQUEST[\'tid\'])
	? (int)$_REQUEST[\'tid\']
	: 0;
$parent = !empty($_REQUEST[\'parent\'])
	? $_REQUEST[\'parent\']
	: \'\';
$data = array();

// Update of ticket
if (!empty($tid)) {
	$tplWrapper = $tplFormUpdate;
	/* @var Ticket $ticket */
	if ($ticket = $modx->getObject(\'Ticket\', array(\'class_key\' => \'Ticket\', \'id\' => $tid))) {
		if ($ticket->get(\'createdby\') != $modx->user->id && !$modx->hasPermission(\'edit_document\')) {
			return $modx->lexicon(\'ticket_err_wrong_user\');
		}
		$charset = $modx->getOption(\'modx_charset\');
		$allowedFields = array_map(\'trim\', explode(\',\', $scriptProperties[\'allowedFields\']));
		$allowedFields = array_unique(array_merge($allowedFields, array(\'parent\', \'pagetitle\', \'content\')));

		$fields = array_keys($modx->getFieldMeta(\'Ticket\'));
		foreach ($allowedFields as $field) {
			$value = in_array($field, $fields)
				? $ticket->get($field)
				: $ticket->getTVValue($field);
			if (is_string($value)) {
				$value = html_entity_decode($value, ENT_QUOTES, $charset);
				$value = str_replace(array(\'[^\', \'^]\', \'[\', \']\'), array(\'&#91;^\', \'^&#93;\', \'*{*{*{*{*{*\', \'*}*}*}*}*}*\'), $value);
				$value = htmlentities($value, ENT_QUOTES, $charset);
			}
			$data[$field] = $value;
		}
		$data[\'id\'] = $ticket->id;
		$data[\'published\'] = $ticket->published;
		if (empty($parent)) {
			$parent = $ticket->get(\'parent\');
		}
	}
	else {
		return $modx->lexicon(\'ticket_err_id\', array(\'id\' => $tid));
	}
}
else {
	$tplWrapper = $tplFormCreate;
}

// Get available sections for ticket create
$data[\'sections\'] = \'\';
/** @var modProcessorResponse $response */
$response = $Tickets->runProcessor(\'web/section/getlist\', array(
	\'parents\' => $scriptProperties[\'parents\'],
	\'resources\' => $scriptProperties[\'resources\'],
	\'permissions\' => $scriptProperties[\'permissions\'],
	\'sortby\' => !empty($scriptProperties[\'sortby\'])
		? $scriptProperties[\'sortby\']
		: \'pagetitle\',
	\'sortdir\' => !empty($scriptProperties[\'sortdir\'])
		? $scriptProperties[\'sortdir\']
		: \'asc\',
	\'depth\' => isset($scriptProperties[\'depth\'])
		? $scriptProperties[\'depth\']
		: 0,
	\'context\' => !empty($scriptProperties[\'context\'])
		? $scriptProperties[\'context\']
		: $modx->context->key,
	\'limit\' => 0,
));
$response = $modx->fromJSON($response->getResponse());

if (!empty($response[\'results\'])) {
	$Tickets->config[\'sections\'] = array();
	foreach ($response[\'results\'] as $v) {
		$v[\'selected\'] = $parent == $v[\'id\'] || $parent == $v[\'alias\']
			? \'selected\'
			: \'\';
		$data[\'sections\'] .= $Tickets->getChunk($tplSectionRow, $v);
		$Tickets->config[\'sections\'][] = $v[\'id\'];
	}
}

if (!empty($allowFiles)) {
	$q = $modx->newQuery(\'TicketFile\');
	$q->where(array(\'class\' => \'Ticket\'));
	$q->andCondition(array(\'parent\' => 0, \'createdby\' => $modx->user->id), null, 1);
	if (!empty($tid)) {
		$q->orCondition(array(\'parent\' => $tid), null, 1);
	}
	$q->sortby(\'createdon\', \'ASC\');
	$collection = $modx->getIterator(\'TicketFile\', $q);
	$files = \'\';
	/** @var TicketFile $item */
	foreach ($collection as $item) {
		if ($item->get(\'deleted\') && !$item->get(\'parent\')) {
			$item->remove();
		}
		else {
			$item = $item->toArray();
			$item[\'size\'] = round($item[\'size\'] / 1024, 2);
			$item[\'new\'] = empty($item[\'parent\']);
			$tpl = $item[\'type\'] == \'image\'
				? $tplImage
				: $tplFile;
			$files .= $Tickets->getChunk($tpl, $item);
		}
	}
	$data[\'files\'] = $Tickets->getChunk($tplFiles, array(
		\'files\' => $files,
	));
	/** @var modMediaSource $source */
	if ($source = $modx->getObject(\'sources.modMediaSource\', $source)) {
		$properties = $source->getPropertyList();
		$config = array(
			\'size\' => !empty($properties[\'maxUploadSize\'])
				? $properties[\'maxUploadSize\']
				: 3145728,
			\'height\' => !empty($properties[\'maxUploadHeight\'])
				? $properties[\'maxUploadHeight\']
				: 1080,
			\'width\' => !empty($properties[\'maxUploadWidth\'])
				? $properties[\'maxUploadWidth\']
				: 1920,
			\'extensions\' => !empty($properties[\'allowedFileTypes\'])
				? $properties[\'allowedFileTypes\']
				: \'jpg,jpeg,png,gif\'
		);
		$modx->regClientStartupScript(\'<script type="text/javascript">TicketsConfig.source=\' . $modx->toJSON($config) . \'</script>\', true);
	}
	$modx->regClientScript($Tickets->config[\'jsUrl\'] . \'web/lib/plupload/plupload.full.min.js\');
	$modx->regClientScript($Tickets->config[\'jsUrl\'] . \'web/files.js\');

	$lang = $modx->getOption(\'cultureKey\');
	if ($lang != \'en\' && file_exists($Tickets->config[\'jsPath\'] . \'web/lib/plupload/i18n/\' . $lang . \'.js\')) {
		$modx->regClientScript($Tickets->config[\'jsUrl\'] . \'web/lib/plupload/i18n/\' . $lang . \'.js\');
	}
}

$output = $Tickets->getChunk($tplWrapper, $data);
$key = md5($modx->toJSON($Tickets->config));
$_SESSION[\'TicketForm\'][$key] = $Tickets->config;
$output = str_ireplace(\'</form>\', "\\n<input type=\\"hidden\\" name=\\"form_key\\" value=\\"{$key}\\" class=\\"disable-sisyphus\\" />\\n</form>", $output);

return $output;',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'hideOnPagination' => 
      array (
        'fields' => 
        array (
          'id' => 58,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'hideOnPagination',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => 'if(isset($_GET[\'page\']) && $_GET[\'page\'] > 1)
return false;
else
return $out;',
          'locked' => false,
          'properties' => NULL,
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => 'if(isset($_GET[\'page\']) && $_GET[\'page\'] > 1)
return false;
else
return $out;',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
        ),
      ),
    ),
    'modTemplateVar' => 
    array (
      'meta_title' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'meta_title',
          'caption' => 'Заголовок страницы',
          'description' => '',
          'editor_type' => 0,
          'category' => 5,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'maxLength' => '',
            'minLength' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'meta_keywords' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'meta_keywords',
          'caption' => 'Мета keywords',
          'description' => '',
          'editor_type' => 0,
          'category' => 5,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'maxLength' => '',
            'minLength' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'meta_description' => 
      array (
        'fields' => 
        array (
          'id' => 3,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'meta_description',
          'caption' => 'Мета description',
          'description' => '',
          'editor_type' => 0,
          'category' => 5,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'maxLength' => '',
            'minLength' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
          'web' => 
          array (
          ),
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Content',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/content/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
    ),
  ),
);